[
  {"id":"allegrini_etal04","abstract":"In this paper we try to model certain features of human language complexity by means of advanced concepts borrowed from statistical mechanics. We use a time series approach, the diﬀusion entropy (DE) method, to compute the complexity of an italian corpus of newspapers and magazines. We ﬁnd that the anomalous scaling index is compatible with a simple dynamical model, a random walk on a complex scale-free network, which is linguistically related to Saussurre’s paradigms. The network complexity is independently measured on the same corpus, looking at the cooccurrence of nouns and verbs. This connection of cognitive complexity with long-range time correlations also provides an explanation for the famous Zipf’s law in terms of the generalized central limit theorem.","accessed":{"date-parts":[["2023",8,11]]},"author":[{"family":"Allegrini","given":"Paolo"},{"family":"Grigolini","given":"Paolo"},{"family":"Palatella","given":"Luigi"}],"citation-key":"allegrini_etal04","container-title":"Chaos, Solitons & Fractals","container-title-short":"Chaos, Solitons & Fractals","DOI":"10.1016/S0960-0779(03)00432-6","ISSN":"09600779","issue":"1","issued":{"date-parts":[["2004",4]]},"language":"en","page":"95-105","source":"DOI.org (Crossref)","title":"Intermittency and scale-free networks: a dynamical model for human language complexity","title-short":"Intermittency and scale-free networks","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0960077903004326","volume":"20"},
  {"id":"allenNetworkAnalysisReveals2019","abstract":"Vocal communication systems have a set of rules that govern the arrangement of acoustic signals, broadly defined as ‘syntax’. However, there is a limited understanding of potentially shared or analogous rules across vocal displays in different taxa. Recent work on songbirds has investigated syntax using network-based modelling. This technique quantifies features such as connectivity (adjacent signals in a sequence) and recurring patterns. Here, we apply network-based modelling to the complex, hierarchically structured songs of humpback whales (\n              Megaptera novaeangliae\n              ) from east Australia. Given the song's annual evolving pattern and the cultural conformity of males within a population, network modelling captured the patterns of multiple song types over 13 consecutive years. Song arrangements in each year displayed clear ‘small-world’ network structure, characterized by clusters of highly connected sounds. Transitions between these connected sounds further suggested a combination of both structural stability and variability. Small-world network structure within humpback songs may facilitate the characteristic and persistent vocal learning observed. Similar small-world structures and transition patterns are found in several birdsong displays, indicating common syntactic patterns among vocal learning in multiple taxa. Understanding the syntactic rules governing vocal displays in multiple, independently evolving lineages may indicate what rules or structural features are important to the evolution of complex communication, including human language.","accessed":{"date-parts":[["2023",5,29]]},"author":[{"family":"Allen","given":"Jenny A."},{"family":"Garland","given":"Ellen C."},{"family":"Dunlop","given":"Rebecca A."},{"family":"Noad","given":"Michael J."}],"citation-key":"allenNetworkAnalysisReveals2019","container-title":"Proceedings of the Royal Society B: Biological Sciences","container-title-short":"Proc. R. Soc. B.","DOI":"10.1098/rspb.2019.2014","ISSN":"0962-8452, 1471-2954","issue":"1917","issued":{"date-parts":[["2019",12,18]]},"language":"en","page":"20192014","source":"DOI.org (Crossref)","title":"Network analysis reveals underlying syntactic features in a vocally learnt mammalian display, humpback whale song","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rspb.2019.2014","volume":"286"},
  {"id":"altmann_etal12","abstract":"The complexity of human interactions with social and natural phenomena is mirrored in the way we describe our experiences through natural language. In order to retain and convey such a high dimensional information, the statistical properties of our linguistic output has to be highly correlated in time. An example are the robust observations, still largely not understood, of correlations on arbitrary long scales in literary texts. In this paper we explain how long-range correlations flow from highly structured linguistic levels down to the building blocks of a text (words, letters, etc..). By combining calculations and data analysis we show that correlations take form of a bursty sequence of events once we approach the semantically relevant topics of the text. The mechanisms we identify are fairly general and can be equally applied to other hierarchical settings.","accessed":{"date-parts":[["2023",8,11]]},"author":[{"family":"Altmann","given":"Eduardo G."},{"family":"Cristadoro","given":"Giampaolo"},{"family":"Esposti","given":"Mirko Degli"}],"citation-key":"altmann_etal12","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.1117723109","ISSN":"0027-8424, 1091-6490","issue":"29","issued":{"date-parts":[["2012",7,17]]},"language":"en","page":"11582-11587","source":"DOI.org (Crossref)","title":"On the origin of long-range correlations in texts","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.1117723109","volume":"109"},
  {"id":"alvarez-lacalle_etal06","abstract":"Thoughts and ideas are multidimensional and often concurrent, yet they can be expressed surprisingly well sequentially by the translation into language. This reduction of dimensions occurs naturally but requires memory and necessitates the existence of correlations, e.g., in written text. However, correlations in word appearance decay quickly, while previous observations of long-range correlations using random walk approaches yield little insight on memory or on semantic context. Instead, we study combinations of words that a reader is exposed to within a “window of attention,” spanning about 100 words. We define a vector space of such word combinations by looking at words that co-occur within the window of attention, and analyze its structure. Singular value decomposition of the co-occurrence matrix identifies a basis whose vectors correspond to specific topics, or “concepts” that are relevant to the text. As the reader follows a text, the “vector of attention” traces out a trajectory of directions in this “concept space.” We find that memory of the direction is retained over long times, forming power-law correlations. The appearance of power laws hints at the existence of an underlying hierarchical network. Indeed, imposing a hierarchy similar to that defined by volumes, chapters, paragraphs, etc. succeeds in creating correlations in a surrogate random text that are identical to those of the original text. We conclude that hierarchical structures in text serve to create long-range correlations, and use the reader’s memory in reenacting some of the multidimensionality of the thoughts being expressed.","accessed":{"date-parts":[["2023",8,11]]},"author":[{"family":"Alvarez-Lacalle","given":"E."},{"family":"Dorow","given":"B."},{"family":"Eckmann","given":"J.-P."},{"family":"Moses","given":"E."}],"citation-key":"alvarez-lacalle_etal06","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.0510673103","ISSN":"0027-8424, 1091-6490","issue":"21","issued":{"date-parts":[["2006",5,23]]},"language":"en","page":"7956-7961","source":"DOI.org (Crossref)","title":"Hierarchical structures induce long-range dynamical correlations in written texts","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.0510673103","volume":"103"},
  {"id":"ausloos14","accessed":{"date-parts":[["2023",9,7]]},"author":[{"family":"Ausloos","given":"Marcel"}],"citation-key":"ausloos14","container-title":"Scientometrics","container-title-short":"Scientometrics","DOI":"10.1007/s11192-014-1302-y","ISSN":"0138-9130, 1588-2861","issue":"3","issued":{"date-parts":[["2014",12]]},"language":"en","page":"1565-1586","source":"DOI.org (Crossref)","title":"Zipf–Mandelbrot–Pareto model for co-authorship popularity","type":"article-journal","URL":"http://link.springer.com/10.1007/s11192-014-1302-y","volume":"101"},
  {"id":"Barrett2019","author":[{"family":"Barrett","given":"Brendan J."}],"citation-key":"Barrett2019","container-title":"Behavioural Processes","DOI":"10.1016/j.beproc.2018.01.011","issued":{"date-parts":[["2019"]]},"page":"129-138","title":"Equifinality in empirical studies of cultural transmission","type":"article-journal","volume":"161"},
  {"id":"beckage_etal11","abstract":"Network analysis has demonstrated that systems ranging from social networks to electric power grids often involve a small world structure-with local clustering but global ac cess. Critically, small world structure has also been shown to characterize adult human semantic networks. Moreover, the connectivity pattern of these mature networks is consistent with lexical growth processes in which children add new words to their vocabulary based on the structure of the language-learning environment. However, thus far, there is no direct evidence that a child’s individual semantic network structure is associated with their early language learning. Here we show that, while typically developing children’s early networks show small world structure as early as 15 months and with as few as 55 words, children with language delay (late talkers) have this structure to a smaller degree. This implicates a maladaptive bias in word acquisition for late talkers, potentially indicating a preference for ‘‘oddball’’ words. The findings provide the first evidence of a link between small-world connectivity and lexical development in individual children.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Beckage","given":"Nicole"},{"family":"Smith","given":"Linda"},{"family":"Hills","given":"Thomas"}],"citation-key":"beckage_etal11","container-title":"PLoS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0019348","editor":[{"family":"Perc","given":"Matjaz"}],"ISSN":"1932-6203","issue":"5","issued":{"date-parts":[["2011",5,11]]},"language":"en","page":"e19348","source":"DOI.org (Crossref)","title":"Small worlds and semantic network growth in typical and late talkers","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0019348","volume":"6"},
  {"id":"benedict_najar19","abstract":"Researchers studying the evolution of animal communication often ask what generates and maintains signal complexity, but they define and measure complexity in different ways. If different metrics are not concordant, then studies using them are probably not comparable. In this study, we asked whether 7 metrics of bird song complexity vary in tandem among individuals of a single species, the Rock Wren (Salpinctes obsoletus). The included metrics were chosen because they are regularly used by researchers in the field to test hypotheses within the literature. Results indicated that none of the metrics positively correlated with any others, suggesting that bird songs are not under general selective pressures favoring increased complexity across multiple features. If metrics of signal complexity are not correlated, then care should be taken when designing analyses and comparing results. Researchers should always clearly define the “complexity” under investigation and verify that it has significance to the study species. Contradictory outcomes among existing research into signal “complexity”may result from the fact that this single word is used to represent multiple independent traits.","accessed":{"date-parts":[["2023",8,25]]},"author":[{"family":"Benedict","given":"Lauryn"},{"family":"Najar","given":"Nadje A"}],"citation-key":"benedict_najar19","container-title":"The Auk","DOI":"10.1093/auk/uky008","ISSN":"0004-8038, 1938-4254","issue":"1","issued":{"date-parts":[["2019",1,1]]},"language":"en","page":"uky008","source":"DOI.org (Crossref)","title":"Are commonly used metrics of bird song complexity concordant?","type":"article-journal","URL":"https://academic.oup.com/auk/article/doi/10.1093/auk/uky008/5307198","volume":"136"},
  {"id":"bentz_ferrer-i-cancho16","abstract":"Words that are used more frequently tend to be shorter. This statement is known as Zipf’s law of abbreviation. Here we perform the widest investigation of the presence of the law to date. In a sample of 1262 texts and 986 different languages - about 13% of the world’s language diversity - a negative correlation between word frequency and word length is found in all cases. In line with Zipf’s original proposal, we argue that this universal trend is likely to derive from fundamental principles of information processing and transfer.","author":[{"family":"Bentz","given":"Christian"},{"family":"Ferrer-i-Cancho","given":"Ramon"}],"citation-key":"bentz_ferrer-i-cancho16","container-title":"Proceedings of the Leiden Workshop on Capturing Phylogenetic Algorithms for Linguistics","DOI":"10.15496/publikation-10057","issued":{"date-parts":[["2016"]]},"language":"en","page":"1-4","title":"Zipf’s law of abbreviation as a language universal","type":"paper-conference"},
  {"id":"bermudez-cuamatzin_etal09","abstract":"The influence of ambient noise in shaping birdsong attributes has received much attention lately. Recent work shows that some birds sing higher-pitched songs in noisy areas, which may allow them to avoid acoustic interference; yet it is not clear how this is achieved. Higherpitched songs may be produced either by using the same syllable types in quiet and noisy areas, but singing them at a higher frequency in the latter (syllable pitch plasticity), or by using different syllable types in silent and in noisy circumstances (differential syllable use). Here we explored both strategies in the Mexico City population of house finch (Carpodacus mexicanus), a species known to possess a repertoire of several hundreds of syllable types. Birds produced songs with higher minimum frequencies in noisy than in quiet areas. This was mostly due to the minimum frequency of some syllable types being higher in noisy areas than in quiet locations. Also, males modulated the minimum frequency of the same syllable type during momentary increases of noise. Our results can help explain the high success of house finches at colonizing urban areas, while providing evidence of syllable pitch plasticity.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Bermúdez-Cuamatzin","given":"Eira"},{"family":"Garcia","given":"Constantino Macías"},{"family":"Ríos-Chelén","given":"Alejandro Ariel"},{"family":"Gil","given":"Diego"}],"citation-key":"bermudez-cuamatzin_etal09","container-title":"Behaviour","container-title-short":"Behav","DOI":"10.1163/156853909X423104","ISSN":"0005-7959, 1568-539X","issue":"9","issued":{"date-parts":[["2009"]]},"language":"en","page":"1269-1286","source":"DOI.org (Crossref)","title":"Strategies of song adaptation to urban noise in the house finch: syllable pitch plasticity or differential syllable use?","title-short":"Strategies of song adaptation to urban noise in the house finch","type":"article-journal","URL":"https://brill.com/view/journals/beh/146/9/article-p1269_6.xml","volume":"146"},
  {"id":"bermudez-cuamatzin_etal23","abstract":"Human activities can be noisy, especially in urban areas, and affect animals detrimentally. Trafﬁc noise may interfere with acoustic communication through masking and may yield noise-dependent modiﬁcation of acoustic signals. Such vocal ﬂexibility in birds has been investigated most often for songs, but rarely for calls, even though calls are typically used more frequently. Here we exposed male House Finches Haemorhous mexicanus from urban areas in Mexico City to low and high levels of anthropogenic noise. We investigated: variation in call type repertoire use among birds caught at localities with different noise levels, call type use in response to experimental noise exposure, and whether there were immediate noise-dependent spectral or temporal adjustments. We found no locality-dependent call repertoires, as males from all sites shared most of their call types. Males in quiet areas called with higher frequency and longer duration than did birds from noisier areas. However, this case study lacked replication of sites, limiting the generality of conclusions that can be drawn. Under experimental noise exposure, we also found no shift in call repertoire use. However, in line with expectations, one of two dominant call types of relatively low frequency showed an increase in peak frequency under experimentally elevated noise conditions, and the birds also produced shorter versions of the two dominant call types in the noisier treatment. In summary, we found no evidence for noise-dependent call repertoire use in our case study but we conﬁrmed experimentally that House Finches are capable of immediate spectral and temporal call adjustments in response to noise level ﬂuctuations.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Bermúdez‐Cuamatzin","given":"Eira"},{"family":"Slabbekoorn","given":"Hans"},{"family":"Macías Garcia","given":"Constantino"}],"citation-key":"bermudez-cuamatzin_etal23","container-title":"Ibis","container-title-short":"Ibis","DOI":"10.1111/ibi.13161","ISSN":"0019-1019, 1474-919X","issue":"2","issued":{"date-parts":[["2023",4]]},"language":"en","page":"571-586","source":"DOI.org (Crossref)","title":"Spectral and temporal call flexibility of House Finches (Haemorhous mexicanus) from urban areas during experimental noise exposure","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1111/ibi.13161","volume":"165"},
  {"id":"berwick_etal11","accessed":{"date-parts":[["2023",8,29]]},"author":[{"family":"Berwick","given":"Robert C."},{"family":"Okanoya","given":"Kazuo"},{"family":"Beckers","given":"Gabriel J.L."},{"family":"Bolhuis","given":"Johan J."}],"citation-key":"berwick_etal11","container-title":"Trends in Cognitive Sciences","container-title-short":"Trends in Cognitive Sciences","DOI":"10.1016/j.tics.2011.01.002","ISSN":"13646613","issue":"3","issued":{"date-parts":[["2011",3]]},"language":"en","page":"113-121","source":"DOI.org (Crossref)","title":"Songs to syntax: the linguistics of birdsong","title-short":"Songs to syntax","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1364661311000039","volume":"15"},
  {"id":"bialek_shaevitz23","abstract":"The explosion of data on animal behavior in more natural contexts highlights the fact that these behaviors exhibit correlations across many time scales. But there are major challenges in analyzing these data: records of behavior in single animals have fewer independent samples than one might expect; in pooling data from multiple animals, individual differences can mimic long-ranged temporal correlations; conversely long-ranged correlations can lead to an over-estimate of individual differences. We suggest an analysis scheme that addresses these problems directly, apply this approach to data on the spontaneous behavior of walking flies, and find evidence for scale invariant correlations over nearly three decades in time, from seconds to one hour. Three different measures of correlation are consistent with a single underlying scaling field of dimension $\\Delta = 0.180\\pm 0.005$.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Bialek","given":"William"},{"family":"Shaevitz","given":"Joshua W."}],"citation-key":"bialek_shaevitz23","issued":{"date-parts":[["2023",4,19]]},"language":"en","number":"arXiv:2304.09608","publisher":"arXiv","source":"arXiv.org","title":"Long time scales, individual differences, and scale invariance in animal behavior","type":"article","URL":"http://arxiv.org/abs/2304.09608"},
  {"id":"boroda_altmann91","author":[{"family":"Boroda","given":"M"},{"family":"Altmann","given":"G"}],"citation-key":"boroda_altmann91","container-title":"Musikometrica","issued":{"date-parts":[["1991"]]},"page":"1-13","title":"Menzerath's law in musical texts","type":"article-journal","volume":"3"},
  {"id":"Briefer2010","abstract":"In songbirds, song complexity and song sharing are features of prime importance for territorial defence and mate attraction. These aspects of song may be strongly influenced by changes in social environment caused by habitat fragmentation. We tested the hypothesis that habitat fragmentation induced by human activities influences song complexity and song sharing in the skylark, a songbird with a very large repertoire and whose population recently underwent a large decline. We applied powerful mathematical and statistical tools to assess and compare song complexity and song sharing patterns of syllables and sequences of syllables in two populations: a declining population in a fragmented habitat, in which breeding areas are separated from each other by unsuitable surroundings, and a stable population in a continuous habitat. Our results show that the structure of the habitat influences song sharing, but not song complexity. Neighbouring birds shared more syllables and sequences of syllables in the fragmented habitat than in the continuous one. Habitat fragmentation seems thus to have an effect on the composition of elements in songs, but not on the number and complexity of these elements, which may be a fixed feature of song peculiar to skylarks. © 2009 Elsevier Ltd.","author":[{"family":"Briefer","given":"Elodie"},{"family":"Osiejuk","given":"Tomasz S."},{"family":"Rybak","given":"Fanny"},{"family":"Aubin","given":"Thierry"}],"citation-key":"Briefer2010","container-title":"Journal of Theoretical Biology","DOI":"10.1016/j.jtbi.2009.09.020","ISSN":"00225193","issue":"1","issued":{"date-parts":[["2010"]]},"page":"151-164","publisher":"Elsevier","title":"Are bird song complexity and song sharing shaped by habitat structure? An information theory and statistical approach","type":"article-journal","URL":"http://dx.doi.org/10.1016/j.jtbi.2009.09.020","volume":"262"},
  {"id":"burkner17","abstract":"The brms package implements Bayesian multilevel models in R using the probabilistic programming language Stan. A wide range of distributions and link functions are supported, allowing users to ﬁt – among others – linear, robust linear, binomial, Poisson, survival, ordinal, zero-inﬂated, hurdle, and even non-linear models all in a multilevel context. Further modeling options include autocorrelation of the response variable, user deﬁned covariance structures, censored data, as well as meta-analytic standard errors. Prior speciﬁcations are ﬂexible and explicitly encourage users to apply prior distributions that actually reﬂect their beliefs. In addition, model ﬁt can easily be assessed and compared with the Watanabe-Akaike information criterion and leave-one-out cross-validation.","accessed":{"date-parts":[["2023",8,15]]},"author":[{"family":"Bürkner","given":"Paul-Christian"}],"citation-key":"burkner17","container-title":"Journal of Statistical Software","container-title-short":"J. Stat. Soft.","DOI":"10.18637/jss.v080.i01","ISSN":"1548-7660","issue":"1","issued":{"date-parts":[["2017"]]},"language":"en","source":"DOI.org (Crossref)","title":"brms: an R package for Bayesian multilevel models using Stan","type":"article-journal","URL":"http://www.jstatsoft.org/v80/i01/","volume":"80"},
  {"id":"canchoSmallWorldHuman2001","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Cancho","given":"Ramon Ferrer","dropping-particle":"i"},{"family":"Solé","given":"Richard V."}],"citation-key":"canchoSmallWorldHuman2001","container-title":"Proceedings of the Royal Society of London. Series B: Biological Sciences","container-title-short":"Proc. R. Soc. Lond. B","DOI":"10.1098/rspb.2001.1800","ISSN":"0962-8452, 1471-2954","issue":"1482","issued":{"date-parts":[["2001",11,7]]},"language":"en","page":"2261-2265","source":"DOI.org (Crossref)","title":"The small world of human language","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rspb.2001.1800","volume":"268"},
  {"id":"caplan_etal20","abstract":"Is language designed for communicative and functional efficiency? G. K. Zipf famously argued that shorter words are more frequent because they are easier to use, thereby resulting in the statistical law that bears his name. Yet, G. A. Miller showed that even a monkey randomly typing at a keyboard, and intermittently striking the space bar, would generate “words” with similar statistical properties. Recent quantitative analyses of human language lexicons (Piantadosi et al., 2012) have revived Zipf's functionalist hypothesis. Ambiguous words tend to be short, frequent, and easy to articulate in language production. Such statistical findings are commonly interpreted as evidence for pressure for efficiency, as the context of language use often provides cues to overcome lexical ambiguity. In this study, we update Miller's monkey thought experiment to incorporate empirically motivated phonological and semantic constraints on the creation of words. We claim that the appearance of communicative efficiency is a spandrel (Gould & Lewontin, 1979), as lexicons formed without the context of language use or reference to communication or efficiency exhibit comparable statistical properties. Furthermore, the updated monkey model provides a good fit for the growth trajectory of English as recorded in the Oxford English Dictionary. Focusing on the history of English words since 1900, we show that lexicons resulting from the monkey model provide a better embodiment of communicative efficiency than the actual lexicon of English. We conclude by arguing for the need to go beyond correlational statistics and to seek direct evidence for the me­ chanisms that underlie principles of language design.","accessed":{"date-parts":[["2023",9,22]]},"author":[{"family":"Caplan","given":"Spencer"},{"family":"Kodner","given":"Jordan"},{"family":"Yang","given":"Charles"}],"citation-key":"caplan_etal20","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2020.104466","ISSN":"00100277","issued":{"date-parts":[["2020",12]]},"language":"en","page":"104466","source":"DOI.org (Crossref)","title":"Miller's monkey updated: communicative efficiency and the statistics of words in natural language","title-short":"Miller's monkey updated","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027720302857","volume":"205"},
  {"id":"carr_etal17","abstract":"Language maps signals onto meanings through the use of two distinct types of structure. First, the space of meanings is discretized into categories that are shared by all users of the language. Second, the signals employed by the language are compositional: The meaning of the whole is a function of its parts and the way in which those parts are combined. In three iterated learning experiments using a vast, continuous, open-ended meaning space, we explore the conditions under which both structured categories and structured signals emerge ex nihilo. While previous experiments have been limited to either categorical structure in meanings or compositional structure in signals, these experiments demonstrate that when the meaning space lacks clear preexisting boundaries, more subtle morphological structure that lacks straightforward compositionality —as found in natural languages—may evolve as a solution to joint pressures from learning and communication.","accessed":{"date-parts":[["2023",8,29]]},"author":[{"family":"Carr","given":"Jon W."},{"family":"Smith","given":"Kenny"},{"family":"Cornish","given":"Hannah"},{"family":"Kirby","given":"Simon"}],"citation-key":"carr_etal17","container-title":"Cognitive Science","container-title-short":"Cogn Sci","DOI":"10.1111/cogs.12371","ISSN":"03640213","issue":"4","issued":{"date-parts":[["2017",5]]},"language":"en","page":"892-923","source":"DOI.org (Crossref)","title":"The cultural evolution of structured languages in an open-ended, continuous world","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1111/cogs.12371","volume":"41"},
  {"id":"charbonneau_bourrat21","abstract":"High-fidelity cultural transmission, rather than brute intelligence, is the secret of our species’ success, or so many cultural evolutionists claim. It has been selected because it ensures the spread, stability and longevity of beneficial cultural traditions, and it supports cumulative cultural change. To play these roles, however, fidelity must be a causally-efficient property of cultural transmission. This is where the grain problem comes in and challenges the explanatory potency of fidelity. Assessing the degree of fidelity of any episode or mechanism of cultural transmission always depends upon an investigator’s choice of grain of description at which cultural traditions are being studied. The fidelity of cultural transmission then appears to be relative to the granularity at which one approaches cultural variation, and since there is a multiplicity of grains of description by which the same tradition can be studied, there results a multiplicity of measures of fidelity for a same event or mechanism of cultural transmission. If this is correct, because fidelity is always relative to the grain of description dictated by the local and specific research interests of the investigator, then there seems to be no fact of the matter as to whether cultural transmission is faithful or not, independently from a researcher’s framework of analysis. The aims of this paper are to offer a conceptual clarification of the grain problem in cultural evolution, to assess its causes, to unpack its epistemological implications, and to examine its reach and consequences for a science of cultural evolution.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Charbonneau","given":"Mathieu"},{"family":"Bourrat","given":"Pierrick"}],"citation-key":"charbonneau_bourrat21","container-title":"Synthese","container-title-short":"Synthese","DOI":"10.1007/s11229-021-03047-1","ISSN":"0039-7857, 1573-0964","issue":"3-4","issued":{"date-parts":[["2021",12]]},"language":"en","page":"5815-5836","source":"DOI.org (Crossref)","title":"Fidelity and the grain problem in cultural evolution","type":"article-journal","URL":"https://link.springer.com/10.1007/s11229-021-03047-1","volume":"199"},
  {"id":"chater_brown99","abstract":"How can the classical psychological laws be explained and uniﬁed? It is proposed here that scale-invariance is a unifying principle. Distributions of many environmental magnitudes are observed to be scale invariant; that is, the statistical structure of the world remains the same at different measurement scales [Mandelbrot, B., 1982. The Fractal Geometry of Nature (2nd Edn.). W.H. Freeman, San Francisco, CA; Bak, P., 1997. How Nature Works: The Science of Self-organized Criticality. Oxford University Press, Oxford, UK]. We hypothesise that the perceptual-motor system reﬂects and preserves these scale invariances. This allows derivation of several of the most widely applicable psychological laws governing perception and action across domains and species (Weber’s, Stevens’, Fitts’ and Pie´ron’s Laws). We suggest that these fundamental laws reﬂect accommodation of the perceptuo-motor system to the scaleinvariant physical world and therefore have a common foundation. © 1999 Elsevier Science B.V. All rights reserved.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Chater","given":"Nick"},{"family":"Brown","given":"Gordon D.A"}],"citation-key":"chater_brown99","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/S0010-0277(98)00066-3","ISSN":"00100277","issue":"3","issued":{"date-parts":[["1999",1]]},"language":"en","page":"B17-B24","source":"DOI.org (Crossref)","title":"Scale-invariance as a unifying psychological principle","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027798000663","volume":"69"},
  {"id":"Chimento2020","author":[{"family":"Chimento","given":"Michael"},{"family":"Alarcón-Nieto","given":"Gustavo"},{"family":"Aplin","given":"Lucy"}],"citation-key":"Chimento2020","container-title":"Current Biology","DOI":"10.1016/j.cub.2021.03.057","issued":{"date-parts":[["2021"]]},"page":"2477-2483","title":"Population turnover facilitates cultural selection for efficiency","type":"article-journal","volume":"31"},
  {"id":"chomsky57","author":[{"family":"Chomsky","given":"Noam"}],"citation-key":"chomsky57","issued":{"date-parts":[["1957"]]},"publisher":"Mouton & Co.","title":"Syntactic Structures","type":"book"},
  {"id":"Ciaburri2019","author":[{"family":"Ciaburri","given":"Ivy"},{"family":"Williams","given":"Heather"}],"citation-key":"Ciaburri2019","container-title":"Animal Behaviour","DOI":"10.1016/j.anbehav.2018.11.001","issued":{"date-parts":[["2019"]]},"page":"33-42","publisher":"Elsevier Ltd","title":"Context-dependent variation of house finch song syntax","type":"article-journal","volume":"147"},
  {"id":"clink_etal20","accessed":{"date-parts":[["2023",6,1]]},"author":[{"family":"Clink","given":"Dena J."},{"family":"Ahmad","given":"Abdul Hamid"},{"family":"Klinck","given":"Holger"}],"citation-key":"clink_etal20","container-title":"Royal Society Open Science","container-title-short":"R. Soc. open sci.","DOI":"10.1098/rsos.200151","ISSN":"2054-5703","issue":"4","issued":{"date-parts":[["2020",4]]},"language":"en","page":"200151","source":"DOI.org (Crossref)","title":"Brevity is not a universal in animal communication: evidence for compression depends on the unit of analysis in small ape vocalizations","title-short":"Brevity is not a universal in animal communication","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rsos.200151","volume":"7"},
  {"id":"clink_lau20","abstract":"Across diverse systems including language, music and genomes, there is a tendency for longer sequences to contain shorter constituents; this phenomenon is known as Menzerath's Law. Whether Menzerath's Law is a universal in biological systems, is the result of compression (wherein shortest possible strings represent the maximum amount of information) or emerges from an inevitable relationship between sequence and constituent length remains a topic of debate. In non-human primates, the vocalizations of geladas, male gibbons and chimpanzees exhibit patterns consistent with Menzerath's Law. Here, we use existing datasets of three duetting primate species (tarsiers, titi monkeys and gibbons) to examine the wide-scale applicability of Menzerath's Law. Primate duets provide a useful comparative model to test for the broad-scale applicability of Menzerath's Law, as they evolved independently under presumably similar selection pressures and are emitted under the same context(s) across taxa. Only four out of the eight call types we examined were consistent with Menzerath's Law. Two of these call types exhibited a negative relationship between the position of the note in the call and note duration, indicating that adherence to Menzerath's Law in these call types may be related to breathing constraints. Exceptions to Menzerath's Law occur when notes are relatively homogeneous, or when species-specific call structure leads to a deterministic decrease in note duration. We show that adherence to Menzerath's Law is the exception rather than the rule in duetting primates. It is possible that selection pressures for long-range signals that can travel effectively over large distances was stronger than that of compression in primate duets. Future studies investigating adherence to Menzerath's Law across the vocal repertoires of these species will help us better elucidate the pressures that shape both short- and long-distance acoustic signals.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Clink","given":"Dena J."},{"family":"Lau","given":"Allison R."}],"citation-key":"clink_lau20","container-title":"Royal Society Open Science","container-title-short":"R. Soc. open sci.","DOI":"10.1098/rsos.201557","ISSN":"2054-5703","issue":"11","issued":{"date-parts":[["2020",11]]},"language":"en","page":"201557","source":"DOI.org (Crossref)","title":"Adherence to Menzerath's Law is the exception (not the rule) in three duetting primate species","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rsos.201557","volume":"7"},
  {"id":"cody_etal16","abstract":"We describe songs of the California Thrasher (Toxostoma redivivum), a territorial, monogamous species whose complex songs are composed of extended sequences of phonetically diverse phrases. We take a network approach, so that network nodes represent specific phrases, and links or transitions between nodes describe a subgroup structure that reveals the syntax of phrases within the songs. We found that individual birds have large and largely distinct repertoires, with limited phrase sharing between neighbours and repertoire similarity decaying between individuals with distance apart, decaying also over time within individuals. During song sequences, only a limited number of phrases (ca. 15–20) were found to be actually“in play”at any given time; these phrases can be grouped into themes within which transitions are much more common than among them, a feature contributing to a small-world structure. It appears that such “smallworld themes” arise abruptly, while old themes are abandoned more gradually during extended song sequences; most individual thrashers switch among 3–4 themes over the course of several successive songs, and some small-world themes appear to have specific roles in starting or ending thrasher songs.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Cody","given":"Martin L."},{"family":"Stabler","given":"Edward"},{"family":"Sánchez Castellanos","given":"Héctor Manuel"},{"family":"Taylor","given":"Charles E."}],"citation-key":"cody_etal16","container-title":"Bioacoustics","container-title-short":"Bioacoustics","DOI":"10.1080/09524622.2015.1089418","ISSN":"0952-4622, 2165-0586","issue":"1","issued":{"date-parts":[["2016",1,2]]},"language":"en","page":"41-54","source":"DOI.org (Crossref)","title":"Structure, syntax and “small-world” organization in the complex songs of California Thrashers (<i>Toxostoma redivivum</i>)","type":"article-journal","URL":"http://www.tandfonline.com/doi/full/10.1080/09524622.2015.1089418","volume":"25"},
  {"id":"corral_serra20","abstract":"An important body of quantitative linguistics is constituted by a series of statistical laws about language usage. Despite the importance of these linguistic laws, some of them are poorly formulated, and, more importantly, there is no uniﬁed framework that encompasses all them. This paper presents a new perspective to establish a connection between different statistical linguistic laws. Characterizing each word type by two random variables—length (in number of characters) and absolute frequency—we show that the corresponding bivariate joint probability distribution shows a rich and precise phenomenology, with the type-length and the type-frequency distributions as its two marginals, and the conditional distribution of frequency at ﬁxed length providing a clear formulation for the brevity-frequency phenomenon. The type-length distribution turns out to be well ﬁtted by a gamma distribution (much better than with the previously proposed lognormal), and the conditional frequency distributions at ﬁxed length display power-law-decay behavior with a ﬁxed exponent α 1.4 and a characteristic-frequency crossover that scales as an inverse power δ 2.8 of length, which implies the fulﬁllment of a scaling law analogous to those found in the thermodynamics of critical phenomena. As a by-product, we ﬁnd a possible model-free explanation for the origin of Zipf’s law, which should arise as a mixture of conditional frequency distributions governed by the crossover length-dependent frequency.","accessed":{"date-parts":[["2023",9,12]]},"author":[{"family":"Corral","given":"Álvaro"},{"family":"Serra","given":"Isabel"}],"citation-key":"corral_serra20","container-title":"Entropy","container-title-short":"Entropy","DOI":"10.3390/e22020224","ISSN":"1099-4300","issue":"2","issued":{"date-parts":[["2020",2,17]]},"language":"en","page":"224","source":"DOI.org (Crossref)","title":"The brevity law as a scaling law, and a possible origin of Zipf’s law for word frequencies","type":"article-journal","URL":"https://www.mdpi.com/1099-4300/22/2/224","volume":"22"},
  {"id":"cramer05","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Cramer","given":"Irene"}],"citation-key":"cramer05","container-title":"Journal of Quantitative Linguistics","container-title-short":"Journal of Quantitative Linguistics","DOI":"10.1080/09296170500055301","ISSN":"0929-6174, 1744-5035","issue":"1","issued":{"date-parts":[["2005",4]]},"language":"en","page":"41-52","source":"DOI.org (Crossref)","title":"The parameters of the Altmann-Menzerath law","type":"article-journal","URL":"http://www.tandfonline.com/doi/abs/10.1080/09296170500055301","volume":"12"},
  {"id":"deboer00","accessed":{"date-parts":[["2023",8,30]]},"author":[{"family":"De Boer","given":"Bart"}],"citation-key":"deboer00","container-title":"Journal of Phonetics","container-title-short":"Journal of Phonetics","DOI":"10.1006/jpho.2000.0125","ISSN":"00954470","issue":"4","issued":{"date-parts":[["2000",10]]},"language":"en","page":"441-465","source":"DOI.org (Crossref)","title":"Self-organization in vowel systems","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0095447000901256","volume":"28"},
  {"id":"demartsev_etal19","accessed":{"date-parts":[["2023",6,1]]},"author":[{"family":"Demartsev","given":"Vlad"},{"family":"Gordon","given":"Naomi"},{"family":"Barocas","given":"Adi"},{"family":"Bar-Ziv","given":"Einat"},{"family":"Ilany","given":"Tchia"},{"family":"Goll","given":"Yael"},{"family":"Ilany","given":"Amiyaal"},{"family":"Geffen","given":"Eli"}],"citation-key":"demartsev_etal19","container-title":"Evolution Letters","DOI":"10.1002/evl3.147","ISSN":"2056-3744","issue":"6","issued":{"date-parts":[["2019",12,1]]},"language":"en","page":"623-634","source":"DOI.org (Crossref)","title":"The “law of brevity” in animal communication: sex-specific signaling optimization is determined by call amplitude rather than duration","title-short":"The “Law of Brevity” in animal communication","type":"article-journal","URL":"https://academic.oup.com/evlett/article/3/6/623/6697448","volume":"3"},
  {"id":"diezZebraFinchesGo2020","abstract":"Vocal learning in songbirds is guided by experience and experience-independent factors. Previously, lineages of zebra finches founded by isolate-reared tutors showed cultural evolution to wild-type song. This suggests that experience-independent biases affect song development even in the absence of wild-type song. We hypothesized that cultural evolution of song depends on both experience-independent biases and tutor songs available. We predicted that songs more distant from wild-type would take longer to culturally evolve toward wild-type features. We bred zebra finches in three groups of lineages in which offspring of each generation served as tutors for the next. Lineages were founded with males singing wild-type song, isolate song, or heterospecific song. The two experimental lineages exhibited rapid cultural evolution of song with many temporal and spectral features converging to wild-type within two generations. However the rate of change differed depending on song features measured, and took longer for lineages founded with heterospecific song.","author":[{"family":"Diez","given":"Adriana"},{"family":"MacDougall-Shackleton","given":"Scott A."}],"citation-key":"diezZebraFinchesGo2020","container-title":"Behaviour","DOI":"10.1163/1568539X-00003588","ISSN":"1568539X","issue":"3-4","issued":{"date-parts":[["2020"]]},"page":"231-265","title":"Zebra finches go wild! Experimental cultural evolution of birdsong","type":"article-journal","volume":"157"},
  {"id":"ebeling94","abstract":"We investigated long-range correlations in two literary texts, <<MobyDyck. by H. Melville and G r i \" ' s tales. The analysis is based on the calculation of entropylike quantities as the mutual information for pairs of letters and the entropy, the mean uncertainty, per letter. We further estimate the number of different subwords of a given length n. Filtering out the contributions due to the effects of the finite length of the texts, we find correlations ranging to a few hundred letters. Scaling laws for the mutual information (decay with a power law), for the entropy per letter (decay with the inverse square root of n ) and for the word numbers (stretched exponential growth with n and with a power law of the text length) were found.","author":[{"family":"Ebeling","given":"W."},{"family":"Pöschel","given":"T."}],"citation-key":"ebeling94","container-title":"Europhysics Letters","DOI":"10.1209/0295-5075/26/4/001","issue":"4","issued":{"date-parts":[["1994"]]},"language":"en","source":"Zotero","title":"Entropy and long-range correlations in literary English","type":"article-journal","volume":"26"},
  {"id":"eroglu13","abstract":"The empirical law uncovered by Menzerath and formulated by Altmann, known as the Menzerath–Altmann law (henceforth the MA law), reveals the statistical distribution behavior of human language in various organizational levels. Building on previous studies relating organizational regularities in a language, we propose that the distribution of distinct (or different) words in a large text can effectively be described by the MA law. The validity of the proposition is demonstrated by examining two text corpora written in different languages not belonging to the same language family (English and Turkish). The results show not only that distinct word distribution behavior can accurately be predicted by the MA law, but that this result appears to be language-independent. This result is important not only for quantitative linguistic studies, but also may have significance for other naturally occurring organizations that display analogous organizational behavior. We also deliberately demonstrate that the MA law is a special case of the probability function of the generalized gamma distribution.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Eroglu","given":"Sertac"}],"citation-key":"eroglu13","container-title":"Physica A: Statistical Mechanics and its Applications","container-title-short":"Physica A: Statistical Mechanics and its Applications","DOI":"10.1016/j.physa.2013.02.012","ISSN":"03784371","issue":"12","issued":{"date-parts":[["2013",6]]},"language":"en","page":"2775-2780","source":"DOI.org (Crossref)","title":"Menzerath–Altmann law for distinct word distribution analysis in a large text","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0378437113001702","volume":"392"},
  {"id":"favaro_etal20","abstract":"Information compression is a general principle of human language: the most frequent words are shorter in length (Zipf's Law of Brevity) and the duration of constituents decreases as the size of the linguistic construct increases (Menzerath–Altmann Law). Vocal sequences of non-human primates have been shown to conform to both these laws, suggesting information compression might be a more general principle. Here, we investigated whether display songs of the African penguin, which mediate recognition, intersexual mate choice and territorial defence, conform with these laws. Display songs are long, loud sequences combining three types of syllables. We found that the shortest type of syllable was the most frequent (with the shortest syllable being repeated stereotypically, potentially favouring signal redundancy in crowded environments). We also found that the average duration of the song's constituents was negatively correlated with the size of the song (a consequence of increasing the relative number of the shortest syllable type, rather than reducing the duration across all syllable types, thus preserving the communication of size-related information in the duration of the longest syllable type). Our results provide the first evidence for conformity to Zipf's and Menzerath–Altmann Laws in the vocal sequences of a non-primate species, indicating that these laws can coexist with selection pressures specific to the species' ecology.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Favaro","given":"Livio"},{"family":"Gamba","given":"Marco"},{"family":"Cresta","given":"Eleonora"},{"family":"Fumagalli","given":"Elena"},{"family":"Bandoli","given":"Francesca"},{"family":"Pilenga","given":"Cristina"},{"family":"Isaja","given":"Valentina"},{"family":"Mathevon","given":"Nicolas"},{"family":"Reby","given":"David"}],"citation-key":"favaro_etal20","container-title":"Biology Letters","container-title-short":"Biol. Lett.","DOI":"10.1098/rsbl.2019.0589","ISSN":"1744-9561, 1744-957X","issue":"2","issued":{"date-parts":[["2020",2]]},"language":"en","page":"20190589","source":"DOI.org (Crossref)","title":"Do penguins’ vocal sequences conform to linguistic laws?","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rsbl.2019.0589","volume":"16"},
  {"id":"fay_ellison13","abstract":"This study examines the intergenerational transfer of human communication systems. It tests if human communication systems evolve to be easy to learn or easy to use (or both), and how population size affects learnability and usability. Using an experimental-semiotic task, we find that human communication systems evolve to be easier to use (production efficiency and reproduction fidelity), but harder to learn (identification accuracy) for a second generation of na¨ıve participants. Thus, usability trumps learnability. In addition, the communication systems that evolve in larger populations exhibit distinct advantages over those that evolve in smaller populations: the learnability loss (from the Initial signs) is more muted and the usability benefits are more pronounced. The usability benefits for human communication systems that evolve in a small and large population is explained through guided variation reducing sign complexity. The enhanced performance of the communication systems that evolve in larger populations is explained by the operation of a content bias acting on the larger pool of competing signs. The content bias selects for information-efficient iconic signs that aid learnability and enhance usability.","accessed":{"date-parts":[["2023",8,24]]},"author":[{"family":"Fay","given":"Nicolas"},{"family":"Ellison","given":"T. Mark"}],"citation-key":"fay_ellison13","container-title":"PLoS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0071781","editor":[{"family":"Caldwell","given":"Christine A."}],"ISSN":"1932-6203","issue":"8","issued":{"date-parts":[["2013",8,15]]},"language":"en","page":"e71781","source":"DOI.org (Crossref)","title":"The cultural evolution of human communication systems in different sized populations: usability trumps learnability","title-short":"The Cultural Evolution of Human Communication Systems in Different Sized Populations","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0071781","volume":"8"},
  {"id":"fedurek_etal17","abstract":"Background: Vocal sequences - utterances consisting of calls produced in close succession - are common phenomena in animal communication. While many studies have explored the adaptive benefits of producing such sequences, very little is known about how the costs and constraints involved in their production affect their form. Here, we investigated this issue in the chimpanzee (Pan troglodytes schweinfurthii) pant hoot, a long and structurally complex vocal sequence comprising four acoustically distinct phases – introduction, build-up, climax and let-down.\nResults: We found that in each of these phases, and for the sequence as a whole, there was a negative relationship between the number of calls produced and their average duration. There was also a negative relationship between the total duration of some adjacent phases. Significant relationships between the fundamental frequency of calls and their number or duration were found for some phases of the sequence, but the direction of these relationships differed between particular phases.\nConclusions: These results indicate that there are trade-offs in terms of signal duration at two levels in pant-hoot production: between call number and duration, and between the relative durations of successive phases. These trade-offs are likely to reflect biomechanical constraints on vocal sequence production. Phase-specific trade-offs also appear to occur between fundamental frequency and call number or duration, potentially reflecting that different phases of the sequence are associated with distinct types of information, linked in different ways to call pitch. Overall, this study highlights the important role of costs and constraints in shaping the temporal and acoustic structure of animal vocal sequences.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Fedurek","given":"Pawel"},{"family":"Zuberbühler","given":"Klaus"},{"family":"Semple","given":"Stuart"}],"citation-key":"fedurek_etal17","container-title":"Frontiers in Zoology","container-title-short":"Front Zool","DOI":"10.1186/s12983-017-0235-8","ISSN":"1742-9994","issue":"1","issued":{"date-parts":[["2017",12]]},"language":"en","page":"50","source":"DOI.org (Crossref)","title":"Trade-offs in the production of animal vocal sequences: insights from the structure of wild chimpanzee pant hoots","title-short":"Trade-offs in the production of animal vocal sequences","type":"article-journal","URL":"http://frontiersinzoology.biomedcentral.com/articles/10.1186/s12983-017-0235-8","volume":"14"},
  {"id":"fedzechkina_etal12","abstract":"Languages of the world display many structural similarities. We test the hypothesis that some of these structural properties may arise from biases operating during language acquisition that shape languages over time. Specifically, we investigate whether language learners are biased toward linguistic systems that strike an efficient balance between robust information transfer, on the one hand, and effort or resource demands, on the other hand, thereby increasing the communicative utility of the acquired language. In two experiments, we expose learners to miniature artificial languages designed in such a way that they do not use their formal devices (case marking) efficiently to facilitate robust information transfer. We find that learners restructure such languages in ways that facilitate efficient information transfer compared with the input language. These systematic changes introduced by the learners follow typologically frequent patterns, supporting the hypothesis that some of the structural similarities found in natural languages are shaped by biases toward communicatively efficient linguistic systems.","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Fedzechkina","given":"Maryia"},{"family":"Jaeger","given":"T. Florian"},{"family":"Newport","given":"Elissa L."}],"citation-key":"fedzechkina_etal12","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.1215776109","ISSN":"0027-8424, 1091-6490","issue":"44","issued":{"date-parts":[["2012",10,30]]},"language":"en","page":"17897-17902","source":"DOI.org (Crossref)","title":"Language learners restructure their input to facilitate efficient communication","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.1215776109","volume":"109"},
  {"id":"Feher2009","abstract":"Culture is typically viewed as consisting of traits inherited epigenetically, through social learning. However, cultural diversity has species-typical constraints, presumably of genetic origin. A celebrated, if contentious, example is whether a universal grammar constrains syntactic diversity in human languages. Oscine songbirds exhibit song learning and provide biologically tractable models of culture: members of a species show individual variation in song and geographically separated groups have local song dialects. Different species exhibit distinct song cultures, suggestive of genetic constraints. Without such constraints, innovations and copying errors should cause unbounded variation over multiple generations or geographical distance, contrary to observations. Here we report an experiment designed to determine whether wild-type song culture might emerge over multiple generations in an isolated colony founded by isolates, and, if so, how this might happen and what type of social environment is required. Zebra finch isolates, unexposed to singing males during development, produce song with characteristics that differ from the wild-type song found in laboratory or natural colonies. In tutoring lineages starting from isolate founders, we quantified alterations in song across tutoring generations in two social environments: tutor-pupil pairs in sound-isolated chambers and an isolated semi-natural colony. In both settings, juveniles imitated the isolate tutors but changed certain characteristics of the songs. These alterations accumulated over learning generations. Consequently, songs evolved towards the wild-type in three to four generations. Thus, species-typical song culture can appear de novo. Our study has parallels with language change and evolution. In analogy to models in quantitative genetics, we model song culture as a multigenerational phenotype partly encoded genetically in an isolate founding population, influenced by environmental variables and taking multiple generations to emerge.","author":[{"family":"Fehér","given":"Ola"},{"family":"Wang","given":"Haibin"},{"family":"Saar","given":"Sigal"},{"family":"Mitra","given":"Partha P"},{"family":"Tchernichovski","given":"Ofer"}],"citation-key":"Feher2009","container-title":"Nature","DOI":"10.1038/nature07994","ISBN":"1476-4687 (Electronic) 0028-0836 (Linking)","issue":"7246","issued":{"date-parts":[["2009"]]},"page":"564-568","PMID":"19412161","title":"De novo establishment of wild-type song culture in the zebra finch","type":"article-journal","URL":"http://www.ncbi.nlm.nih.gov/pubmed/19412161","volume":"459"},
  {"id":"fernandez-juricic_etal05","author":[{"family":"Fernández-Juricic","given":"Esteban"},{"family":"Poston","given":"Rachael"},{"family":"Collibus","given":"Karin De"},{"family":"Morgan","given":"Timothy"},{"family":"Bastain","given":"Bret"},{"family":"Martin","given":"Cyndi"},{"family":"Jones","given":"Kacy"},{"family":"Treminio","given":"Ronald"}],"citation-key":"fernandez-juricic_etal05","container-title":"Urban Habitats","issue":"1","issued":{"date-parts":[["2005"]]},"language":"en","source":"Zotero","title":"Microhabitat selection and singing behavior patterns of male house finches (Carpodacus mexicanus) in urban parks in a heavily urbanized landscape in the western U.S.","type":"article-journal","volume":"3"},
  {"id":"ferrer-i-cancho_elvevag10","abstract":"Background: Zipf’s law states that the relationship between the frequency of a word in a text and its rank (the most frequent word has rank 1, the 2nd most frequent word has rank 2,…) is approximately linear when plotted on a double logarithmic scale. It has been argued that the law is not a relevant or useful property of language because simple random texts - constructed by concatenating random characters including blanks behaving as word delimiters - exhibit a Zipf’s lawlike word rank distribution.\nMethodology/Principal Findings: In this article, we examine the flaws of such putative good fits of random texts. We demonstrate - by means of three different statistical tests - that ranks derived from random texts and ranks derived from real texts are statistically inconsistent with the parameters employed to argue for such a good fit, even when the parameters are inferred from the target real text. Our findings are valid for both the simplest random texts composed of equally likely characters as well as more elaborate and realistic versions where character probabilities are borrowed from a real text.\nConclusions/Significance: The good fit of random texts to real Zipf’s law-like rank distributions has not yet been established. Therefore, we suggest that Zipf’s law might in fact be a fundamental law in natural languages.","accessed":{"date-parts":[["2023",9,21]]},"author":[{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Elvevåg","given":"Brita"}],"citation-key":"ferrer-i-cancho_elvevag10","container-title":"PLoS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0009411","editor":[{"family":"Scalas","given":"Enrico"}],"ISSN":"1932-6203","issue":"3","issued":{"date-parts":[["2010",3,9]]},"language":"en","page":"e9411","source":"DOI.org (Crossref)","title":"Random texts do not exhibit the real Zipf's law-like rank distribution","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0009411","volume":"5"},
  {"id":"ferrer-i-cancho_etal13","abstract":"A key aim in biology and psychology is to identify fundamental principles underpinning the behavior of animals, including humans. Analyses of human language and the behavior of a range of non-human animal species have provided evidence for a common pattern underlying diverse behavioral phenomena: Words follow Zipf’s law of brevity (the tendency of more frequently used words to be shorter), and conformity to this general pattern has been seen in the behavior of a number of other animals. It has been argued that the presence of this law is a sign of efﬁcient coding in the information theoretic sense. However, no strong direct connection has been demonstrated between the law and compression, the information theoretic principle of minimizing the expected length of a code. Here, we show that minimizing the expected code length implies that the length of a word cannot increase as its frequency increases. Furthermore, we show that the mean code length or duration is signiﬁcantly small in human language, and also in the behavior of other species in all cases where agreement with the law of brevity has been found. We argue that compression is a general principle of animal behavior that reﬂects selection for efﬁciency of coding.","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Hernández-Fernández","given":"Antoni"},{"family":"Lusseau","given":"David"},{"family":"Agoramoorthy","given":"Govindasamy"},{"family":"Hsu","given":"Minna J."},{"family":"Semple","given":"Stuart"}],"citation-key":"ferrer-i-cancho_etal13","container-title":"Cognitive Science","container-title-short":"Cogn Sci","DOI":"10.1111/cogs.12061","ISSN":"03640213","issue":"8","issued":{"date-parts":[["2013",11]]},"language":"en","page":"1565-1578","source":"DOI.org (Crossref)","title":"Compression as a universal principle of animal behavior","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1111/cogs.12061","volume":"37"},
  {"id":"ferrer-i-cancho_etal14","abstract":"Menzerath’s law, the tendency of Z (the mean size of the parts) to decrease as X (the number of parts) increases, is found in language, music and genomes. Recently, it has been argued that the presence of the law in genomes is an inevitable consequence of the fact that Z = Y/X, which would imply that Z scales with X as Z∼1/X. That scaling is a very particular case of Menzerath-Altmann law that has been rejected by means of a correlation test between X and Y in genomes, being X the number of chromosomes of a species, Y its genome size in bases and Z the mean chromosome size. Here we review the statistical foundations of that test and consider three non-parametric tests based upon different correlation metrics and one parametric test to evaluate if Z∼1/X in genomes. The most powerful test is a new non-parametric one based upon the correlation ratio, which is able to reject Z∼1/X in nine out of 11 taxonomic groups and detect a borderline group. Rather than a fact, Z∼1/X is a baseline that real genomes do not meet. The view of Menzerath-Altmann law as inevitable is seriously flawed.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Hernández-Fernández","given":"Antoni"},{"family":"Baixeries","given":"Jaume"},{"family":"Dębowski","given":"Łukasz"},{"family":"Mačutek","given":"Ján"}],"citation-key":"ferrer-i-cancho_etal14","container-title":"Statistical Applications in Genetics and Molecular Biology","DOI":"10.1515/sagmb-2013-0034","ISSN":"1544-6115, 2194-6302","issue":"6","issued":{"date-parts":[["2014",1,1]]},"language":"en","source":"DOI.org (Crossref)","title":"When is Menzerath-Altmann law mathematically trivial? a new approach","title-short":"When is Menzerath-Altmann law mathematically trivial?","type":"article-journal","URL":"https://www.degruyter.com/document/doi/10.1515/sagmb-2013-0034/html","volume":"13"},
  {"id":"ferrer-i-cancho_etal22","abstract":"The problem of compression in standard information theory consists of assign­ ing codes as short as possible to numbers. Here we consider the problem of optimal coding – under an arbitrary coding scheme – and show that it predicts Zipf’s law of abbreviation, namely a tendency in natural languages for more frequent words to be shorter. We apply this result to investigate optimal coding also under so-called non-singular coding, a scheme where unique segmenta­ tion is not warranted but codes stand for a distinct number. Optimal nonsingular coding predicts that the length of a word should grow approximately as the logarithm of its frequency rank, which is again consistent with Zipf’s law of abbreviation. Optimal non-singular coding in combination with the max­ imum entropy principle also predicts Zipf’s rank-frequency distribution. Furthermore, our findings on optimal non-singular coding challenge common beliefs about random typing. It turns out that random typing is in fact an optimal coding process, in stark contrast with the common assumption that it is detached from cost cutting considerations. Finally, we discuss the implica­ tions of optimal coding for the construction of a compact theory of Zipfian laws more generally as well as other linguistic laws.","accessed":{"date-parts":[["2023",9,21]]},"author":[{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Bentz","given":"Christian"},{"family":"Seguin","given":"Caio"}],"citation-key":"ferrer-i-cancho_etal22","container-title":"Journal of Quantitative Linguistics","container-title-short":"Journal of Quantitative Linguistics","DOI":"10.1080/09296174.2020.1778387","ISSN":"0929-6174, 1744-5035","issue":"2","issued":{"date-parts":[["2022",4,3]]},"language":"en","page":"165-194","source":"DOI.org (Crossref)","title":"Optimal coding and the origins of Zipfian laws","type":"article-journal","URL":"https://www.tandfonline.com/doi/full/10.1080/09296174.2020.1778387","volume":"29"},
  {"id":"ferrer-i-cancho16","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Ferrer-i-Cancho","given":"Ramon"}],"citation-key":"ferrer-i-cancho16","container-title":"Complexity","container-title-short":"Complexity","DOI":"10.1002/cplx.21820","ISSN":"10762787","issue":"S2","issued":{"date-parts":[["2016",11]]},"language":"en","page":"409-411","source":"DOI.org (Crossref)","title":"Compression and the origins of Zipf's law for word frequencies","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1002/cplx.21820","volume":"21"},
  {"id":"ficken_etal94","abstract":"Chick-a-deceallsof theMexicanChickade(eParusclateria)recomposedof combinationosf threecommonnotetypes(A,C andD) andoneveryraretype(B).Calls havetheinvarianstequencoefnotesA-B-C-Dw, hereanynotetypemaybeomittedg, iven onceorrepeateda variablenumberof timesbeforetransitintgo thenexttype.TheB and C notesarephonologicallsyimilarto theB andC notesof chick-a-deceallsof theBlackcappedChickade(eP. atricapillusb),uttheA noteis markedlydifferenatndthe D note somewhadt ifferenftromequivalenntotesof thecongenerA. totalof 2,071callsrecorded yielded60differenctalltypesa, ndZipf-Mandelbrpolot tsshowthatthecallsystemis\"open\"; as thesamplesizeis increasednewcalltypeswillbefoundwithoutdemonstrabbleound. Inrelativelyundisturbecdontexts(withmateonterritoryin, fallflocksa, lonein fall)birds gavemainly[A][D]callswithlessernumberosf [A]and[C]calls,wherebracketisndicate variablreepetitionofnotetypes.Indisturbecdontexts(mobbinpglasticGreatHornedOwl, mobbingspeakepr layingcallsof theNorthernPygmy-Owol,bserversittingunderthenest cavity)thebirdsgavemore[C]callswith[A][Ca] swell.Inthelongestmobbingsessionto owlcalls,birdsgavemainly[A]callswhenapproachinsgw, itchedto [C]callswhileflying abouthespeakera,ndthenresumed[A]callsandmovedoffwhentheplaybacwk asstopped. Outsideof humanlanguaget,hisis thesecondtrulycombinatoriasyl stemof vocalcommunicatiofnoundinanimalst,hefirstbeingchick-a-deceallsoftheBlack-cappeCdhickadee. Thisstudyprovidetshefirstdatasubstantiatinqguantitativdeifferenceinscallsfromdifferent contextsa, nimportanstteptowardunderstandinwghatkindsof informatiocnombinatorial chick-a-deceallsencode.","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Ficken","given":"Millicent Sigler"},{"family":"Hailman","given":"Elizabeth D."},{"family":"Hailman","given":"Jack P."}],"citation-key":"ficken_etal94","container-title":"The Condor","container-title-short":"The Condor","DOI":"10.2307/1369065","ISSN":"00105422, 1938-5129","issue":"1","issued":{"date-parts":[["1994",2]]},"language":"en","page":"70-82","source":"DOI.org (Crossref)","title":"The chick-a-dee call system of the Mexican chickadee","type":"article-journal","URL":"https://academic.oup.com/condor/article/96/1/70-82/5124075","volume":"96"},
  {"id":"fitch00","accessed":{"date-parts":[["2023",8,30]]},"author":[{"family":"Fitch","given":"W.Tecumseh"}],"citation-key":"fitch00","container-title":"Trends in Cognitive Sciences","container-title-short":"Trends in Cognitive Sciences","DOI":"10.1016/S1364-6613(00)01494-7","ISSN":"13646613","issue":"7","issued":{"date-parts":[["2000",7]]},"language":"en","page":"258-267","source":"DOI.org (Crossref)","title":"The evolution of speech: a comparative review","title-short":"The evolution of speech","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1364661300014947","volume":"4"},
  {"id":"fitch06","abstract":"Studies of the biology of music (as of language) are highly interdisciplinary and demand the integration of diverse strands of evidence. In this paper, I present a comparative perspective on the biology and evolution of music, stressing the value of comparisons both with human language, and with those animal communication systems traditionally termed \"song\". A comparison of the \"design features\" of music with those of language reveals substantial overlap, along with some important differences. Most of these differences appear to stem from semantic, rather than structural, factors, suggesting a shared formal core of music and language. I next review various animal communication systems that appear related to human music, either by analogy (bird and whale \"song\") or potential homology (great ape bimanual drumming). A crucial comparative distinction is between learned, complex signals (like language, music and birdsong) and unlearned signals (like laughter, ape calls, or bird calls). While human vocalizations clearly build upon an acoustic and emotional foundation shared with other primates and mammals, vocal learning has evolved independently in our species since our divergence with chimpanzees. The convergent evolution of vocal learning in other species offers a powerful window into psychological and neural constraints influencing the evolution of complex signaling systems (including both song and speech), while ape drumming presents a fascinating potential homology with human instrumental music. I next discuss the archeological data relevant to music evolution, concluding on the basis of prehistoric bone flutes that instrumental music is at least 40,000 years old, and perhaps much older. I end with a brief review of adaptive functions proposed for music, concluding that no one selective force (e.g., sexual selection) is adequate to explaining all aspects of human music. I suggest that questions about the past function of music are unlikely to be answered definitively and are thus a poor choice as a research focus for biomusicology. In contrast, a comparative approach to music promises rich dividends for our future understanding of the biology and evolution of music. © 2005 Elsevier B.V. All rights reserved.","author":[{"family":"Fitch","given":"W. Tecumseh"}],"citation-key":"fitch06","container-title":"Cognition","DOI":"10.1016/j.cognition.2005.11.009","ISSN":"00100277","issue":"1","issued":{"date-parts":[["2006"]]},"page":"173-215","PMID":"16412411","title":"The biology and evolution of music: A comparative perspective","type":"article-journal","volume":"100"},
  {"id":"frank_etal12","abstract":"It is generally assumed that hierarchical phrase structure plays a central role in human language. However, considerations of simplicity and evolutionary continuity suggest that hierarchical structure should not be invoked too hastily. Indeed, recent neurophysiological, behavioural and computational studies show that sequential sentence structure has considerable explanatory power and that hierarchical processing is often not involved. In this paper, we review evidence from the recent literature supporting the hypothesis that sequential structure may be fundamental to the comprehension, production and acquisition of human language. Moreover, we provide a preliminary sketch outlining a non-hierarchical model of language use and discuss its implications and testable predictions. If linguistic phenomena can be explained by sequential rather than hierarchical structure, this will have considerable impact in a wide range of fields, such as linguistics, ethology, cognitive neuroscience, psychology and computer science.","accessed":{"date-parts":[["2023",8,10]]},"author":[{"family":"Frank","given":"Stefan L."},{"family":"Bod","given":"Rens"},{"family":"Christiansen","given":"Morten H."}],"citation-key":"frank_etal12","container-title":"Proceedings of the Royal Society B: Biological Sciences","container-title-short":"Proc. R. Soc. B.","DOI":"10.1098/rspb.2012.1741","ISSN":"0962-8452, 1471-2954","issue":"1747","issued":{"date-parts":[["2012",11,22]]},"language":"en","page":"4522-4531","source":"DOI.org (Crossref)","title":"How hierarchical is language use?","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rspb.2012.1741","volume":"279"},
  {"id":"freeberg_lucas12","abstract":"One aim of this study was to apply information theoretical analyses to understanding the structural complexity of chick-a-dee calls of Carolina chickadees, Poecile carolinensis. A second aim of this study was to compare this structural complexity to that of the calls of black-capped chickadees, P. atricapillus, described in an earlier published report (Hailman, Ficken, & Ficken, 1985). Chick-a-dee calls were recorded from Carolina chickadees in a naturalistic observation study in eastern Tennessee. Calls were analyzed using approaches from information theory, including transition probability matrices, Zipf’s rules, entropies, and information coding capacities of calls and notes of calls. As described for black-capped chickadees, calls of Carolina chickadees exhibited considerable structural complexity. Most results suggested that the call of Carolina chickadees is more structurally complex than that of black-capped chickadees. These findings add support to the growing literature on the complexity of this call system in Paridae species. Furthermore, these results point to the feasibility of detailed cross-species comparative analyses that may allow strong testing of hypotheses regarding signal evolution.","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Freeberg","given":"Todd M."},{"family":"Lucas","given":"Jeffrey R."}],"citation-key":"freeberg_lucas12","container-title":"Journal of Comparative Psychology","container-title-short":"Journal of Comparative Psychology","DOI":"10.1037/a0024906","ISSN":"1939-2087, 0735-7036","issue":"1","issued":{"date-parts":[["2012"]]},"language":"en","page":"68-81","source":"DOI.org (Crossref)","title":"Information theoretical approaches to chick-a-dee calls of Carolina chickadees (Poecile carolinensis)","type":"article-journal","URL":"http://doi.apa.org/getdoi.cfm?doi=10.1037/a0024906","volume":"126"},
  {"id":"g_torre_etal21","abstract":"Menzerath’s law is a quantitative linguistic law which states that, on average, the longer is a linguistic construct, the shorter are its constituents. In contrast, Menzerath-Altmann’s law (MAL) is a precise mathematical power-law-exponential formula which expresses the expected length of the linguistic construct conditioned on the number of its constituents. In this paper, we investigate the anatomy of MAL for constructs being word tokens and constituents being syllables, measuring its length in graphemes. First, we derive the exact form of MAL for texts generated by the memoryless source with three emitted symbols, which can be interpreted as a monkey typing model or a null model. We show that this null model complies with Menzerath’s law, revealing that Menzerath’s law itself can hardly be a criterion of complexity in communication. This observation does not apply to the more precise Menzerath-Altmann’s law, which predicts an inverted regime for sufficiently range constructs, i.e., the longer is a word, the longer are its syllables. To support this claim, we analyze MAL on data from 21 languages, consisting of texts from the Standardized Project Gutenberg. We show the presence of the inverted regime, not exhibited by the null model, and we demonstrate robustness of our results. We also report the complicated distribution of syllable sizes with respect to their position in the word, which might be related with the emerging MAL. Altogether, our results indicate that Menzerath’s law—in terms of correlations—is a spurious observation, while complex patterns and efficiency dynamics should be rather attributed to specific forms of Menzerath-Altmann’s law.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"G. Torre","given":"Iván"},{"family":"Dębowski","given":"Łukasz"},{"family":"Hernández-Fernández","given":"Antoni"}],"citation-key":"g_torre_etal21","container-title":"PLOS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0256133","editor":[{"family":"Amancio","given":"Diego Raphael"}],"ISSN":"1932-6203","issue":"8","issued":{"date-parts":[["2021",8,20]]},"language":"en","page":"e0256133","source":"DOI.org (Crossref)","title":"Can Menzerath’s law be a criterion of complexity in communication?","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0256133","volume":"16"},
  {"id":"garamszegi_etal05","abstract":"Repertoire size, the number of unique song or syllable types in the repertoire, is a widely used measure of song complexity in birds, but it is difficult to calculate this exactly in species with large repertoires. A new method of repertoire size estimation applies species richness estimation procedures from community ecology, but such capture-recapture approaches have not been much tested. Here, we establish standardized sampling schemes and estimation procedures using capture-recapture models for syllable repertoires from 18 bird species, and suggest how these may be used to tackle problems of repertoire estimation. Different models, with different assumptions regarding the heterogeneity of the use of syllable types, performed best for different species with different song organizations. For most species, models assuming heterogeneous probability of occurrence of syllables (so-called detection probability) were selected due to the presence of both rare and frequent syllables. Capture-recapture estimates of syllable repertoire size from our small sample did not differ significantly from previous estimates using larger samples of count data. However, the enumeration of syllables in 15 songs yielded significantly lower estimates than previous reports. Hence, heterogeneity in detection probability of syllables should be addressed when estimating repertoire size. This is neglected using simple enumeration procedures, but is taken into account when repertoire size is estimated by appropriate capture-recapture models adjusted for species-specific song organization characteristics. We suggest that such approaches, in combination with standardized sampling, should be applied in species with potentially large repertoire size. On the other hand, in species with small repertoire size and homogenous syllable usage, enumerations may be satisfactory. Although researchers often use repertoire size as a measure of song complexity, listeners to songs are unlikely to count entire repertoires and they may rely on other cues, such as syllable detection probability.","accessed":{"date-parts":[["2023",8,25]]},"author":[{"family":"Garamszegi","given":"L. Z."},{"family":"Balsby","given":"Thorsten J. S."},{"family":"Bell","given":"Ben D."},{"family":"Borowiec","given":"Marta"},{"family":"Byers","given":"Bruce E."},{"family":"Draganoiu","given":"Tudor"},{"family":"Eens","given":"Marcel"},{"family":"Forstmeier","given":"Wolfgang"},{"family":"Galeotti","given":"Paolo"},{"family":"Gil","given":"Diego"},{"family":"Gorissen","given":"Leen"},{"family":"Hansen","given":"Poul"},{"family":"Lampe","given":"Helene M."},{"family":"Leitner","given":"Stefan"},{"family":"Lontkowski","given":"Jan"},{"family":"Nagle","given":"Laurent"},{"family":"Nemeth","given":"Erwin"},{"family":"Pinxten","given":"Rianne"},{"family":"Rossi","given":"Jean-Marc"},{"family":"Saino","given":"Nicola"},{"family":"Tanvez","given":"A"},{"family":"Titus","given":"Russell"},{"family":"Török","given":"J"},{"family":"Van Duyse","given":"Els"},{"family":"Møller","given":"Anders P."}],"citation-key":"garamszegi_etal05","container-title":"Behavioral Ecology and Sociobiology","container-title-short":"Behav Ecol Sociobiol","DOI":"10.1007/s00265-004-0866-6","ISSN":"0340-5443, 1432-0762","issue":"4","issued":{"date-parts":[["2005",2]]},"language":"en","page":"305-317","source":"DOI.org (Crossref)","title":"Estimating the complexity of bird song by using capture-recapture approaches from community ecology","type":"article-journal","URL":"http://link.springer.com/10.1007/s00265-004-0866-6","volume":"57"},
  {"id":"garland_etal22","abstract":"Culture presents a second inheritance system by which innovations can be transmitted between generations and among individuals. Some vocal behaviours present compelling examples of cultural evolution. Where modifications accumulate over time, such a process can become cumulative cultural evolution. The existence of cumulative cultural evolution in non-human animals is controversial. When physical products of such a process do not exist, modifications may not be clearly visible over time. Here, we investigate whether the constantly evolving songs of humpback whales (\n              Megaptera novaeangliae\n              ) are indicative of cumulative cultural evolution. Using nine years of song data recorded from the New Caledonian humpback whale population, we quantified song evolution and complexity, and formally evaluated this process in light of criteria for cumulative cultural evolution. Song accumulates changes shown by an increase in complexity, but this process is punctuated by rapid loss of song material. While such changes tentatively satisfy the core criteria for cumulative cultural evolution, this claim hinges on the assumption that novel songs are preferred by females. While parsimonious, until such time as studies can link fitness benefits (reproductive success) to individual singers, any claims that humpback whale song evolution represents a form of cumulative cultural evolution may remain open to interpretation.\n            \n            This article is part of a discussion meeting issue ‘The emergence of collective knowledge and cumulative culture in animals, humans and machines’.","accessed":{"date-parts":[["2023",8,21]]},"author":[{"family":"Garland","given":"Ellen C."},{"family":"Garrigue","given":"Claire"},{"family":"Noad","given":"Michael J."}],"citation-key":"garland_etal22","container-title":"Philosophical Transactions of the Royal Society B: Biological Sciences","container-title-short":"Phil. Trans. R. Soc. B","DOI":"10.1098/rstb.2020.0313","ISSN":"0962-8436, 1471-2970","issue":"1843","issued":{"date-parts":[["2022",1,31]]},"language":"en","page":"20200313","source":"DOI.org (Crossref)","title":"When does cultural evolution become cumulative culture? A case study of humpback whale song","title-short":"When does cultural evolution become cumulative culture?","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rstb.2020.0313","volume":"377"},
  {"id":"geller_lahti23","author":[{"family":"Geller","given":"Frances C."},{"family":"Lahti","given":"David C."}],"citation-key":"geller_lahti23","container-title":"Animal Behaviour","DOI":"10.1016/j.anbehav.2023.09.006","issued":{"date-parts":[["2023"]]},"page":"131-137","title":"Is sexiness cumulative? Arguments from birdsong culture","type":"article-journal","volume":"205"},
  {"id":"gelman_etal14","author":[{"family":"Gelman","given":"Andrew"},{"family":"Carlin","given":"John B."},{"family":"Stern","given":"Hal S."},{"family":"Dunson","given":"David B."},{"family":"Vehtari","given":"Aki"},{"family":"Rubin","given":"Donald B."}],"citation-key":"gelman_etal14","collection-title":"Texts in Statistical Science","edition":"3","event-place":"Boca Raton","ISBN":"978-1-4398-9820-8","issued":{"date-parts":[["2014"]]},"publisher":"CRC Press","publisher-place":"Boca Raton","title":"Bayesian Data Analysis","type":"book"},
  {"id":"gelman_etal19","accessed":{"date-parts":[["2023",8,15]]},"author":[{"family":"Gelman","given":"Andrew"},{"family":"Goodrich","given":"Ben"},{"family":"Gabry","given":"Jonah"},{"family":"Vehtari","given":"Aki"}],"citation-key":"gelman_etal19","container-title":"The American Statistician","container-title-short":"The American Statistician","DOI":"10.1080/00031305.2018.1549100","ISSN":"0003-1305, 1537-2731","issue":"3","issued":{"date-parts":[["2019",7,3]]},"language":"en","page":"307-309","source":"DOI.org (Crossref)","title":"R-squared for Bayesian regression models","type":"article-journal","URL":"https://www.tandfonline.com/doi/full/10.1080/00031305.2018.1549100","volume":"73"},
  {"id":"genty_byrne10","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Genty","given":"Emilie"},{"family":"Byrne","given":"Richard W."}],"citation-key":"genty_byrne10","container-title":"Animal Cognition","container-title-short":"Anim Cogn","DOI":"10.1007/s10071-009-0266-4","ISSN":"1435-9448, 1435-9456","issue":"2","issued":{"date-parts":[["2010",3]]},"language":"en","page":"287-301","source":"DOI.org (Crossref)","title":"Why do gorillas make sequences of gestures?","type":"article-journal","URL":"http://link.springer.com/10.1007/s10071-009-0266-4","volume":"13"},
  {"id":"gervain_geffen19","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Gervain","given":"Judit"},{"family":"Geffen","given":"Maria N."}],"citation-key":"gervain_geffen19","container-title":"Trends in Neurosciences","container-title-short":"Trends in Neurosciences","DOI":"10.1016/j.tins.2018.09.004","ISSN":"01662236","issue":"1","issued":{"date-parts":[["2019",1]]},"language":"en","page":"56-65","source":"DOI.org (Crossref)","title":"Efficient neural coding in auditory and speech perception","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0166223618302467","volume":"42"},
  {"id":"gibson_etal19","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Gibson","given":"Edward"},{"family":"Futrell","given":"Richard"},{"family":"Piantadosi","given":"Steven P."},{"family":"Dautriche","given":"Isabelle"},{"family":"Mahowald","given":"Kyle"},{"family":"Bergen","given":"Leon"},{"family":"Levy","given":"Roger"}],"citation-key":"gibson_etal19","container-title":"Trends in Cognitive Sciences","container-title-short":"Trends in Cognitive Sciences","DOI":"10.1016/j.tics.2019.02.003","ISSN":"13646613","issue":"5","issued":{"date-parts":[["2019",5]]},"language":"en","page":"389-407","source":"DOI.org (Crossref)","title":"How efficiency shapes human language","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1364661319300580","volume":"23"},
  {"id":"gilman_etal23","abstract":"Zipf’s law of abbreviation predicts that in human languages, words that are used more frequently will be shorter than words that are used less frequently. This has been attributed to the principle of least effort – communication is more efficient when words that are used more frequently are easier to produce. Zipf’s law of abbreviation appears to hold for all human languages, and recently attention has turned to whether it also holds for animal communication. In birdsong, which has been used as a model for human language learning and development, researchers have focused on whether more frequently used notes or phrases are shorter than those that are less frequently used. Because birdsong can be highly stereotyped, have high interindividual variation, and have phrase repertoires that are small relative to human language lexicons, studying Zipf’s law of abbreviation in birdsong presents challenges that do not arise when studying human languages. In this paper, we describe a new method for assessing evidence for Zipf’s law of abbreviation in birdsong, and we introduce the R package ZLAvian to implement this analysis. We used ZLAvian to study Zipf’s law of abbreviation in the songs of 11 bird populations archived in the open-access repository Bird-DB. We did not find strong evidence for Zipf’s law of abbreviation in any population when studied alone, but we found weak trends consistent with Zipf’s law of abbreviation in 10 of the 11 populations. Across all populations, the negative correlation between phrase length and frequency of use was several times weaker than the negative correlation between word length and frequency of use in human languages. This suggests that the mechanisms that underlie this correlation may be different in birdsong and human language.","accessed":{"date-parts":[["2024",1,25]]},"author":[{"family":"Gilman","given":"R. Tucker"},{"family":"Durrant","given":"Cd"},{"family":"Malpas","given":"Lucy"},{"family":"Lewis","given":"Rebecca N."}],"citation-key":"gilman_etal23","DOI":"10.1101/2023.12.06.569773","genre":"preprint","issued":{"date-parts":[["2023",12,6]]},"language":"en","publisher":"Animal Behavior and Cognition","source":"DOI.org (Crossref)","title":"Does Zipf’s law of abbreviation shape birdsong?","type":"report","URL":"http://biorxiv.org/lookup/doi/10.1101/2023.12.06.569773"},
  {"id":"giraudeau_etal14","abstract":"Introduction: Urbanization can considerably impact animal ecology, evolution, and behavior. Among the new conditions that animals experience in cities is anthropogenic noise, which can limit the sound space available for animals to communicate using acoustic signals. Some urban bird species increase their song frequencies so that they can be heard above low-frequency background city noise. However, the ability to make such song modifications may be constrained by several morphological factors, including bill gape, size, and shape, thereby limiting the degree to which certain species can vocally adapt to urban settings. We examined the relationship between song characteristics and bill morphology in a species (the house finch, Haemorhous mexicanus) where both vocal performance and bill size are known to differ between city and rural animals.\nResults: We found that bills were longer and narrower in more disturbed, urban areas. We observed an increase in minimum song frequency of urban birds, and we also found that the upper frequency limit of songs decreased in direct relation to bill morphology.\nConclusions: These findings are consistent with the hypothesis that birds with longer beaks and therefore longer vocal tracts sing songs with lower maximum frequencies because longer tubes have lower-frequency resonances. Thus, for the first time, we reveal dual constraints (one biotic, one abiotic) on the song frequency range of urban animals. Urban foraging pressures may additionally interact with the acoustic environment to shape bill traits and vocal performance.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Giraudeau","given":"Mathieu"},{"family":"Nolan","given":"Paul M"},{"family":"Black","given":"Caitlin E"},{"family":"Earl","given":"Stevan R"},{"family":"Hasegawa","given":"Masaru"},{"family":"McGraw","given":"Kevin J"}],"citation-key":"giraudeau_etal14","container-title":"Frontiers in Zoology","container-title-short":"Front Zool","DOI":"10.1186/s12983-014-0083-8","ISSN":"1742-9994","issue":"1","issued":{"date-parts":[["2014",12]]},"language":"en","page":"83","source":"DOI.org (Crossref)","title":"Song characteristics track bill morphology along a gradient of urbanization in house finches (Haemorhous mexicanus)","type":"article-journal","URL":"http://frontiersinzoology.biomedcentral.com/articles/10.1186/s12983-014-0083-8","volume":"11"},
  {"id":"grassberger08","abstract":"We present a detailed derivation of some estimators of Shannon entropy for discrete distributions. They hold for finite samples of N points distributed into M \"boxes\", with N and M -> oo, but N/M < oo. In the high sampling regime (<< 1 points in each box) they have exponentially small biases. In the low sampling regime the errors increase but are still much smaller than for most other estimators. One advantage is that our main estimators are given analytically, with explicitly known analytical formulas for the biases.","accessed":{"date-parts":[["2023",8,10]]},"author":[{"family":"Grassberger","given":"Peter"}],"citation-key":"grassberger08","DOI":"10.48550/arXiv.physics/0307138","issued":{"date-parts":[["2008"]]},"language":"en","number":"arXiv:physics/0307138","publisher":"arXiv","source":"arXiv.org","title":"Entropy estimates from insufficient samplings","type":"article","URL":"http://arxiv.org/abs/physics/0307138"},
  {"id":"grassberger22","abstract":"We present a new class of estimators of Shannon entropy for severely undersampled discrete distributions. It is based on a generalization of an estimator proposed by T. Schürmann, which itself is a generalization of an estimator proposed by myself.For a special set of parameters, they are completely free of bias and have a ﬁnite variance, something which is widely believed to be impossible. We present also detailed numerical tests, where we compare them with other recent estimators and with exact results, and point out a clash with Bayesian estimators for mutual information.","accessed":{"date-parts":[["2023",8,15]]},"author":[{"family":"Grassberger","given":"Peter"}],"citation-key":"grassberger22","container-title":"Entropy","container-title-short":"Entropy","DOI":"10.3390/e24050680","ISSN":"1099-4300","issue":"5","issued":{"date-parts":[["2022",5,11]]},"language":"en","page":"680","source":"DOI.org (Crossref)","title":"On generalized Schürmann entropy estimators","type":"article-journal","URL":"https://www.mdpi.com/1099-4300/24/5/680","volume":"24"},
  {"id":"gruber_etal22","abstract":"Recent studies in several taxa have demonstrated that animal culture can evolve to become more efficient in various contexts ranging from tool use to route learning and migration. Under recent definitions, such increases in efficiency might satisfy the core criteria of cumulative cultural evolution (CCE). However, there is not yet a satisfying consensus on the precise definition of efficiency, CCE or the link between efficiency and more complex, extended forms of CCE considered uniquely human. To bring clarity to this wider discussion of CCE, we develop the concept of efficiency by (i) reviewing recent potential evidence for CCE in animals, and (ii) clarifying a useful definition of efficiency by synthesizing perspectives found within the literature, including animal studies and the wider iterated learning literature. Finally, (iii) we discuss what factors might impinge on the informational bottleneck of social transmission, and argue that this provides pressure for learnable behaviours across species. We conclude that framing CCE in terms of efficiency casts complexity in a new light, as learnable behaviours are a requirement for the evolution of complexity. Understanding how efficiency greases the ratchet of cumulative culture provides a better appreciation of how similar cultural evolution can be between taxonomically diverse species—a case for continuity across the animal kingdom.\n            This article is part of a discussion meeting issue ‘The emergence of collective knowledge and cumulative culture in animals, humans and machines’.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Gruber","given":"T."},{"family":"Chimento","given":"M."},{"family":"Aplin","given":"L. M."},{"family":"Biro","given":"D."}],"citation-key":"gruber_etal22","container-title":"Philosophical Transactions of the Royal Society B: Biological Sciences","container-title-short":"Phil. Trans. R. Soc. B","DOI":"10.1098/rstb.2020.0308","ISSN":"0962-8436, 1471-2970","issue":"1843","issued":{"date-parts":[["2022",1,31]]},"language":"en","page":"20200308","source":"DOI.org (Crossref)","title":"Efficiency fosters cumulative culture across species","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rstb.2020.0308","volume":"377"},
  {"id":"gustisonGeladaVocalSequences2016","abstract":"Significance\n            \n              Human language follows a variety of structural principles, known as linguistic laws. One of these, Menzerath’s law, states that, the larger the size of the construct (e.g., the size of a word in terms of syllable number), the smaller the size of the individual constituent parts (e.g., syllables). We show for the first time (to our knowledge) that Menzerath’s law also holds in the vocal communication of a nonhuman species. In the gelada (\n              Theropithecus gelada\n              ), a primate living in the highlands of Ethiopia, longer vocal sequences produced by adult males were associated with shorter individual calls. This result suggests that general—perhaps universal—principles underpin the structure of vocal communication in our own species and others.\n            \n          , \n            \n              Identifying universal principles underpinning diverse natural systems is a key goal of the life sciences. A powerful approach in addressing this goal has been to test whether patterns consistent with linguistic laws are found in nonhuman animals. Menzerath’s law is a linguistic law that states that, the larger the construct, the smaller the size of its constituents. Here, to our knowledge, we present the first evidence that Menzerath’s law holds in the vocal communication of a nonhuman species. We show that, in vocal sequences of wild male geladas (\n              Theropithecus gelada\n              ), construct size (sequence size in number of calls) is negatively correlated with constituent size (duration of calls). Call duration does not vary significantly with position in the sequence, but call sequence composition does change with sequence size and most call types are abbreviated in larger sequences. We also find that intercall intervals follow the same relationship with sequence size as do calls. Finally, we provide formal mathematical support for the idea that Menzerath’s law reflects compression—the principle of minimizing the expected length of a code. Our findings suggest that a common principle underpins human and gelada vocal communication, highlighting the value of exploring the applicability of linguistic laws in vocal systems outside the realm of language.","accessed":{"date-parts":[["2023",5,29]]},"author":[{"family":"Gustison","given":"Morgan L."},{"family":"Semple","given":"Stuart"},{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Bergman","given":"Thore J."}],"citation-key":"gustisonGeladaVocalSequences2016","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.1522072113","ISSN":"0027-8424, 1091-6490","issue":"19","issued":{"date-parts":[["2016",5,10]]},"language":"en","source":"DOI.org (Crossref)","title":"Gelada vocal sequences follow Menzerath’s linguistic law","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.1522072113","volume":"113"},
  {"id":"hahn_etal20","abstract":"The universal properties of human languages have been the subject of intense study across the language sciences. We report computational and corpus evidence for the hypothesis that a prominent subset of these universal properties—those related to word order—result from a process of optimization for efficient communication among humans, trading off the need to reduce complexity with the need to reduce ambiguity. We formalize these two pressures with information-theoretic and neural-network models of complexity and ambiguity and simulate grammars with optimized word-order parameters on large-scale data from 51 languages. Evolution of grammars toward efficiency results in word-order patterns that predict a large subset of the major word-order correlations across languages.","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Hahn","given":"Michael"},{"family":"Jurafsky","given":"Dan"},{"family":"Futrell","given":"Richard"}],"citation-key":"hahn_etal20","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.1910923117","ISSN":"0027-8424, 1091-6490","issue":"5","issued":{"date-parts":[["2020",2,4]]},"language":"en","page":"2347-2353","source":"DOI.org (Crossref)","title":"Universals of word order reflect optimization of grammars for efficient communication","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.1910923117","volume":"117"},
  {"id":"hailman_etal85","accessed":{"date-parts":[["2023",8,3]]},"author":[{"family":"Hailman","given":"Jack P."},{"family":"Ficken","given":"Millicent S."},{"family":"Ficken","given":"Robert W."}],"citation-key":"hailman_etal85","container-title":"Semiotica","DOI":"10.1515/semi.1985.56.3-4.191","ISSN":"0037-1998, 1613-3692","issue":"3-4","issued":{"date-parts":[["1985"]]},"language":"en","source":"DOI.org (Crossref)","title":"The ‘chick-a-dee’ calls of Parus atricapillus: a recombinant system of animal communication compared with written English","title-short":"The ‘chick-a-dee’ calls of Parus atricapillus","type":"article-journal","URL":"https://www.degruyter.com/document/doi/10.1515/semi.1985.56.3-4.191/html","volume":"56"},
  {"id":"hailman94","abstract":"Combinatorial calls of tits (Parus) resemble language in allowing the production of a huge variety of distinct call types based on combinations of a few note types. This study found a constrained type of permuted order of note types, which enlarges the potential for call variety and even more closely resembles properties of language. Vocalizations of the black-lored tit P. xanthogenys of India have never been studied in the wild and were known previously only through brief mention in two comparative reviews (Thielcke 1968, Hailman 1989). A wild-caught captive gave chick-a-dee-like calls in response to a stuffed owl. The tit used combinations of four note types (denoted A through D) to create 65 different call types. Zipf-Mandelbrot analysis showed that the repertoire of call types has the language-like property of \"openness\": as more calls are sampled, the number of call types represented in the sample continues to rise without bound. First-order Markov-chain analysis revealed that B, C and D notes tend to be isolated from one another, with A notes given between them, within strings of the same note-type, and at the beginning and ending of calls. This constrained permutation is missing from the merely combinatorial chick-a-dee calls of the black-capped chickadee P. atricapillus, where note-types occur in fixed order both within and among calls. Calling under constant stimulus conditions changed unidirectionally during the course of mobbing, with D notes first replacing B notes in calls and then also replacing C notes as time progressed. The evolution of note types and call structure is discussed in comparison with the black-capped chickadee.","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Hailman","given":"Jack P."}],"citation-key":"hailman94","container-title":"Bioacoustics","container-title-short":"Bioacoustics","DOI":"10.1080/09524622.1994.9753270","ISSN":"0952-4622, 2165-0586","issue":"1","issued":{"date-parts":[["1994",1]]},"language":"en","page":"33-50","source":"DOI.org (Crossref)","title":"Constrained permutation in \"chick-a-dee\"-like calls of a black-lored tit Parus xanthogenys","type":"article-journal","URL":"http://www.tandfonline.com/doi/abs/10.1080/09524622.1994.9753270","volume":"6"},
  {"id":"hedleyCompositionSequentialOrganization2016","abstract":"The rules governing bird song sequences vary considerably across the avian phylogeny, and modiﬁcations to these rules represent one of the many ways in which bird song varies interspeciﬁcally. Cassin’s Vireo (Vireo cassinii) is one species that shows a highly structured syntax, with clearly non-random patterns of sequential organization in their songs. Here I present a description of Cassin’s Vireo song sequences from the Sierra Nevada Mountains in California and employ network analysis to quantify transition patterns within the songs. Repertoire sizes varied between 44 and 60 phrase types per bird for the 13 birds analyzed here. The repertoire was subdivided into ‘themes’ containing between two and seven phrase types. The birds sang the phrase types in a given theme for a time before eventually introducing a new theme; in this manner the repertoire was revealed relatively slowly over time. Theme composition within a bird’s repertoire did not change within or between singing bouts throughout the season. The tendency to sing in themes was corroborated by network analysis, which revealed small-world structure in the songs. Phrase types were widely shared within the population. I discuss these ﬁndings as they compare with the singing styles of other species, both closely and distantly related.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Hedley","given":"Richard W."}],"citation-key":"hedleyCompositionSequentialOrganization2016","container-title":"Journal of Ornithology","container-title-short":"J Ornithol","DOI":"10.1007/s10336-015-1238-x","ISSN":"2193-7192, 2193-7206","issue":"1","issued":{"date-parts":[["2016",1]]},"language":"en","page":"13-22","source":"DOI.org (Crossref)","title":"Composition and sequential organization of song repertoires in Cassin’s Vireo (Vireo cassinii)","type":"article-journal","URL":"http://link.springer.com/10.1007/s10336-015-1238-x","volume":"157"},
  {"id":"heesen_etal19","author":[{"family":"Heesen","given":"Raphaela"},{"family":"Hobaiter","given":"Catherine"},{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Semple","given":"Stuart"}],"citation-key":"heesen_etal19","container-title":"Proceedings of the Royal Society B: Biological Sciences","DOI":"10.1098/rspb.2018.2900","issued":{"date-parts":[["2019"]]},"language":"en","page":"20182900","source":"Zotero","title":"Linguistic laws in chimpanzee gestural communication","type":"article-journal","volume":"286"},
  {"id":"huang_etal20","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Huang","given":"Mingpan"},{"family":"Ma","given":"Haigang"},{"family":"Ma","given":"Changyong"},{"family":"Garber","given":"Paul A."},{"family":"Fan","given":"Pengfei"}],"citation-key":"huang_etal20","container-title":"Animal Behaviour","container-title-short":"Animal Behaviour","DOI":"10.1016/j.anbehav.2019.11.017","ISSN":"00033472","issued":{"date-parts":[["2020",2]]},"language":"en","page":"145-155","source":"DOI.org (Crossref)","title":"Male gibbon loud morning calls conform to Zipf's law of brevity and Menzerath's law: insights into the origin of human language","title-short":"Male gibbon loud morning calls conform to Zipf's law of brevity and Menzerath's law","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S000334721930377X","volume":"160"},
  {"id":"humphriesNetworkSmallworldnessQuantitative2008","abstract":"Background: Many technological, biological, social, and information networks fall into the broad class of ‘small-world’ networks: they have tightly interconnected clusters of nodes, and a shortest mean path length that is similar to a matched random graph (same number of nodes and edges). This semi-quantitative definition leads to a categorical distinction (‘small/not-small’) rather than a quantitative, continuous grading of networks, and can lead to uncertainty about a network’s small-world status. Moreover, systems described by small-world networks are often studied using an equivalent canonical network model – the Watts-Strogatz (WS) model. However, the process of establishing an equivalent WS model is imprecise and there is a pressing need to discover ways in which this equivalence may be quantified.\nMethodology/Principal Findings: We defined a precise measure of ‘small-world-ness’ S based on the trade off between high local clustering and short path length. A network is now deemed a ‘small-world’ if S.1 - an assertion which may be tested statistically. We then examined the behavior of S on a large data-set of real-world systems. We found that all these systems were linked by a linear relationship between their S values and the network size n. Moreover, we show a method for assigning a unique Watts-Strogatz (WS) model to any real-world network, and show analytically that the WS models associated with our sample of networks also show linearity between S and n. Linearity between S and n is not, however, inevitable, and neither is S maximal for an arbitrary network of given size. Linearity may, however, be explained by a common limiting growth process.\nConclusions/Significance: We have shown how the notion of a small-world network may be quantified. Several key properties of the metric are described and the use of WS canonical models is placed on a more secure footing.","accessed":{"date-parts":[["2023",5,29]]},"author":[{"family":"Humphries","given":"Mark D."},{"family":"Gurney","given":"Kevin"}],"citation-key":"humphriesNetworkSmallworldnessQuantitative2008","container-title":"PLoS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0002051","editor":[{"family":"Sporns","given":"Olaf"}],"ISSN":"1932-6203","issue":"4","issued":{"date-parts":[["2008",4,30]]},"language":"en","page":"e0002051","source":"DOI.org (Crossref)","title":"Network 'small-world-ness': a quantitative method for determining canonical network equivalence","title-short":"Network ‘Small-World-Ness’","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0002051","volume":"3"},
  {"id":"ISI:000334983600006","abstract":"Human speech has combinatorial structure, but it is still unclear how this type of organization emerged in the course of language evolution. There are two positions in the debate about the evolution of combinatorial structure: one stresses the importance of distinctiveness, while the other stresses economy and efficient reuse of building blocks. Different sources of evidence can be used to investigate the origins of combinatorial structure, such as emerging sign languages, animal communication systems, analysis of modem language and computer simulations but each source has its problems. In this article it is demonstrated that a novel empirical method from the field of language evolution can help to gain insight into the emergence of phonological combinatonal organization. This method, experimental iterated learning, allows investigating cultural evolution and the development of structure over time with human participants. We present data from an experiment in which combinatorial structure emerges in artificial whistled languages. We show that our experiment can give insight into the role of distinctiveness and reuse of building blocks and how they interact. We argue that experimental iterated learning offers a valuable new tool for investigating questions on evolutionary phonology and phonetics. (C) 2014 Elsevier Ltd. All rights reserved.","author":[{"family":"Verhoef","given":"Tessa"},{"family":"Kirby","given":"Simon"},{"family":"Boer","given":"Bart","non-dropping-particle":"de"}],"citation-key":"ISI:000334983600006","container-title":"Journal of Phonetics","DOI":"10.1016/j.wocn.2014.02.005","event-place":"24-28 OVAL RD, LONDON NW1 7DX, ENGLAND","ISSN":"0095-4470","issued":{"date-parts":[["2014",3]]},"page":"57-68","publisher":"ACADEMIC PRESS LTD- ELSEVIER SCIENCE LTD","publisher-place":"24-28 OVAL RD, LONDON NW1 7DX, ENGLAND","title":"Emergence of combinatorial structure and economy through iterated learning with continuous acoustic signals","type":"article-journal","volume":"43"},
  {"id":"ISI:000357544300009","abstract":"Language exhibits striking systematic structure. Words are composed of combinations of reusable sounds, and those words in turn are combined to form complex sentences. These properties make language unique among natural communication systems and enable our species to convey an open-ended set of messages. We provide a cultural evolutionary account of the origins of this structure. We show, using simulations of rational learners and laboratory experiments, that structure arises from a trade-off between pressures for compressibility (imposed during learning) and expressivity (imposed during communication). We further demonstrate that the relative strength of these two pressures can be varied in different social contexts, leading to novel predictions about the emergence of structured behaviour in the wild. (C) 2015 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).","author":[{"family":"Kirby","given":"Simon"},{"family":"Tamariz","given":"Monica"},{"family":"Cornish","given":"Hannah"},{"family":"Smith","given":"Kenny"}],"citation-key":"ISI:000357544300009","container-title":"Cognition","DOI":"10.1016/j.cognition.2015.03.016","event-place":"PO BOX 211, 1000 AE AMSTERDAM, NETHERLANDS","ISSN":"0010-0277","issued":{"date-parts":[["2015",8]]},"page":"87-102","publisher":"ELSEVIER SCIENCE BV","publisher-place":"PO BOX 211, 1000 AE AMSTERDAM, NETHERLANDS","title":"Compression and communication in the cultural evolution of linguistic structure","type":"article-journal","volume":"141"},
  {"id":"ISI:000388565700005","abstract":"In language, recombination of a discrete set of meaningless building blocks forms an unlimited set of possible utterances. How such combinatorial structure emerged in the evolution of human language is increasingly being studied. It has been shown that it can emerge when languages culturally evolve and adapt to human cognitive biases. How the emergence of combinatorial structure interacts with the existence of holistic iconic form-meaning mappings in a language is still unknown. The experiment presented in this paper studies the role of iconicity and human cognitive learning biases in the emergence of combinatorial structure in artificial whistled languages. Participants learned and reproduced whistled words for novel objects with the use of a slide whistle. Their reproductions were used as input for the next participant, to create transmission chains and simulate cultural transmission. Two conditions were studied: one in which the persistence of iconic form-meaning mappings was possible and one in which this was experimentally made impossible. In both conditions, cultural transmission caused the whistled languages to become more learnable and more structured, but this process was slightly delayed in the first condition. Our findings help to gain insight into when and how words may lose their iconic origins when they become part of an organized linguistic system.","author":[{"family":"Verhoef","given":"Tessa"},{"family":"Kirby","given":"Simon"},{"family":"Boer","given":"Bart","non-dropping-particle":"de"}],"citation-key":"ISI:000388565700005","container-title":"Cognitive Science","DOI":"10.1111/cogs.12326","event-place":"111 RIVER ST, HOBOKEN 07030-5774, NJ USA","ISSN":"0364-0213","issue":"8","issued":{"date-parts":[["2016",11]]},"page":"1969-1994","publisher":"WILEY-BLACKWELL","publisher-place":"111 RIVER ST, HOBOKEN 07030-5774, NJ USA","title":"Iconicity and the emergence of combinatorial structure in language","type":"article-journal","volume":"40"},
  {"id":"izsak06","accessed":{"date-parts":[["2023",9,6]]},"author":[{"family":"Izsák","given":"János"}],"citation-key":"izsak06","container-title":"Scientometrics","container-title-short":"Scientometrics","DOI":"10.1007/s11192-006-0052-x","ISSN":"0138-9130, 1588-2861","issue":"1","issued":{"date-parts":[["2006",4]]},"language":"en","page":"107-120","source":"DOI.org (Crossref)","title":"Some practical aspects of fitting and testing the Zipf-Mandelbrot model: a short essay","title-short":"Some practical aspects of fitting and testing the Zipf-Mandelbrot model","type":"article-journal","URL":"http://link.springer.com/10.1007/s11192-006-0052-x","volume":"67"},
  {"id":"jaeger_tily11","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Jaeger","given":"T. Florian"},{"family":"Tily","given":"Harry"}],"citation-key":"jaeger_tily11","container-title":"WIREs Cognitive Science","container-title-short":"WIREs Cogn Sci","DOI":"10.1002/wcs.126","ISSN":"1939-5078, 1939-5086","issue":"3","issued":{"date-parts":[["2011",5]]},"language":"en","page":"323-335","source":"DOI.org (Crossref)","title":"On language ‘utility’: processing complexity and communicative efficiency","title-short":"On language ‘utility’","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1002/wcs.126","volume":"2"},
  {"id":"jamesPhylogenyMechanismsShared2021","abstract":"Organizational patterns can be shared across biological systems, and revealing the factors shaping common patterns can provide insight into fundamental biological mechanisms. The behavioral pattern that elements with more constituents tend to consist of shorter constituents (Menzerath’s law [ML]) was described ﬁrst in speech and language (e.g., words with more syllables consist of shorter syllables) and subsequently in music and animal communication. Menzerath’s law is hypothesized to reﬂect efﬁciency in information transfer, but biases and constraints in motor production can also lead to this pattern. We investigated the evolutionary breadth of ML and the contribution of production mechanisms to ML in the songs of 15 songbird species. Negative relationships between the number and duration of constituents (e.g., syllables in phrases) were observed in all 15 species. However, negative relationships were also observed in null models in which constituents were randomly allocated into observed element durations, and the observed negative relationship for numerous species did not differ from the null model; consequently, ML in these species could simply reﬂect production constraints and not communicative efﬁciency. By contrast, ML was signiﬁcantly different from the null model for more than half the cases, suggesting additional organizational rules are imposed onto birdsongs. Production mechanisms are also underscored by the ﬁnding that canaries and zebra ﬁnches reared without auditory experiences that guide vocal development produced songs with nearly identical ML patterning as typically reared birds. These analyses highlight the breadth with which production mechanisms contribute to this prevalent organizational pattern in behavior.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"James","given":"Logan S."},{"family":"Mori","given":"Chihiro"},{"family":"Wada","given":"Kazuhiro"},{"family":"Sakata","given":"Jon T."}],"citation-key":"jamesPhylogenyMechanismsShared2021","container-title":"Current Biology","container-title-short":"Current Biology","DOI":"10.1016/j.cub.2021.04.015","ISSN":"09609822","issue":"13","issued":{"date-parts":[["2021",7]]},"language":"en","page":"2796-2808.e9","source":"DOI.org (Crossref)","title":"Phylogeny and mechanisms of shared hierarchical patterns in birdsong","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0960982221005285","volume":"31"},
  {"id":"JSSv053i09","abstract":"The &amp;lt;b&amp;gt;fastcluster&amp;lt;/b&amp;gt; package is a C++ library for hierarchical, agglomerative clustering. It provides a fast implementation of the most efficient, current algorithms when the input is a dissimilarity index. Moreover, it features memory-saving routines for hierarchical clustering of vector data. It improves both asymptotic time complexity (in most cases) and practical performance (in all cases) compared to the existing implementations in standard software: several R packages, MATLAB, Mathematica, Python with &amp;lt;b&amp;gt;SciPy&amp;lt;/b&amp;gt;.","author":[{"family":"Müllner","given":"Daniel"}],"citation-key":"JSSv053i09","container-title":"Journal of Statistical Software","DOI":"10.18637/jss.v053.i09","issue":"9","issued":{"date-parts":[["2013"]]},"page":"1–18","title":"fastcluster: Fast hierarchical, agglomerative clustering routines for R and python","type":"article-journal","URL":"https://www.jstatsoft.org/index.php/jss/article/view/v053i09","volume":"53"},
  {"id":"Ju2019","author":[{"family":"Ju","given":"Chenghui"},{"family":"Geller","given":"Frances C."},{"family":"Mundinger","given":"Paul C."},{"family":"Lahti","given":"David C."}],"citation-key":"Ju2019","container-title":"The Auk: Ornithological Advances","DOI":"10.1093/auk/uky012","issued":{"date-parts":[["2019"]]},"page":"1-18","title":"Four decades of cultural evolution in house finch songs","type":"article-journal","volume":"136"},
  {"id":"kanwal_etal17","abstract":"The linguist George Kingsley Zipf made a now classic observation about the relationship between a word’s length and its frequency; the more frequent a word is, the shorter it tends to be. He claimed that this ‘‘Law of Abbreviation” is a universal structural property of language. The Law of Abbreviation has since been documented in a wide range of human languages, and extended to animal communication systems and even computer programming languages. Zipf hypothesised that this universal design feature arises as a result of individuals optimising form-meaning mappings under competing pressures to communicate accurately but also efﬁciently—his famous Principle of Least Effort. In this study, we use a miniature artiﬁcial language learning paradigm to provide direct experimental evidence for this explanatory hypothesis. We show that language users optimise form-meaning mappings only when pressures for accuracy and efﬁciency both operate during a communicative task, supporting Zipf’s conjecture that the Principle of Least Effort can explain this universal feature of word length distributions.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Kanwal","given":"Jasmeen"},{"family":"Smith","given":"Kenny"},{"family":"Culbertson","given":"Jennifer"},{"family":"Kirby","given":"Simon"}],"citation-key":"kanwal_etal17","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2017.05.001","ISSN":"00100277","issued":{"date-parts":[["2017",8]]},"language":"en","page":"45-52","source":"DOI.org (Crossref)","title":"Zipf’s law of abbreviation and the principle of least effort: language users optimise a miniature lexicon for efficient communication","title-short":"Zipf’s Law of Abbreviation and the Principle of Least Effort","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027717301166","volume":"165"},
  {"id":"kanwal17","author":[{"family":"Kanwal","given":"Jasmeen"}],"citation-key":"kanwal17","genre":"Doctor of Philosophy","issued":{"date-parts":[["2017"]]},"language":"en","publisher":"School of Philosophy, Psychology, and Language Sciences, University of Edinburgh","source":"Zotero","title":"Word length and the principle of least eﬀort: language as an evolving, efficient code for information transfer","type":"thesis"},
  {"id":"katahiraComplexSequencingRules2011a","abstract":"Complex sequencing rules observed in birdsongs provide an opportunity to investigate the neural mechanism for generating complex sequential behaviors. To relate the findings from studying birdsongs to other sequential behaviors such as human speech and musical performance, it is crucial to characterize the statistical properties of the sequencing rules in birdsongs. However, the properties of the sequencing rules in birdsongs have not yet been fully addressed. In this study, we investigate the statistical properties of the complex birdsong of the Bengalese finch (Lonchura striata var. domestica). Based on manual-annotated syllable labeles, we first show that there are significant higher-order context dependencies in Bengalese finch songs, that is, which syllable appears next depends on more than one previous syllable. We then analyze acoustic features of the song and show that higher-order context dependencies can be explained using first-order hidden state transition dynamics with redundant hidden states. This model corresponds to hidden Markov models (HMMs), well known statistical models with a large range of application for time series modeling. The song annotation with these models with first-order hidden state dynamics agreed well with manual annotation, the score was comparable to that of a secondorder HMM, and surpassed the zeroth-order model (the Gaussian mixture model; GMM), which does not use context information. Our results imply that the hierarchical representation with hidden state dynamics may underlie the neural implementation for generating complex behavioral sequences with higher-order dependencies.","accessed":{"date-parts":[["2023",5,29]]},"author":[{"family":"Katahira","given":"Kentaro"},{"family":"Suzuki","given":"Kenta"},{"family":"Okanoya","given":"Kazuo"},{"family":"Okada","given":"Masato"}],"citation-key":"katahiraComplexSequencingRules2011a","container-title":"PLoS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0024516","editor":[{"family":"De Polavieja","given":"Gonzalo G."}],"ISSN":"1932-6203","issue":"9","issued":{"date-parts":[["2011",9,7]]},"language":"en","page":"e24516","source":"DOI.org (Crossref)","title":"Complex sequencing rules of birdsong can be explained by simple hidden Markov processes","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0024516","volume":"6"},
  {"id":"kershenbaum_etal16","accessed":{"date-parts":[["2023",6,1]]},"author":[{"family":"Kershenbaum","given":"Arik"},{"family":"Blumstein","given":"Daniel T."},{"family":"Roch","given":"Marie A."},{"family":"Akçay","given":"Çağlar"},{"family":"Backus","given":"Gregory"},{"family":"Bee","given":"Mark A."},{"family":"Bohn","given":"Kirsten"},{"family":"Cao","given":"Yan"},{"family":"Carter","given":"Gerald"},{"family":"Cäsar","given":"Cristiane"},{"family":"Coen","given":"Michael"},{"family":"DeRuiter","given":"Stacy L."},{"family":"Doyle","given":"Laurance"},{"family":"Edelman","given":"Shimon"},{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Freeberg","given":"Todd M."},{"family":"Garland","given":"Ellen C."},{"family":"Gustison","given":"Morgan"},{"family":"Harley","given":"Heidi E."},{"family":"Huetz","given":"Chloé"},{"family":"Hughes","given":"Melissa"},{"family":"Hyland Bruno","given":"Julia"},{"family":"Ilany","given":"Amiyaal"},{"family":"Jin","given":"Dezhe Z."},{"family":"Johnson","given":"Michael"},{"family":"Ju","given":"Chenghui"},{"family":"Karnowski","given":"Jeremy"},{"family":"Lohr","given":"Bernard"},{"family":"Manser","given":"Marta B."},{"family":"McCowan","given":"Brenda"},{"family":"Mercado","given":"Eduardo"},{"family":"Narins","given":"Peter M."},{"family":"Piel","given":"Alex"},{"family":"Rice","given":"Megan"},{"family":"Salmi","given":"Roberta"},{"family":"Sasahara","given":"Kazutoshi"},{"family":"Sayigh","given":"Laela"},{"family":"Shiu","given":"Yu"},{"family":"Taylor","given":"Charles"},{"family":"Vallejo","given":"Edgar E."},{"family":"Waller","given":"Sara"},{"family":"Zamora-Gutierrez","given":"Veronica"}],"citation-key":"kershenbaum_etal16","container-title":"Biological Reviews","container-title-short":"Biol Rev","DOI":"10.1111/brv.12160","issued":{"date-parts":[["2016"]]},"page":"13-52","source":"DOI.org (Crossref)","title":"Acoustic sequences in non-human animals: a tutorial review and prospectus","type":"article-journal","URL":"https://doi.org/10.1111/brv.12160","volume":"91"},
  {"id":"kershenbaum_etal21","abstract":"Abstract\n            \n              \n                \n                  Information complexity in animals is an indicator of advanced communication and an intricate socio‐ecology. Zipf's Law of least effort has been used to assess the potential information content of animal repertoires, including whether or not a particular animal communication could be ‘language‐like’. As all human languages follow Zipf's law, with a power law coefficient (PLC) close to −1, animal signals with similar probability distributions are postulated to possess similar information characteristics to language. However, estimation of the PLC from limited empirical datasets (e.g. most animal communication studies) is problematic because of biases from small sample sizes.\n                \n                \n                  The traditional approach to estimating Zipf's law PLC is to find the slope of a log–log rank‐frequency plot. Our alternative option uses the underlying equivalence between Shannon entropy (i.e. whether successive elements of a sequence are unpredictable, or repetitive) and PLC. Here, we test whether an entropy approach yields more robust estimates of Zipf's law PLC than the traditional approach.\n                \n                \n                  We examined the efficacy of the entropy approach in two ways. First, we estimated the PLC from synthetic datasets generated with a priori known power law probability distributions. This revealed that the estimated PLC using the traditional method is particularly inaccurate for highly stereotyped sequences, even at modest repertoire sizes. Estimation via Shannon entropy is accurate with modest sample sizes even for repertoires with thousands of distinct elements. Second, we applied these approaches to empirical data taken from 11 animal species. Shannon entropy produced a more robust estimate of PLC with lower variance than the traditional method, even when the true PLC is unknown. Our approach for the first time reveals Zipf's law operating in the vocal systems of multiple lineages: songbirds, hyraxes and cetaceans.\n                \n                \n                  As different methods of estimating the PLC can lead to misleading results in real data, estimating the balance of a communication system between simplicity and complexity is best performed using the entropy approach. This provides a more robust way to investigate the evolutionary constraints and processes that have acted on animal communication systems, and the parallels between these processes and the evolution of language.","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Kershenbaum","given":"Arik"},{"family":"Demartsev","given":"Vlad"},{"family":"Gammon","given":"David E."},{"family":"Geffen","given":"Eli"},{"family":"Gustison","given":"Morgan L."},{"family":"Ilany","given":"Amiyaal"},{"family":"Lameira","given":"Adriano R."}],"citation-key":"kershenbaum_etal21","container-title":"Methods in Ecology and Evolution","container-title-short":"Methods Ecol Evol","DOI":"10.1111/2041-210X.13536","editor":[{"family":"Zamora‐Gutierrez","given":"Veronica"}],"ISSN":"2041-210X, 2041-210X","issue":"3","issued":{"date-parts":[["2021",3]]},"language":"en","page":"553-564","source":"DOI.org (Crossref)","title":"Shannon entropy as a robust estimator of Zipf's Law in animal vocal communication repertoires","type":"article-journal","URL":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/2041-210X.13536","volume":"12"},
  {"id":"kershenbaumAnimalVocalSequences2014","abstract":"Many animals produce vocal sequences that appear complex. Most researchers assume that these sequences are well characterized as Markov chains (i.e. that the probability of a particular vocal element can be calculated from the history of only a finite number of preceding elements). However, this assumption has never been explicitly tested. Furthermore, it is unclear how language could evolve in a single step from a Markovian origin, as is frequently assumed, as no intermediate forms have been found between animal communication and human language. Here, we assess whether animal taxa produce vocal sequences that are better described by Markov chains, or by non-Markovian dynamics such as the ‘renewal process’ (RP), characterized by a strong tendency to repeat elements. We examined vocal sequences of seven taxa: Bengalese finches\n              Lonchura striata domestica\n              , Carolina chickadees\n              Poecile carolinensis\n              , free-tailed bats\n              Tadarida brasiliensis\n              , rock hyraxes\n              Procavia capensis\n              , pilot whales\n              Globicephala macrorhynchus\n              , killer whales\n              Orcinus orca\n              and orangutans\n              Pongo\n              spp\n              .\n              The vocal systems of most of these species are more consistent with a non-Markovian RP than with the Markovian models traditionally assumed. Our data suggest that non-Markovian vocal sequences may be more common than Markov sequences, which must be taken into account when evaluating alternative hypotheses for the evolution of signalling complexity, and perhaps human language origins.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Kershenbaum","given":"Arik"},{"family":"Bowles","given":"Ann E."},{"family":"Freeberg","given":"Todd M."},{"family":"Jin","given":"Dezhe Z."},{"family":"Lameira","given":"Adriano R."},{"family":"Bohn","given":"Kirsten"}],"citation-key":"kershenbaumAnimalVocalSequences2014","container-title":"Proceedings of the Royal Society B: Biological Sciences","container-title-short":"Proc. R. Soc. B.","DOI":"10.1098/rspb.2014.1370","ISSN":"0962-8452, 1471-2954","issue":"1792","issued":{"date-parts":[["2014",10,7]]},"language":"en","page":"20141370","source":"DOI.org (Crossref)","title":"Animal vocal sequences: not the Markov chains we thought they were","title-short":"Animal vocal sequences","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rspb.2014.1370","volume":"281"},
  {"id":"kirby_etal08","abstract":"We introduce an experimental paradigm for studying the cumulative cultural evolution of language. In doing so we provide the first experimental validation for the idea that cultural transmission can lead to the appearance of design without a designer. Our experiments involve the iterated learning of artificial languages by human participants. We show that languages transmitted culturally evolve in such a way as to maximize their own transmissibility: over time, the languages in our experiments become easier to learn and increasingly structured. Furthermore, this structure emerges purely as a consequence of the transmission of language over generations, without any intentional design on the part of individual language learners. Previous computational and mathematical models suggest that iterated learning provides an explanation for the structure of human language and link particular aspects of linguistic structure with particular constraints acting on language during its transmission. The experimental work presented here shows that the predictions of these models, and models of cultural evolution more generally, can be tested in the laboratory.","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Kirby","given":"Simon"},{"family":"Cornish","given":"Hannah"},{"family":"Smith","given":"Kenny"}],"citation-key":"kirby_etal08","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.0707835105","ISSN":"0027-8424, 1091-6490","issue":"31","issued":{"date-parts":[["2008",8,5]]},"language":"en","page":"10681-10686","source":"DOI.org (Crossref)","title":"Cumulative cultural evolution in the laboratory: An experimental approach to the origins of structure in human language","title-short":"Cumulative cultural evolution in the laboratory","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.0707835105","volume":"105"},
  {"id":"kirby_etal14","accessed":{"date-parts":[["2023",8,29]]},"author":[{"family":"Kirby","given":"Simon"},{"family":"Griffiths","given":"Tom"},{"family":"Smith","given":"Kenny"}],"citation-key":"kirby_etal14","container-title":"Current Opinion in Neurobiology","container-title-short":"Current Opinion in Neurobiology","DOI":"10.1016/j.conb.2014.07.014","ISSN":"09594388","issued":{"date-parts":[["2014",10]]},"language":"en","page":"108-114","source":"DOI.org (Crossref)","title":"Iterated learning and the evolution of language","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0959438814001421","volume":"28"},
  {"id":"kirby17","abstract":"Language is systematically structured at all levels of description, arguably setting it apart from all other instances of communication in nature. In this article, I survey work over the last 20 years that emphasises the contributions of individual learning, cultural transmission, and biological evolution to explaining the structural design features of language. These 3 complex adaptive systems exist in a network of interactions: individual learning biases shape the dynamics of cultural evolution; universal features of linguistic structure arise from this cultural process and form the ultimate linguistic phenotype; the nature of this phenotype affects the fitness landscape for the biological evolution of the language faculty; and in turn this determines individuals’ learning bias. Using a combination of computational simulation, laboratory experiments, and comparison with real-world cases of language emergence, I show that linguistic structure emerges as a natural outcome of cultural evolution once certain minimal biological requirements are in place.","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Kirby","given":"Simon"}],"citation-key":"kirby17","container-title":"Psychonomic Bulletin & Review","container-title-short":"Psychon Bull Rev","DOI":"10.3758/s13423-016-1166-7","ISSN":"1069-9384, 1531-5320","issue":"1","issued":{"date-parts":[["2017",2]]},"language":"en","page":"118-137","source":"DOI.org (Crossref)","title":"Culture and biology in the origins of linguistic structure","type":"article-journal","URL":"http://link.springer.com/10.3758/s13423-016-1166-7","volume":"24"},
  {"id":"koshevoy_etal23","abstract":"Zipf’s Law of Abbreviation – the idea that more frequent symbols in a code are simpler than less frequent ones – has been shown to hold at the level of words in many languages. We tested whether it holds at the level of individual written characters. Character complexity is similar to word length in that it requires more cognitive and motor effort for producing and processing more complex symbols. We built a dataset of character complexity and frequency measures covering 27 different writing systems. According to our data, Zipf’s Law of Abbreviation holds for every writing system in our dataset — the more frequent characters have lower degrees of complexity and vice-versa. This result provides further evidence of optimization mechanisms shaping communication systems.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Koshevoy","given":"Alexey"},{"family":"Miton","given":"Helena"},{"family":"Morin","given":"Olivier"}],"citation-key":"koshevoy_etal23","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2023.105527","ISSN":"00100277","issued":{"date-parts":[["2023",9]]},"language":"en","page":"105527","source":"DOI.org (Crossref)","title":"Zipf’s law of abbreviation holds for individual characters across a broad range of writing systems","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027723001610","volume":"238"},
  {"id":"Lachlan2018","author":[{"family":"Lachlan","given":"Robert F."},{"family":"Ratmann","given":"Oliver"},{"family":"Nowicki","given":"Stephen"}],"citation-key":"Lachlan2018","container-title":"Nature Communications","DOI":"10.1038/s41467-018-04728-1","issued":{"date-parts":[["2018"]]},"publisher":"Springer US","title":"Cultural conformity generates extremely stable traditions in bird song","type":"article-journal","URL":"http://dx.doi.org/10.1038/s41467-018-04728-1","volume":"9"},
  {"id":"lahti20","author":[{"family":"Lahti","given":"David C."}],"citation-key":"lahti20","issued":{"date-parts":[["2020"]]},"type":"personal_communication"},
  {"id":"langfelder_etal08","abstract":"Summary: Hierarchical clustering is a widely used method for detecting clusters in genomic data. Clusters are defined by cutting branches off the dendrogram. A common but inflexible method uses a constant height cutoff value; this method exhibits suboptimal performance on complicated dendrograms. We present the Dynamic Tree Cut R package that implements novel dynamic branch cutting methods for detecting clusters in a dendrogram depending on their shape. Compared to the constant height cutoff method, our techniques offer the following advantages: (1) they are capable of identifying nested clusters; (2) they are flexible—cluster shape parameters can be tuned to suit the application at hand; (3) they are suitable for automation; and (4) they can optionally combine the advantages of hierarchical clustering and partitioning around medoids, giving better detection of outliers. We illustrate the use of these methods by applying them to protein–protein interaction network data and to a simulated gene expression data set.","accessed":{"date-parts":[["2023",6,2]]},"author":[{"family":"Langfelder","given":"Peter"},{"family":"Zhang","given":"Bin"},{"family":"Horvath","given":"Steve"}],"citation-key":"langfelder_etal08","container-title":"Bioinformatics","DOI":"10.1093/bioinformatics/btm563","ISSN":"1367-4811, 1367-4803","issue":"5","issued":{"date-parts":[["2008",3,1]]},"language":"en","page":"719-720","source":"DOI.org (Crossref)","title":"Defining clusters from a hierarchical cluster tree: the Dynamic Tree Cut package for R","title-short":"Defining clusters from a hierarchical cluster tree","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/24/5/719/200751","volume":"24"},
  {"id":"leonardo_konishi99","accessed":{"date-parts":[["2023",9,14]]},"author":[{"family":"Leonardo","given":"Anthony"},{"family":"Konishi","given":"Masakazu"}],"citation-key":"leonardo_konishi99","container-title":"Nature","container-title-short":"Nature","DOI":"10.1038/20933","ISSN":"0028-0836, 1476-4687","issue":"6735","issued":{"date-parts":[["1999",6]]},"language":"en","page":"466-470","source":"DOI.org (Crossref)","title":"Decrystallization of adult birdsong by perturbation of auditory feedback","type":"article-journal","URL":"https://www.nature.com/articles/20933","volume":"399"},
  {"id":"lewis_etal23","abstract":"Abstract\n          \n            Linguistic laws, which describe common statistical patterns in human language, are often studied in animal communication systems. Despite good evidence for the existence of these laws in non-human primates, data is still limited for other taxa. Birdsong is often used as a model for human language development due to similarities in vocal learning and production. Therefore, it is useful to explore features of human language in birdsong to determine the value and limitations of such comparisons. Here, we looked for patterns consistent with Menzerath’s law, the tendency for longer sequences to be made up of smaller constituent parts, and Zipf’s Law of Abbreviation, the tendency for more frequently used elements to be shorter in length, in the songs of Java sparrows (\n            Padda oryzivora\n            ). We found that songs conformed to Menzerath’s law at both the population and individual level; longer sequences were made up of shorter notes, and this pattern was achieved through note selection, rather than shortening existing notes. This adherence to Menzerath’s law may reflect species-specific constraints on song durations. However, we found no evidence to support adherence to Zipf’s Law of Abbreviation, either at population or individual level; more frequently used notes were not shorter in length. As they are used in courtship, songs may experience different selection pressure to other parts of the vocal repertoire, which could act against compression. Whilst there may be some limitations in applying linguistic laws designed for human language to birdsong, especially Zipf’s Law of Abbreviation, these laws may still provide insights into animal and human communication systems.","accessed":{"date-parts":[["2024",1,25]]},"author":[{"family":"Lewis","given":"Rebecca N"},{"family":"Kwong","given":"Anthony"},{"family":"Soma","given":"Masayo"},{"family":"De Kort","given":"Selvino R"},{"family":"Gilman","given":"R Tucker"}],"citation-key":"lewis_etal23","DOI":"10.1101/2023.12.13.571437","genre":"preprint","issued":{"date-parts":[["2023",12,14]]},"language":"en","publisher":"Animal Behavior and Cognition","source":"DOI.org (Crossref)","title":"Java sparrow song conforms to Menzerath’s Law but not Zipf’s Law of Abbreviation","type":"report","URL":"http://biorxiv.org/lookup/doi/10.1101/2023.12.13.571437"},
  {"id":"li90","accessed":{"date-parts":[["2023",8,10]]},"author":[{"family":"Li","given":"Wentian"}],"citation-key":"li90","container-title":"Journal of Statistical Physics","container-title-short":"J Stat Phys","DOI":"10.1007/BF01025996","ISSN":"0022-4715, 1572-9613","issue":"5-6","issued":{"date-parts":[["1990",9]]},"language":"en","page":"823-837","source":"DOI.org (Crossref)","title":"Mutual information functions versus correlation functions","type":"article-journal","URL":"http://link.springer.com/10.1007/BF01025996","volume":"60"},
  {"id":"linCriticalBehaviorPhysics2017","abstract":"We show that the mutual information between two symbols, as a function of the number of symbols between the two, decays exponentially in any probabilistic regular grammar, but can decay like a power law for a context-free grammar. This result about formal languages is closely related to a well-known result in classical statistical mechanics that there are no phase transitions in dimensions fewer than two. It is also related to the emergence of power law correlations in turbulence and cosmological inﬂation through recursive generative processes. We elucidate these physics connections and comment on potential applications of our results to machine learning tasks like training artiﬁcial recurrent neural networks. Along the way, we introduce a useful quantity, which we dub the rational mutual information, and discuss generalizations of our claims involving more complicated Bayesian networks.","accessed":{"date-parts":[["2023",5,29]]},"author":[{"family":"Lin","given":"Henry"},{"family":"Tegmark","given":"Max"}],"citation-key":"linCriticalBehaviorPhysics2017","container-title":"Entropy","container-title-short":"Entropy","DOI":"10.3390/e19070299","ISSN":"1099-4300","issue":"7","issued":{"date-parts":[["2017",6,23]]},"language":"en","page":"299","source":"DOI.org (Crossref)","title":"Critical behavior in physics and probabilistic formal languages","type":"article-journal","URL":"http://www.mdpi.com/1099-4300/19/7/299","volume":"19"},
  {"id":"linders_louwerse23","abstract":"The ubiquitous inverse relationship between word frequency and word rank is commonly known as Zipf’s law. The theoretical underpinning of this law states that the inverse relationship yields decreased effort in both the speaker and hearer, the so-called principle of least effort. Most research has focused on showing an inverse relationship only for written monolog, only for frequencies and ranks of one linguistic unit, generally word unigrams, with strong correlations of the power law to the observed frequency distributions, with limited to no attention to psychological mechanisms such as the principle of least effort. The current paper extends the existing findings, by not focusing on written monolog but on a more fundamental form of communication, spoken dialog, by not only investigating word unigrams but also units quantified on syntactic, pragmatic, utterance, and nonverbal communicative levels by showing that the adequacy of Zipf’s formula seems ubiquitous, but the exponent of the power law curve is not, and by placing these findings in the context of Zipf’s principle of least effort through redefining effort in terms of cognitive resources available for communication. Our findings show that Zipf’s law also applies to a more natural form of communication—that of spoken dialog, that it applies to a range of linguistic units beyond word unigrams, that the general good fit of Zipf’s law needs to be revisited in light of the parameters of the formula, and that the principle of least effort is a useful theoretical framework for the findings of Zipf’s law.","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Linders","given":"Guido M."},{"family":"Louwerse","given":"Max M."}],"citation-key":"linders_louwerse23","container-title":"Psychonomic Bulletin & Review","container-title-short":"Psychon Bull Rev","DOI":"10.3758/s13423-022-02142-9","ISSN":"1069-9384, 1531-5320","issue":"1","issued":{"date-parts":[["2023",2]]},"language":"en","page":"77-101","source":"DOI.org (Crossref)","title":"Zipf’s law revisited: Spoken dialog, linguistic units, parameters, and the principle of least effort","title-short":"Zipf’s law revisited","type":"article-journal","URL":"https://link.springer.com/10.3758/s13423-022-02142-9","volume":"30"},
  {"id":"macutek22","abstract":"The Zipf-Mandelbrot distribution serves as a mathematical model for ranked frequencies in many areas of scientific research, including linguistics. Many linguistic units, like e.g., words or word n-grams, follow this distribution. However, in some cases, such as for graphemes in linguistics or species abun­ dance and diversity data in biology, the parameters of the Zipf-Mandelbrot distribution are virtually uninterpretable, as their values strongly depend on the precision of numerical methods used to estimate them (values from several tens to several hundreds are not uncommon). It is shown in the paper that these values can be explained by the convergence to the geometric distribution, which forces both parameters of the Zipf-Mandelbrot distribution to increase to infinity while their ratio converges to a constant. Some examples which illustrate this limit behaviour are presented.","accessed":{"date-parts":[["2023",9,7]]},"author":[{"family":"Mačutek","given":"Ján"}],"citation-key":"macutek22","container-title":"Journal of Quantitative Linguistics","container-title-short":"Journal of Quantitative Linguistics","DOI":"10.1080/09296174.2021.1887613","ISSN":"0929-6174, 1744-5035","issue":"4","issued":{"date-parts":[["2022",10,2]]},"language":"en","page":"413-424","source":"DOI.org (Crossref)","title":"Why do parameter values in the Zipf-Mandelbrot distribution sometimes explode?","type":"article-journal","URL":"https://www.tandfonline.com/doi/full/10.1080/09296174.2021.1887613","volume":"29"},
  {"id":"Mandelbrot1953","author":[{"family":"Mandelbrot","given":"Benoit"}],"citation-key":"Mandelbrot1953","container-title":"Communication Theory","issued":{"date-parts":[["1953"]]},"page":"486-502","title":"An informational theory of the statistical structure of language","type":"article-journal"},
  {"id":"Mandelbrot1962","author":[{"family":"Mandelbrot","given":"Benoit"}],"citation-key":"Mandelbrot1962","issued":{"date-parts":[["1962"]]},"page":"190-219","title":"On the theory of word frequencies and on related Markovian models of discourse","type":"article-journal"},
  {"id":"manin09","abstract":"Zipf’s law states that if words of a language are sorted in the order of decreasing frequency of usage, a word’s frequency is inversely proportional to its rank, or sequence number in the list. The Zipf-Mandelbrot law is a more general formula that provides a better ﬁt in the low-rank region. Among several models aimed at explaining this eﬀect, Mandelbrot’s model is one of the best known. It derives Zipf’s law as a result of the optimization of information/cost ratio, but leads to an unrealistic view of texts as random character sequences. In this article, a new modiﬁcation of the model is proposed that is free from this drawback and allows the optimal information/cost ratio to be achieved via language evolution. It is demonstrated that the Zipf-Mandelbrot formula follows from this model, but its two parameters are not independent. As a result, the formula cannot convincingly be ﬁtted to the actual word frequency distributions.","accessed":{"date-parts":[["2023",9,7]]},"author":[{"family":"Manin","given":"D. Yu."}],"citation-key":"manin09","container-title":"Journal of Quantitative Linguistics","container-title-short":"Journal of Quantitative Linguistics","DOI":"10.1080/09296170902850358","ISSN":"0929-6174, 1744-5035","issue":"3","issued":{"date-parts":[["2009",8]]},"language":"en","page":"274-285","source":"DOI.org (Crossref)","title":"Mandelbrot's model for Zipf's law: can Mandelbrot's model explain Zipf's law for language?","title-short":"Mandelbrot's Model for Zipf's Law","type":"article-journal","URL":"http://www.tandfonline.com/doi/abs/10.1080/09296170902850358","volume":"16"},
  {"id":"Mann2020","author":[{"family":"Mann","given":"Dan C."},{"family":"Lahti","given":"David C."},{"family":"Waddick","given":"Laura"},{"family":"Mundinger","given":"Paul C."}],"citation-key":"Mann2020","container-title":"Bioacoustics","DOI":"10.1080/09524622.2020.1718551","issued":{"date-parts":[["2020"]]},"page":"1-17","title":"House finches learn canary trills","type":"article-journal"},
  {"id":"martins94","accessed":{"date-parts":[["2023",8,3]]},"author":[{"family":"Martins","given":"Emília P."}],"citation-key":"martins94","container-title":"Copeia","container-title-short":"Copeia","DOI":"10.2307/1446717","ISSN":"00458511","issue":"4","issued":{"date-parts":[["1994",12,19]]},"language":"en","page":"944","source":"DOI.org (Crossref)","title":"Structural complexity in a lizard communication system: the Sceloporus graciosus \"push-up\" display","title-short":"Structural Complexity in a Lizard Communication System","type":"article-journal","URL":"https://www.jstor.org/stable/1446717?origin=crossref","volume":"1994"},
  {"id":"mccowan_etal99","accessed":{"date-parts":[["2023",8,3]]},"author":[{"family":"McCowan","given":"Brenda"},{"family":"Hanser","given":"Sean F."},{"family":"Doyle","given":"Laurance R."}],"citation-key":"mccowan_etal99","container-title":"Animal Behaviour","container-title-short":"Animal Behaviour","DOI":"10.1006/anbe.1998.1000","ISSN":"00033472","issue":"2","issued":{"date-parts":[["1999",2]]},"language":"en","page":"409-419","source":"DOI.org (Crossref)","title":"Quantitative tools for comparing animal communication systems: information theory applied to bottlenose dolphin whistle repertoires","title-short":"Quantitative tools for comparing animal communication systems","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0003347298910004","volume":"57"},
  {"id":"mehri_jamaati21","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Mehri","given":"Ali"},{"family":"Jamaati","given":"Maryam"}],"citation-key":"mehri_jamaati21","container-title":"Chaos, Solitons & Fractals","container-title-short":"Chaos, Solitons & Fractals","DOI":"10.1016/j.chaos.2021.110679","ISSN":"09600779","issued":{"date-parts":[["2021",3]]},"language":"en","page":"110679","source":"DOI.org (Crossref)","title":"Statistical metrics for languages classification: a case study of the Bible translations","title-short":"Statistical metrics for languages classification","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0960077921000321","volume":"144"},
  {"id":"melnyk_etal05","accessed":{"date-parts":[["2023",8,11]]},"author":[{"family":"Melnyk","given":"S. S."},{"family":"Usatenko","given":"O. V."},{"family":"Yampol’skii","given":"V. A."},{"family":"Golick","given":"V. A."}],"citation-key":"melnyk_etal05","container-title":"Physical Review E","container-title-short":"Phys. Rev. E","DOI":"10.1103/PhysRevE.72.026140","ISSN":"1539-3755, 1550-2376","issue":"2","issued":{"date-parts":[["2005",8,31]]},"language":"en","page":"026140","source":"DOI.org (Crossref)","title":"Competition between two kinds of correlations in literary texts","type":"article-journal","URL":"https://link.aps.org/doi/10.1103/PhysRevE.72.026140","volume":"72"},
  {"id":"Mennill2006","abstract":"SUMMARY Neisseria meningitidis is a life-threatening human bacterial pathogen responsible for pneumonia, sepsis, and meningitis. Meningococcal strains with reduced susceptibility to penicillin G (Pen I) carry a mutated penicillin-binding protein (PBP2) resulting in a modified peptidoglycan structure. Despite their antibiotic resistance, Pen I strains have failed to expand clonally. We analyzed the biological con-sequences of PBP2 alteration among clinical menin-gococcal strains and found that peptidoglycan modifications of the Pen I strain resulted in dimin-ished in vitro Nod1-dependent proinflammatory activity. In an influenza virus-meningococcal sequential mouse model mimicking human disease, wild-type meningococci induced a Nod1-dependent inflammatory response, colonizing the lungs and surviving in the blood. In contrast, isogenic Pen I strains were attenuated for such response and were out-competed by meningococci sensitive to penicillin G. Our results suggest that antibiotic resis-tance imposes a cost to the success of the pathogen and may potentially explain the lack of clonal expan-sion of Pen I strains.","author":[{"family":"Mennill","given":"Daniel J."},{"family":"Badyaev","given":"Alexander V."},{"family":"Jonart","given":"Leslie M."},{"family":"Hill","given":"Geoffrey E."}],"citation-key":"Mennill2006","container-title":"Ethology","DOI":"10.1111/j.1439-0310.2006.01145.x","ISBN":"0179-1613","ISSN":"01791613","issue":"2","issued":{"date-parts":[["2006"]]},"page":"174-180","title":"Male house finches with elaborate songs have higher reproductive performance","type":"article-journal","volume":"112"},
  {"id":"menzerath54","author":[{"family":"Menzerath","given":"Paul"}],"citation-key":"menzerath54","event-place":"Bonn","issued":{"date-parts":[["1954"]]},"publisher":"Dümmler","publisher-place":"Bonn","title":"Die Architektonik des Deutschen Wortschatzes","type":"book"},
  {"id":"merinorecalde23","abstract":"Abstract\n            \n              \n                \n                  Studying the vocalisations of wild animals can be a challenge due to the limitations of traditional computational methods, which often are time‐consuming and lack reproducibility.\n                \n                \n                  Here, I present pykanto, a new software package that provides a set of tools to build, manage, and explore large sound databases. It can automatically find discrete units in animal vocalisations, perform semi‐supervised labelling of individual repertoires with a new interactive web app and feed data to deep learning models. pykanto can be used to streamline research on, for example, individual vocal signatures and acoustic similarity between individuals and populations.\n                \n                \n                  To demonstrate its capabilities, I put the library to the test on the vocalisations of male great tits in Wytham Woods, near Oxford, UK.\n                \n                \n                  The results show that the identities of individual birds can be accurately determined from their songs and that the use of pykanto improves the efficiency and reproducibility of the process.\n                \n              \n            \n          , \n            Resumen\n            \n              \n                \n                  Estudiar vocalizaciones de animales en libertad supone un desafio debido a las limitaciones impuestas por los métodos computacionales tradicionales, que a menudo son lentos y no permiten una reproducción fiable de los resultados.\n                \n                \n                  En este articulo presento pykanto, una nueva librería de software que proporciona un conjunto de herramientas para construir, gestionar y explorar grandes bases de datos acústicos. pykanto puede encontrar unidades acústicas discretas en vocalizaciones animales, realizar etiquetado semi‐supervisado de repertorios individuales utilizando una nueva aplicación web interactiva, y preparar datos para entrenar a modelos de aprendizaje profundo. De este modo facilita estudiar, por ejemplo, la similitud acústica entre individuos y poblaciones.\n                \n                \n                  Para demostrar sus capacidades, testé la librería con vocalizaciones de carboneros comunes grabadas en Wytham Woods, cerca de Oxford, Reino Unido.\n                \n                \n                  Los resultados muestran que las identidades individuales de las aves pueden ser determinadas con precisión a partir de sus cantos y que el uso de pykanto mejora la eficiencia y la reproducibilidad del proceso.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Merino Recalde","given":"Nilo"}],"citation-key":"merinorecalde23","container-title":"Methods in Ecology and Evolution","container-title-short":"Methods Ecol Evol","DOI":"10.1111/2041-210X.14155","ISSN":"2041-210X, 2041-210X","issue":"8","issued":{"date-parts":[["2023",8]]},"language":"en","page":"1994-2002","source":"DOI.org (Crossref)","title":"pykanto: A python library to accelerate research on wild bird song","title-short":"pykanto","type":"article-journal","URL":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/2041-210X.14155","volume":"14"},
  {"id":"mesoudi11","author":[{"family":"Mesoudi","given":"A"}],"citation-key":"mesoudi11","container-title":"PLOS ONE","DOI":"10.1371/journal.- 10.1371/journal.pone.0018239.g001","issue":"3","issued":{"date-parts":[["2011"]]},"page":"e18239","title":"Variable Cultural Acquisition Costs Constrain Cumulative Cultural Evolution","type":"article-journal","volume":"6"},
  {"id":"mikula_etal18","accessed":{"date-parts":[["2023",8,25]]},"author":[{"family":"Mikula","given":"Peter"},{"family":"Petrusková","given":"Tereza"},{"family":"Albrecht","given":"Tomáš"}],"citation-key":"mikula_etal18","container-title":"Evolution","container-title-short":"Evolution","DOI":"10.1111/evo.13634","ISSN":"0014-3820, 1558-5646","issue":"12","issued":{"date-parts":[["2018",12]]},"language":"en","page":"2832-2835","source":"DOI.org (Crossref)","title":"Song complexity—no correlation between standard deviation of frequency and traditionally used song complexity metrics in passerines: A comment on Pearse et al. (2018)","title-short":"Song complexity—no correlation between standard deviation of frequency and traditionally used song complexity metrics in passerines","type":"article-journal","URL":"https://academic.oup.com/evolut/article/72/12/2832/6726734","volume":"72"},
  {"id":"miller57","accessed":{"date-parts":[["2023",9,21]]},"archive":"JSTOR","author":[{"family":"Miller","given":"George A."}],"citation-key":"miller57","container-title":"The American Journal of Psychology","DOI":"10.2307/1419346","ISSN":"00029556","issue":"2","issued":{"date-parts":[["1957"]]},"page":"311-314","publisher":"University of Illinois Press","title":"Some effects of intermittent silence","type":"article-journal","URL":"http://www.jstor.org/stable/1419346","volume":"70"},
  {"id":"mitonGraphicComplexityWriting2021","abstract":"A writing system is a graphic code, i.e., a system of standardized pairings between symbols and meanings in which symbols take the form of images that can endure. The visual character of writing implies that written characters have to fit constraints of the human visual system. One aspect of this optimization lays in the graphic complexity of the characters used by scripts. Scripts are sets of graphic characters used for the written form of one language or more. Using computational methods over a large and diverse dataset (over 47,000 characters, from over 133 scripts), we answer three central questions about the visual complexity of written characters and the evolution of writing: (1) What determines character complexity? (2) Can we find traces of evolutionary change in character complexity? (3) Is complexity distributed in a way that makes character recognition easier? Our study suggests that (1) character complexity depends primarily on which linguistic unit the characters encode, and that (2) there is little evidence of evolutionary change in character complexity. Additionally (3) for an individual character, the half which is encountered first while reading tends to be more complex than that which is encountered last.","author":[{"family":"Miton","given":"Helena"},{"family":"Morin","given":"Olivier"}],"citation-key":"mitonGraphicComplexityWriting2021","container-title":"Cognition","DOI":"10.1016/j.cognition.2021.104771","ISSN":"18737838","issued":{"date-parts":[["2021"]]},"page":"104771","PMID":"34034009","publisher":"Elsevier B.V.","title":"Graphic complexity in writing systems","type":"article-journal","URL":"https://doi.org/10.1016/j.cognition.2021.104771","volume":"214"},
  {"id":"miyagawa_etal13","abstract":"We propose a novel account for the emergence of human language syntax. Like many evolutionary innovations, language arose from the adventitious combination of two preexisting, simpler systems that had been evolved for other functional tasks.The ﬁrst system, Type E(xpression), is found in birdsong, where the same song marks territory, mating availability, and similar “expressive” functions. The second system, Type L(exical), has been suggestively found in non-human primate calls and in honeybee waggle dances, where it demarcates predicates with one or more “arguments,” such as combinations of calls in monkeys or compass headings set to sun position in honeybees. We show that human language syntax is composed of two layers that parallel these two independently evolved systems: an “E” layer resembling the Type E system of birdsong and an “L” layer providing words. The existence of the “E” and “L” layers can be conﬁrmed using standard linguistic methodology. Each layer, E and L, when considered separately, is characterizable as a ﬁnite state system, as observed in several non-human species. When the two systems are put together they interact, yielding the unbounded, non-ﬁnite state, hierarchical structure that serves as the hallmark of full-ﬂedged human language syntax. In this way, we account for the appearance of a novel function, language, within a conventional Darwinian framework, along with its apparently unique emergence in a single species.","accessed":{"date-parts":[["2023",8,30]]},"author":[{"family":"Miyagawa","given":"Shigeru"},{"family":"Berwick","given":"Robert C."},{"family":"Okanoya","given":"Kazuo"}],"citation-key":"miyagawa_etal13","container-title":"Frontiers in Psychology","container-title-short":"Front. Psychology","DOI":"10.3389/fpsyg.2013.00071","ISSN":"1664-1078","issued":{"date-parts":[["2013"]]},"language":"en","source":"DOI.org (Crossref)","title":"The emergence of hierarchical structure in human language","type":"article-journal","URL":"http://journal.frontiersin.org/article/10.3389/fpsyg.2013.00071/abstract","volume":"4"},
  {"id":"moritaMeasuringContextDependency2021","abstract":"Context dependency is a key feature in sequential structures of human language, which requires reference between words far apart in the produced sequence. Assessing how long the past context has an effect on the current status provides crucial information to understand the mechanism for complex sequential behaviors. Birdsongs serve as a representative model for studying the context dependency in sequential signals produced by non-human animals, while previous reports were upper-bounded by methodological limitations. Here, we newly estimated the context dependency in birdsongs in a more scalable way using a modern neural-network-based language model whose accessible context length is sufficiently long. The detected context dependency was beyond the order of traditional Markovian models of birdsong, but was consistent with previous experimental investigations. We also studied the relation between the assumed/auto-detected vocabulary size of birdsong (i.e., fine- vs. coarse-grained syllable classifications) and the context dependency. It turned out that the larger vocabulary (or the more fine-grained classification) is assumed, the shorter context dependency is detected.","author":[{"family":"Morita","given":"Takashi"},{"family":"Koda","given":"Hiroki"},{"family":"Okanoya","given":"Kazuo"},{"family":"Tachibana","given":"Ryosuke O."}],"citation-key":"moritaMeasuringContextDependency2021","container-title":"PLOS Computational Biology","DOI":"10.1371/journal.pcbi.1009707","ISBN":"1111111111","issue":"12","issued":{"date-parts":[["2021"]]},"page":"e1009707","title":"Measuring context dependency in birdsong using artificial neural networks","type":"article-journal","URL":"http://dx.doi.org/10.1371/journal.pcbi.1009707","volume":"17"},
  {"id":"motamedi_etal19","abstract":"Recent work on emerging sign languages provides evidence for how key properties of linguistic systems are created. Here we use laboratory experiments to investigate the contribution of two specific mechanisms—interaction and transmission—to the emergence of a manual communication system in silent gesturers. We show that the combined effects of these mechanisms, rather than either alone, maintain communicative efficiency, and lead to a gradual increase of regularity and systematic structure. The gestures initially produced by participants are unsystematic and resemble pantomime, but come to develop key language-like properties similar to those documented in newly emerging sign systems.","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Motamedi","given":"Yasamin"},{"family":"Schouwstra","given":"Marieke"},{"family":"Smith","given":"Kenny"},{"family":"Culbertson","given":"Jennifer"},{"family":"Kirby","given":"Simon"}],"citation-key":"motamedi_etal19","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2019.05.001","ISSN":"00100277","issued":{"date-parts":[["2019",11]]},"language":"en","page":"103964","source":"DOI.org (Crossref)","title":"Evolving artificial sign languages in the lab: From improvised gesture to systematic sign","title-short":"Evolving artificial sign languages in the lab","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027719301234","volume":"192"},
  {"id":"motter_etal02","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Motter","given":"Adilson E."},{"family":"De Moura","given":"Alessandro P. S."},{"family":"Lai","given":"Ying-Cheng"},{"family":"Dasgupta","given":"Partha"}],"citation-key":"motter_etal02","container-title":"Physical Review E","container-title-short":"Phys. Rev. E","DOI":"10.1103/PhysRevE.65.065102","ISSN":"1063-651X, 1095-3787","issue":"6","issued":{"date-parts":[["2002",6,25]]},"language":"en","page":"065102","source":"DOI.org (Crossref)","title":"Topology of the conceptual network of language","type":"article-journal","URL":"https://link.aps.org/doi/10.1103/PhysRevE.65.065102","volume":"65"},
  {"id":"mouillot_lepretre00","abstract":"Quantifying a relative abundance distribution based on the sampling of a set of species is a widespread problem in ecology. A number of diversity indices have been proposed and used in numerous works in spite of a lack of statistical characteristics and tests of comparison. The relative abundance distribution can also be described using rank-frequency diagrams but ﬁtting these diagrams to mathematical models such as the Zipf-Mandelbrot model remains problematic. Strong correlation between the Zipf-Mandelbrot model parameters prevent their estimation by optimization algorithm. In light of this, new indices of sampled communities are introduced here. These indices are two linear regression slopes estimated from rank-frequency diagrams. The numerous statistical studies that have been carried out on linear regression models are used to compare sampled communities. These new indices possess characteristic properties with an ecological meaning. Correlations between these indices, the Zipf-Mandelbrot model parameters and an evenness diversity index are examined. An ecological application is made using entomological data as an example. This example consists of a transect from the edge of a pond to a dry forest along which 60,000 insects were sampled from six different sampling stations. Using the new indices described here, station C, located at the edge of that area subject to inﬂuence from the pond, is differentiated from the other stations. This station would seem to present the lowest degree of niche diversity and the lowest evenness, and recent observations conﬁrm the deterioration of this station.","author":[{"family":"Mouillot","given":"David"},{"family":"Lepretre","given":"Alain"}],"citation-key":"mouillot_lepretre00","container-title":"Environmental Monitoring and Assessment","DOI":"10.1023/A:1006297211561","issued":{"date-parts":[["2000"]]},"language":"en","page":"279-295","source":"Zotero","title":"Introduction of relative abundance distribution (RAD) indices, estimated from the rank-frequency diagrams (RFD), to assess changes in community diversity","type":"article-journal","volume":"63"},
  {"id":"muldoonSmallworldPropensityWeighted2016","abstract":"Abstract\n            \n              Quantitative descriptions of network structure can provide fundamental insights into the function of interconnected complex systems. Small-world structure, diagnosed by high local clustering yet short average path length between any two nodes, promotes information flow in coupled systems, a key function that can differ across conditions or between groups. However, current techniques to quantify small-worldness are density dependent and neglect important features such as the strength of network connections, limiting their application in real-world systems. Here, we address both limitations with a novel metric called the Small-World Propensity (SWP). In its binary instantiation, the SWP provides an unbiased assessment of small-world structure in networks of varying densities. We extend this concept to the case of weighted brain networks by developing (i) a standardized procedure for generating weighted small-world networks, (ii) a weighted extension of the SWP, and (iii) a method for mapping observed brain network data onto the theoretical model. In applying these techniques to compare real-world brain networks, we uncover the surprising fact that the canonical biological small-world network, the\n              C. elegans\n              neuronal network, has strikingly low SWP. These metrics, models, and maps form a coherent toolbox for the assessment and comparison of architectural properties in brain networks.","accessed":{"date-parts":[["2023",5,29]]},"author":[{"family":"Muldoon","given":"Sarah Feldt"},{"family":"Bridgeford","given":"Eric W."},{"family":"Bassett","given":"Danielle S."}],"citation-key":"muldoonSmallworldPropensityWeighted2016","container-title":"Scientific Reports","container-title-short":"Sci Rep","DOI":"10.1038/srep22057","ISSN":"2045-2322","issue":"1","issued":{"date-parts":[["2016",2,25]]},"language":"en","page":"22057","source":"DOI.org (Crossref)","title":"Small-world propensity and weighted brain networks","type":"article-journal","URL":"https://www.nature.com/articles/srep22057","volume":"6"},
  {"id":"Mundinger1975","author":[{"family":"Mundinger","given":"Paul C"}],"citation-key":"Mundinger1975","container-title":"The Condor","DOI":"10.2307/1366088","issue":"4","issued":{"date-parts":[["1975"]]},"page":"407-422","title":"Song dialects and colonization in the house finch, Carpodacus mexicanus, on the east coast","type":"article-journal","URL":"https://doi.org/10.2307/1366088","volume":"77"},
  {"id":"Nolan2004","abstract":"Song has been proposed to function in mate choice, and such a role has been demonstrated experi- mentally in a number of species. We presented captive female house finches, Carpodacus mexicanus, with a choice of two songs, each of which was identical except for a single parameter that had been either accentuated or minimized. To ensure that our playback tapes offered choices within the normal range of variation in house finch song, we recorded wild male finches, then created playback tapes using values for the song parameters under consideration that were above or below the mean for the local population, but within the natural range of variation. We presented females that had not previously mated with choices between songs that (1) were long or short, (2) were given at fast or slow rates, and (3) included a large or small repertoire of unique song elements. Females showed significant preferences for long songs and for songs presented at a faster rate, but there was no significant preference for large or small repertoires of unique song elements. Song length and rate each seem likely to indicate a male’s energy reserves, and thus could be important sources of information for females choosing mates.","author":[{"family":"Nolan","given":"Paul M"},{"family":"Hill","given":"Geoffrey E"}],"citation-key":"Nolan2004","container-title":"Animal Behaviour","DOI":"10.1016/j.anbehav.2003.03.018","ISBN":"00033472","issue":"3","issued":{"date-parts":[["2004"]]},"page":"403-410","title":"Female choice for song characteristics in the house finch","type":"article-journal","volume":"67"},
  {"id":"nolle_etal18","abstract":"Where does linguistic structure come from? We suggest that systematicity in language evolves adaptively in response to environmental and contextual aﬀordances associated with the practice of communication itself. In two experiments, we used a silent gesture referential game paradigm to investigate environmental and social factors promoting the propagation of systematicity in a novel communication system. We found that structure in the emerging communication systems evolve contingent on structural properties of the environment. More speciﬁcally, interlocutors spontaneously relied on structural features of the referent stimuli they communicated about to motivate systematic aspects of the evolving communication system even when idiosyncratic iconic strategies were equally aﬀorded. Furthermore, we found systematicity to be promoted by the nature of the referent environment. When the referent environment was open and unstable, analytic systematic strategies were more likely to emerge compared to stimulus environments with a closed set of referents. Lastly, we found that displacement of communication promoted systematicity. That is, when interlocutors had to communicate about items not immediately present in the moment of communication, they were more likely to evolve systematic solutions, supposedly due to working memory advantages. Together, our ﬁndings provide experimental evidence for the idea that linguistic structure evolves adaptively from contextually situated language use.","accessed":{"date-parts":[["2023",8,29]]},"author":[{"family":"Nölle","given":"Jonas"},{"family":"Staib","given":"Marlene"},{"family":"Fusaroli","given":"Riccardo"},{"family":"Tylén","given":"Kristian"}],"citation-key":"nolle_etal18","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2018.08.014","ISSN":"00100277","issued":{"date-parts":[["2018",12]]},"language":"en","page":"93-104","source":"DOI.org (Crossref)","title":"The emergence of systematicity: How environmental and communicative factors shape a novel communication system","title-short":"The emergence of systematicity","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027718302208","volume":"181"},
  {"id":"petrini_etal23","abstract":"Zipf's law of abbreviation, namely the tendency of more frequent words to be shorter, has been viewed as a manifestation of compression, i.e. the minimization of the length of forms -- a universal principle of natural communication. Although the claim that languages are optimized has become trendy, attempts to measure the degree of optimization of languages have been rather scarce. Here we present two optimality scores that are dualy normalized, namely, they are normalized with respect to both the minimum and the random baseline. We analyze the theoretical and statistical pros and cons of these and other scores. Harnessing the best score, we quantify for the first time the degree of optimality of word lengths in languages. This indicates that languages are optimized to 62 or 67 percent on average (depending on the source) when word lengths are measured in characters, and to 65 percent on average when word lengths are measured in time. In general, spoken word durations are more optimized than written word lengths in characters. Our work paves the way to measure the degree of optimality of the vocalizations or gestures of other species, and to compare them against written, spoken, or signed human languages.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Petrini","given":"Sonia"},{"family":"Casas-i-Muñoz","given":"Antoni"},{"family":"Cluet-i-Martinell","given":"Jordi"},{"family":"Wang","given":"Mengxue"},{"family":"Bentz","given":"Christian"},{"family":"Ferrer-i-Cancho","given":"Ramon"}],"citation-key":"petrini_etal23","DOI":"10.48550/arXiv.2208.10384","issued":{"date-parts":[["2023",4,5]]},"language":"en","number":"arXiv:2208.10384","publisher":"arXiv","source":"arXiv.org","title":"The optimality of word lengths. Theoretical foundations and an empirical study","type":"article","URL":"http://arxiv.org/abs/2208.10384"},
  {"id":"piantadosi14","abstract":"The frequency distribution of words has been a key object of study in statistical linguistics for the past 70 years. This distribution approximately follows a simple mathematical form known as Zipf ’ s law. This article first shows that human language has a highly complex, reliable structure in the frequency distribution over and above this classic law, although prior data visualization methods have obscured this fact. A number of empirical phenomena related to word frequencies are then reviewed. These facts are chosen to be informative about the mechanisms giving rise to Zipf’s law and are then used to evaluate many of the theoretical explanations of Zipf’s law in language. No prior account straightforwardly explains all the basic facts or is supported with independent evaluation of its underlying assumptions. To make progress at understanding why language obeys Zipf’s law, studies must seek evidence beyond the law itself, testing assumptions and evaluating novel predictions with new, independent data.","accessed":{"date-parts":[["2023",8,3]]},"author":[{"family":"Piantadosi","given":"Steven T."}],"citation-key":"piantadosi14","container-title":"Psychonomic bulletin & review","container-title-short":"Psychon Bull Rev","DOI":"10.3758/s13423-014-0585-6","ISSN":"1069-9384","issue":"5","issued":{"date-parts":[["2014",10]]},"page":"1112-1130","PMCID":"PMC4176592","PMID":"24664880","source":"PubMed Central","title":"Zipf’s word frequency law in natural language: A critical review and future directions","title-short":"Zipf’s word frequency law in natural language","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4176592/","volume":"21"},
  {"id":"podosFinescaleBroadlyApplicable2016","author":[{"family":"Podos","given":"Jeffrey"},{"family":"Moseley","given":"Dana L"},{"family":"Goodwin","given":"Sarah E"},{"family":"McClure","given":"Jesse"},{"family":"Taft","given":"Benjamin N"},{"family":"Strauss","given":"Amy V H"},{"family":"Rega-Brodsky","given":"Christine"},{"family":"Lahti","given":"David C"}],"citation-key":"podosFinescaleBroadlyApplicable2016","container-title":"Animal Behaviour","DOI":"10.1016/j.anbehav.2016.03.036","ISBN":"00033472","issued":{"date-parts":[["2016"]]},"page":"203-212","title":"A fine-scale, broadly applicable index of vocal performance: frequency excursion","type":"article-journal","volume":"116"},
  {"id":"pothos_juola07","accessed":{"date-parts":[["2023",8,10]]},"author":[{"family":"Pothos","given":"Emmanuel M."},{"family":"Juola","given":"Patrick"}],"citation-key":"pothos_juola07","container-title":"British Journal of Psychology","DOI":"10.1348/000712606X122760","ISSN":"00071269","issue":"2","issued":{"date-parts":[["2007",5]]},"language":"en","page":"291-304","source":"DOI.org (Crossref)","title":"Characterizing linguistic structure with mutual information","type":"article-journal","URL":"http://doi.wiley.com/10.1348/000712606X122760","volume":"98"},
  {"id":"Ratanamahatana2005","author":[{"family":"Ratanamahatana","given":"Chotirat Ann"},{"family":"Keogh","given":"Eamonn"}],"citation-key":"Ratanamahatana2005","container-title":"Proceedings of the 2005 SIAM International Conference on Data Mining","DOI":"10.1137/1.9781611972757.50","issued":{"date-parts":[["2005"]]},"page":"506-510","title":"Three myths about dynamic time warping data mining","type":"paper-conference"},
  {"id":"raviv_etal19","abstract":"Experimental work in the field of language evolution has shown that novel signal systems become more structured over time. In a recent paper, Kirby, Tamariz, Cornish, and Smith (2015) argued that compositional languages can emerge only when languages are transmitted across multiple generations. In the current paper, we show that compositional languages can emerge in a closed community within a single generation. We conducted a communication experiment in which we tested the emergence of linguistic structure in different micro-societies of four participants, who interacted in alternating dyads using an artificial language to refer to novel meanings. Importantly, the communication included two real-world aspects of language acquisition and use, which introduce compressibility pressures: (a) multiple interaction partners and (b) an expanding meaning space. Our results show that languages become significantly more structured over time, with participants converging on shared, stable, and compositional lexicons. These findings indicate that new learners are not necessary for the formation of linguistic structure within a community, and have implications for related fields such as developing sign languages and creoles.","accessed":{"date-parts":[["2023",8,29]]},"author":[{"family":"Raviv","given":"Limor"},{"family":"Meyer","given":"Antje"},{"family":"Lev-Ari","given":"Shiri"}],"citation-key":"raviv_etal19","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2018.09.010","ISSN":"00100277","issued":{"date-parts":[["2019",1]]},"language":"en","page":"151-164","source":"DOI.org (Crossref)","title":"Compositional structure can emerge without generational transmission","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027718302464","volume":"182"},
  {"id":"raviv_etal21","abstract":"Cross-linguistic differences in morphological complexity could have important consequences for language learning. Specifically, it is often assumed that languages with more regular, compositional, and transparent grammars are easier to learn by both children and adults. Moreover, it has been shown that such grammars are more likely to evolve in bigger communities. Together, this suggests that some languages are acquired faster than others, and that this advantage can be traced back to community size and to the degree of systematicity in the language. However, the causal relationship between systematic linguistic structure and language learnability has not been formally tested, despite its potential importance for theories on language evolution, second language learning, and the origin of linguistic diversity. In this pre-registered study, we experimentally tested the effects of community size and systematic structure on adult language learning. We compared the acquisition of different yet comparable artificial languages that were created by big or small groups in a previous communication experiment, which varied in their degree of systematic linguistic structure. We asked (a) whether more structured languages were easier to learn; and (b) whether languages created by the bigger groups were easier to learn. We found that highly systematic languages were learned faster and more accurately by adults, but that the relationship between language learnability and linguistic structure was typically non-linear: high systematicity was advantageous for learning, but learners did not benefit from partly or semistructured languages. Community size did not affect learnability: languages that evolved in big and small groups were equally learnable, and there was no addi­ tional advantage for languages created by bigger groups beyond their degree of systematic structure. Furthermore, our results suggested that predictability is an important advantage of systematic structure: participants who learned more structured languages were better at generalizing these languages to new, unfamiliar meanings, and different participants who learned the same more structured languages were more likely to produce similar labels. That is, systematic structure may allow speakers to converge effortlessly, such that strangers can immediately understand each other.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Raviv","given":"Limor"},{"family":"De Heer Kloots","given":"Marianne"},{"family":"Meyer","given":"Antje"}],"citation-key":"raviv_etal21","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2021.104620","ISSN":"00100277","issued":{"date-parts":[["2021",5]]},"language":"en","page":"104620","source":"DOI.org (Crossref)","title":"What makes a language easy to learn? A preregistered study on how systematic structure and community size affect language learnability","title-short":"What makes a language easy to learn?","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027721000391","volume":"210"},
  {"id":"rivera_etal23","abstract":"Abstract\n            \n              Birdsong is a longstanding model system for studying evolution and biodiversity. Here, we collected and analyzed high quality song recordings from seven species in the family\n              Estrildidae\n              . We measured the acoustic features of syllables and then used dimensionality reduction and machine learning classifiers to identify features that accurately assigned syllables to species. Species differences were captured by the first 3 principal components, corresponding to basic frequency, power distribution, and spectrotemporal features. We then identified the measured features underlying classification accuracy. We found that fundamental frequency, mean frequency, spectral flatness, and syllable duration were the most informative features for species identification. Next, we tested whether specific acoustic features of species’ songs predicted phylogenetic distance. We found significant phylogenetic signal in syllable frequency features, but not in power distribution or spectrotemporal features. Results suggest that frequency features are more constrained by species’ genetics than are other features, and are the best signal features for identifying species from song recordings. The absence of phylogenetic signal in power distribution and spectrotemporal features suggests that these song features are labile, reflecting learning processes and individual recognition.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Rivera","given":"Moises"},{"family":"Edwards","given":"Jacob A."},{"family":"Hauber","given":"Mark E."},{"family":"Woolley","given":"Sarah M. N."}],"citation-key":"rivera_etal23","container-title":"Scientific Reports","container-title-short":"Sci Rep","DOI":"10.1038/s41598-023-33825-5","ISSN":"2045-2322","issue":"1","issued":{"date-parts":[["2023",5,1]]},"language":"en","page":"7076","source":"DOI.org (Crossref)","title":"Machine learning and statistical classification of birdsong link vocal acoustic features with phylogeny","type":"article-journal","URL":"https://www.nature.com/articles/s41598-023-33825-5","volume":"13"},
  {"id":"robertsHowCommunicationChanges2015","abstract":"Communication systems are exposed to two different pressures: a pressure for transmission efficiency, such that messages are simple to produce and perceive, and a pressure for referential efficiency, such that messages are easy to understand with their intended meaning. A solution to the first pressure is combinatoriality - the recombination of a few basic meaningless forms to express an infinite number of meanings. A solution to the second is iconicity - the use of forms that resemble what they refer to. These two solutions appear to be incompatible with each other, as iconic forms are ill-suited for use as meaningless combinatorial units. Furthermore, in the early stages of a communication system, when basic referential forms are in the process of being established, the pressure for referential efficiency is likely to be particularly strong, which may lead it to trump the pressure for transmission efficiency. This means that, where iconicity is available as a strategy, it is likely to impede the emergence of combinatoriality. Although this hypothesis seems consistent with some observations of natural language, it was unclear until recently how it could be soundly tested. This has changed thanks to the development of a line of research, known as Experimental Semiotics, in which participants construct novel communication systems in the laboratory using an unfamiliar medium. We conducted an Experimental Semiotic study in which we manipulated the opportunity for iconicity by varying the kind of referents to be communicated, while keeping the communication medium constant. We then measured the combinatoriality and transmission efficiency of the communication systems. We found that, where iconicity was available, it provided scaffolding for the construction of communication systems and was overwhelmingly adopted. Where it was not available, however, the resulting communication systems were more combinatorial and their forms more efficient to produce. This study enriches our understanding of the fundamental design principles of human communication and contributes tools to enrich it further.","author":[{"family":"Roberts","given":"Gareth"},{"family":"Lewandowski","given":"Jirka"},{"family":"Galantucci","given":"Bruno"}],"citation-key":"robertsHowCommunicationChanges2015","container-title":"Cognition","DOI":"10.1016/j.cognition.2015.04.001","ISSN":"18737838","issued":{"date-parts":[["2015"]]},"page":"52-66","PMID":"25919085","publisher":"Elsevier B.V.","title":"How communication changes when we cannot mime the world: experimental evidence for the effect of iconicity on combinatoriality","type":"article-journal","volume":"141"},
  {"id":"roeske_etal18","abstract":"Music is thought to engage its listeners by driving feelings of surprise, tension, and relief through a dynamic mixture of predictable and unpredictable patterns, a property summarized here as \"expressiveness\". Birdsong shares with music the goal to attract its listeners' attention and might use similar strategies to achieve this. We here tested a thrush nightingale's (Luscinia luscinia) rhythm, as represented by song amplitude envelope (containing information on note timing, duration, and intensity), for evidence of expressiveness. We used multifractal analysis, which is designed to detect in a signal dynamic fluctuations between predictable and unpredictable states on multiple timescales (e.g. notes, subphrases, songs). Results show that rhythm is strongly multifractal, indicating fluctuations between predictable and unpredictable patterns. Moreover, comparing original songs with re-synthesized songs that lack all subtle deviations from the \"standard\" note envelopes, we find that deviations in note intensity and duration significantly contributed to multifractality. This suggests that birdsong is more dynamic due to subtle note timing patterns, often similar to musical operations like accelerando or crescendo. While different sources of these dynamics are conceivable, this study shows that multi-timescale rhythm fluctuations can be detected in birdsong, paving the path to studying mechanisms and function behind such patterns.","author":[{"family":"Roeske","given":"Tina C."},{"family":"Kelty-Stephen","given":"Damian"},{"family":"Wallot","given":"Sebastian"}],"citation-key":"roeske_etal18","container-title":"Scientific Reports","DOI":"10.1038/s41598-018-22933-2","ISSN":"20452322","issue":"1","issued":{"date-parts":[["2018"]]},"page":"1-15","PMID":"29545558","publisher":"Springer US","title":"Multifractal analysis reveals music-like dynamic structure in songbird rhythms","type":"article-journal","URL":"http://dx.doi.org/10.1038/s41598-018-22933-2","volume":"8"},
  {"id":"roeskeCategoricalRhythmsAre2020","abstract":"Rhythm is a prominent feature of music. Of the infinite possible ways of organizing events in time, musical rhythms are almost always distributed categorically. Such categories can facilitate the transmission of culture—a feature that songbirds and humans share. We compared rhythms of live performances of music to rhythms of wild thrush nightingale and domestic zebra finch songs. In nightingales, but not in zebra finches, we found universal rhythm categories, with patterns that were surprisingly similar to those of music. Isochronous 1:1 rhythms were similarly common. Interestingly, a bias toward small ratios (around 1:2 to 1:3), which is highly abundant in music, was observed also in thrush nightingale songs. Within that range, however, there was no statistically significant bias toward exact integer ratios (1:2 or 1:3) in the birds. High-ratio rhythms were abundant in the nightingale song and are structurally similar to fusion rhythms (ornaments) in music. In both species, preferred rhythms remained invariant over extended ranges of tempos, indicating natural categories. The number of rhythm categories decreased at higher tempos, with a threshold above which rhythm became highly stereotyped. In thrush nightingales, this threshold occurred at a tempo twice faster than in humans, indicating weaker structural constraints and a remarkable motor proficiency. Together, the results suggest that categorical rhythms reflect similar constraints on learning motor skills across species. The saliency of categorical rhythms across humans and thrush nightingales suggests that they promote, or emerge from, the cultural transmission of learned vocalizations. Video Abstract: [Figure presented] Comparing rhythm between music and birdsong, Roeske, Tchernichovski et al. report that some songbirds’ rhythms are categorical, like musical rhythms across cultures. Across species and cultures, the categories overlap but are not identical. Categorical rhythm may promote (or emerge from) cultural transmission of learned vocalizations.","author":[{"family":"Roeske","given":"Tina C."},{"family":"Tchernichovski","given":"Ofer"},{"family":"Poeppel","given":"David"},{"family":"Jacoby","given":"Nori"}],"citation-key":"roeskeCategoricalRhythmsAre2020","container-title":"Current Biology","DOI":"10.1016/j.cub.2020.06.072","ISSN":"18790445","issue":"18","issued":{"date-parts":[["2020"]]},"page":"3544-3555.e6","PMID":"32707062","publisher":"Elsevier Ltd.","title":"Categorical Rhythms Are Shared between Songbirds and Humans","type":"article-journal","URL":"https://doi.org/10.1016/j.cub.2020.06.072","volume":"30"},
  {"id":"Roginek2018","author":[{"family":"Roginek","given":"Eric W."}],"citation-key":"Roginek2018","issued":{"date-parts":[["2018"]]},"number-of-pages":"1-51","publisher":"Queens College","title":"Spatial variation of house finch (Haemorhous mexicanus) song along the American Southwest coast","type":"thesis"},
  {"id":"rohrmeier_etal15","author":[{"family":"Rohrmeier","given":"Martin"},{"family":"Zuidema","given":"Willem"},{"family":"Wiggins","given":"Geraint A."},{"family":"Scharff","given":"Constance"}],"citation-key":"rohrmeier_etal15","container-title":"Philos Trans R Soc B","DOI":"10.1098/rstb.2014.0097","issued":{"date-parts":[["2015"]]},"page":"20140097","title":"Principles of structure building in music, language and animal song","type":"article-journal","volume":"370"},
  {"id":"rothenberg_etal14","abstract":"Songbirds spend much of their time learning, producing, and listening to complex vocal sequences we call songs. Songs are learned via cultural transmission, and singing, usually by males, has a strong impact on the behavioral state of the listeners, often promoting affiliation, pair bonding, or aggression. What is it in the acoustic structure of birdsong that makes it such a potent stimulus? We suggest that birdsong potency might be driven by principles similar to those that make music so effective in inducing emotional responses in humans: a combination of rhythms and pitches-and the transitions between acoustic states-affecting emotions through creating expectations, anticipations, tension, tension release, or surprise. Here we propose a framework for investigating how birdsong, like human music, employs the above \"musical\" features to affect the emotions of avian listeners. First we analyze songs of thrush nightingales (. Luscinia luscinia) by examining their trajectories in terms of transitions in rhythm and pitch. These transitions show gradual escalations and graceful modifications, which are comparable to some aspects of human musicality. We then explore the feasibility of stripping such putative musical features from the songs and testing how this might affect patterns of auditory responses, focusing on fMRI data in songbirds that demonstrate the feasibility of such approaches. Finally, we explore ideas for investigating whether musical features of birdsong activate avian brains and affect avian behavior in manners comparable to music's effects on humans. In conclusion, we suggest that birdsong research would benefit from current advances in music theory by attempting to identify structures that are designed to elicit listeners' emotions and then testing for such effects experimentally. Birdsong research that takes into account the striking complexity of song structure in light of its more immediate function - to affect behavioral state in listeners - could provide a useful animal model for studying basic principles of music neuroscience in a system that is very accessible for investigation, and where developmental auditory and social experience can be tightly controlled. © 2013 Elsevier B.V.","author":[{"family":"Rothenberg","given":"David"},{"family":"Roeske","given":"Tina C."},{"family":"Voss","given":"Henning U."},{"family":"Naguib","given":"Marc"},{"family":"Tchernichovski","given":"Ofer"}],"citation-key":"rothenberg_etal14","container-title":"Hearing Research","DOI":"10.1016/j.heares.2013.08.016","ISSN":"18785891","issue":"September","issued":{"date-parts":[["2014"]]},"page":"71-83","PMID":"24036130","publisher":"Elsevier B.V","title":"Investigation of musicality in birdsong","type":"article-journal","URL":"http://dx.doi.org/10.1016/j.heares.2013.08.016","volume":"308"},
  {"id":"safryghinVariableExpressionLinguistic2022","author":[{"family":"Safryghin","given":"Alexandra"},{"family":"Cross","given":"Catharine"},{"family":"Fallon","given":"Brittany"},{"family":"Heesen","given":"Raphaela"},{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Hobaiter","given":"Catherine"}],"citation-key":"safryghinVariableExpressionLinguistic2022","container-title":"Royal Society Open Science","DOI":"10.1098/rsos.220849","issued":{"date-parts":[["2022"]]},"language":"en","page":"220849","source":"Zotero","title":"Variable expression of linguistic laws in ape gesture: a case study from chimpanzee sexual solicitation","type":"article-journal","URL":"https://doi.org/10.1098/rsos.220849","volume":"9"},
  {"id":"sainburg_etal20","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Sainburg","given":"Tim"},{"family":"Thielk","given":"Marvin"},{"family":"Gentner","given":"Timothy Q."}],"citation-key":"sainburg_etal20","container-title":"PLOS Computational Biology","container-title-short":"PLoS Comput Biol","DOI":"10.1371/journal.pcbi.1008228","editor":[{"family":"Theunissen","given":"Frédéric E."}],"ISSN":"1553-7358","issue":"10","issued":{"date-parts":[["2020",10,15]]},"language":"en","page":"e1008228","source":"DOI.org (Crossref)","title":"Finding, visualizing, and quantifying latent structure across diverse animal vocal repertoires","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pcbi.1008228","volume":"16"},
  {"id":"sainburg_etal22","author":[{"family":"Sainburg","given":"Tim"},{"family":"Mai","given":"Anna"},{"family":"Gentner","given":"Timothy Q"}],"citation-key":"sainburg_etal22","container-title":"Proceedings of the Royal Society B: Biological Sciences","DOI":"10.1098/rspb.2021.2657","issued":{"date-parts":[["2022"]]},"page":"20212657","title":"Long-range sequential dependencies precede complex syntactic production in language acquisition","type":"article-journal","URL":"https://doi.org/10.1098/rspb.2021.2657","volume":"289"},
  {"id":"sainburgParallelsSequentialOrganization2019","abstract":"Abstract\n            Human speech possesses a rich hierarchical structure that allows for meaning to be altered by words spaced far apart in time. Conversely, the sequential structure of nonhuman communication is thought to follow non-hierarchical Markovian dynamics operating over only short distances. Here, we show that human speech and birdsong share a similar sequential structure indicative of both hierarchical and Markovian organization. We analyze the sequential dynamics of song from multiple songbird species and speech from multiple languages by modeling the information content of signals as a function of the sequential distance between vocal elements. Across short sequence-distances, an exponential decay dominates the information in speech and birdsong, consistent with underlying Markovian processes. At longer sequence-distances, the decay in information follows a power law, consistent with underlying hierarchical processes. Thus, the sequential organization of acoustic elements in two learned vocal communication signals (speech and birdsong) shows functionally equivalent dynamics, governed by similar processes.","accessed":{"date-parts":[["2023",4,17]]},"author":[{"family":"Sainburg","given":"Tim"},{"family":"Theilman","given":"Brad"},{"family":"Thielk","given":"Marvin"},{"family":"Gentner","given":"Timothy Q."}],"citation-key":"sainburgParallelsSequentialOrganization2019","container-title":"Nature Communications","container-title-short":"Nat Commun","DOI":"10.1038/s41467-019-11605-y","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[["2019",8,12]]},"language":"en","page":"3636","source":"DOI.org (Crossref)","title":"Parallels in the sequential organization of birdsong and human speech","type":"article-journal","URL":"https://www.nature.com/articles/s41467-019-11605-y","volume":"10"},
  {"id":"salge_etal15","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Salge","given":"Christoph"},{"family":"Ay","given":"Nihat"},{"family":"Polani","given":"Daniel"},{"family":"Prokopenko","given":"Mikhail"}],"citation-key":"salge_etal15","container-title":"PLOS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0139475","editor":[{"family":"Smalheiser","given":"Neil R."}],"ISSN":"1932-6203","issue":"10","issued":{"date-parts":[["2015",10,1]]},"language":"en","page":"e0139475","source":"DOI.org (Crossref)","title":"Zipf’s law: balancing signal usage cost and communication efficiency","title-short":"Zipf’s Law","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0139475","volume":"10"},
  {"id":"SardaEspinosa2019","author":[{"family":"Sardá-Espinosa","given":"Alexis"}],"citation-key":"SardaEspinosa2019","container-title":"The R Journal","DOI":"10.32614/RJ-2019-023","issue":"1","issued":{"date-parts":[["2019"]]},"page":"22–43","title":"Time-series clustering in R using the dtwclust package","type":"article-journal","URL":"https://doi.org/10.32614/RJ-2019-023","volume":"11"},
  {"id":"sasahara_etal12","abstract":"Bird songs are acoustic communication signals primarily used in male-male aggression and in male-female attraction. These are often monotonous patterns composed of a few phrases, yet some birds have extremely complex songs with a large phrase repertoire, organized in non-random fashion with discernible patterns. Since structure is typically associated with function, the structures of complex bird songs provide important clues to the evolution of animal communication systems. Here we propose an efficient network-based approach to explore structural design principles of complex bird songs, in which the song networks–transition relationships among different phrases and the related structural measures–are employed. We demonstrate how this approach works with an example using California Thrasher songs, which are sequences of highly varied phrases delivered in succession over several minutes. These songs display two distinct features: a large phrase repertoire with a ‘small-world’ architecture, in which subsets of phrases are highly grouped and linked with a short average path length; and a balanced transition diversity amongst phrases, in which deterministic and nondeterministic transition patterns are moderately mixed. We explore the robustness of this approach with variations in sample size and the amount of noise. Our approach enables a more quantitative study of global and local structural properties of complex bird songs than has been possible to date.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Sasahara","given":"Kazutoshi"},{"family":"Cody","given":"Martin L."},{"family":"Cohen","given":"David"},{"family":"Taylor","given":"Charles E."}],"citation-key":"sasahara_etal12","container-title":"PLoS ONE","container-title-short":"PLoS ONE","DOI":"10.1371/journal.pone.0044436","editor":[{"family":"Troyer","given":"Todd W."}],"ISSN":"1932-6203","issue":"9","issued":{"date-parts":[["2012",9,24]]},"language":"en","page":"e44436","source":"DOI.org (Crossref)","title":"Structural design principles of complex bird songs: a network-based approach","title-short":"Structural Design Principles of Complex Bird Songs","type":"article-journal","URL":"https://dx.plos.org/10.1371/journal.pone.0044436","volume":"7"},
  {"id":"schrimpf_etal21","abstract":"Significance\n            Language is a quintessentially human ability. Research has long probed the functional architecture of language in the mind and brain using diverse neuroimaging, behavioral, and computational modeling approaches. However, adequate neurally-mechanistic accounts of how meaning might be extracted from language are sorely lacking. Here, we report a first step toward addressing this gap by connecting recent artificial neural networks from machine learning to human recordings during language processing. We find that the most powerful models predict neural and behavioral responses across different datasets up to noise levels. Models that perform better at predicting the next word in a sequence also better predict brain measurements—providing computationally explicit evidence that predictive processing fundamentally shapes the language comprehension mechanisms in the brain.\n          , \n            The neuroscience of perception has recently been revolutionized with an integrative modeling approach in which computation, brain function, and behavior are linked across many datasets and many computational models. By revealing trends across models, this approach yields novel insights into cognitive and neural mechanisms in the target domain. We here present a systematic study taking this approach to higher-level cognition: human language processing, our species’ signature cognitive skill. We find that the most powerful “transformer” models predict nearly 100% of explainable variance in neural responses to sentences and generalize across different datasets and imaging modalities (functional MRI and electrocorticography). Models’ neural fits (“brain score”) and fits to behavioral responses are both strongly correlated with model accuracy on the next-word prediction task (but not other language tasks). Model architecture appears to substantially contribute to neural fit. These results provide computationally explicit evidence that predictive processing fundamentally shapes the language comprehension mechanisms in the human brain.","accessed":{"date-parts":[["2023",8,10]]},"author":[{"family":"Schrimpf","given":"Martin"},{"family":"Blank","given":"Idan Asher"},{"family":"Tuckute","given":"Greta"},{"family":"Kauf","given":"Carina"},{"family":"Hosseini","given":"Eghbal A."},{"family":"Kanwisher","given":"Nancy"},{"family":"Tenenbaum","given":"Joshua B."},{"family":"Fedorenko","given":"Evelina"}],"citation-key":"schrimpf_etal21","container-title":"Proceedings of the National Academy of Sciences","container-title-short":"Proc. Natl. Acad. Sci. U.S.A.","DOI":"10.1073/pnas.2105646118","ISSN":"0027-8424, 1091-6490","issue":"45","issued":{"date-parts":[["2021",11,9]]},"language":"en","page":"e2105646118","source":"DOI.org (Crossref)","title":"The neural architecture of language: Integrative modeling converges on predictive processing","title-short":"The neural architecture of language","type":"article-journal","URL":"https://pnas.org/doi/full/10.1073/pnas.2105646118","volume":"118"},
  {"id":"searcy_etal22","abstract":"Songbird syntax is generally thought to be simple, in particular lacking long-distance dependencies in which one element affects choice of another occurring considerably later in the sequence. Here, we test for long-distance dependencies in the sequences of songs produced by song sparrows (\n              Melospiza melodia\n              ). Song sparrows sing with eventual variety, repeating each song type in a consecutive series termed a ‘bout'. We show that in switching between song types, song sparrows follow a ‘cycling rule', cycling through their repertoires in close to the minimum possible number of bouts. Song sparrows do not cycle in a set order but rather vary the order of song types from cycle to cycle. Cycling in a variable order strongly implies long-distance dependencies, in which choice of the next type depends on the song types sung over the past cycle, in the range of 9–10 bouts. Song sparrows also follow a ‘bout length rule', whereby the number of repetitions of a song type in a bout is positively associated with the length of the interval until that type recurs. This rule requires even longer distance dependencies that cross one another; such dependencies are characteristic of more complex levels of syntax than previously attributed to non-human animals.","accessed":{"date-parts":[["2023",9,14]]},"author":[{"family":"Searcy","given":"William A."},{"family":"Soha","given":"Jill"},{"family":"Peters","given":"Susan"},{"family":"Nowicki","given":"Stephen"}],"citation-key":"searcy_etal22","container-title":"Proceedings of the Royal Society B: Biological Sciences","container-title-short":"Proc. R. Soc. B.","DOI":"10.1098/rspb.2021.2473","ISSN":"0962-8452, 1471-2954","issue":"1967","issued":{"date-parts":[["2022",1,26]]},"language":"en","page":"20212473","source":"DOI.org (Crossref)","title":"Long-distance dependencies in birdsong syntax","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rspb.2021.2473","volume":"289"},
  {"id":"semple_etal10","abstract":"A key characteristic of human language efficiency is that more frequently used words tend to be shorter in length—the ‘law of brevity’. To date, no test of this relationship between frequency of use and length has been carried out on non-human animal vocal communication. We show here that the vocal repertoire of the Formosan macaque (\n              Macaca cyclopis\n              ) conforms to the pattern predicted by the law of brevity, with an inverse relationship found between call duration and rate of utterance. This finding provides evidence for coding efficiency in the vocal communication system of this species, and indicates commonality in the basic structure of the coding system between human language and vocal communication in this non-human primate.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Semple","given":"Stuart"},{"family":"Hsu","given":"Minna J."},{"family":"Agoramoorthy","given":"Govindasamy"}],"citation-key":"semple_etal10","container-title":"Biology Letters","container-title-short":"Biol. Lett.","DOI":"10.1098/rsbl.2009.1062","ISSN":"1744-9561, 1744-957X","issue":"4","issued":{"date-parts":[["2010",8,23]]},"language":"en","page":"469-471","source":"DOI.org (Crossref)","title":"Efficiency of coding in macaque vocal communication","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rsbl.2009.1062","volume":"6"},
  {"id":"semple_etal22","accessed":{"date-parts":[["2023",8,3]]},"author":[{"family":"Semple","given":"Stuart"},{"family":"Ferrer-i-Cancho","given":"Ramon"},{"family":"Gustison","given":"Morgan L."}],"citation-key":"semple_etal22","container-title":"Trends in Ecology & Evolution","container-title-short":"Trends in Ecology & Evolution","DOI":"10.1016/j.tree.2021.08.012","ISSN":"01695347","issue":"1","issued":{"date-parts":[["2022",1]]},"language":"en","page":"53-66","source":"DOI.org (Crossref)","title":"Linguistic laws in biology","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0169534721002305","volume":"37"},
  {"id":"shannon16","abstract":"Music and speech share many acoustic cues but not all are equally important. For example, harmonic pitch is essential for music but not for speech. When birds communicate is their song more like speech or music? A new study contrasting pitch and spectral patterns shows that birds perceive their song more like humans perceive speech.","author":[{"family":"Shannon","given":"Robert V."}],"citation-key":"shannon16","container-title":"Trends in Cognitive Sciences","DOI":"10.1016/j.tics.2016.02.004","ISSN":"1879307X","issue":"4","issued":{"date-parts":[["2016"]]},"page":"245-247","PMID":"26944220","publisher":"Elsevier Ltd","title":"Is birdsong more like speech or music?","type":"article-journal","URL":"http://dx.doi.org/10.1016/j.tics.2016.02.004","volume":"20"},
  {"id":"shlegeris_etal22","abstract":"Current language models are considered to have sub-human capabilities at natural language tasks like question-answering or writing code. However, language models are not trained to perform well at these tasks, they are trained to accurately predict the next token given previous tokes in tokenized text. It is not clear whether language models are better or worse than humans at next token prediction. To try to answer this question, we performed two distinct experiments to directly compare humans and language models on this front: one measuring top-1 accuracy and the other measuring perplexity. In both experiments, we ﬁnd humans to be consistently worse than even relatively small language models like GPT3-Ada at next-token prediction.","accessed":{"date-parts":[["2023",8,10]]},"author":[{"family":"Shlegeris","given":"Buck"},{"family":"Roger","given":"Fabien"},{"family":"Chan","given":"Lawrence"},{"family":"McLean","given":"Euan"}],"citation-key":"shlegeris_etal22","issued":{"date-parts":[["2022",12,21]]},"language":"en","number":"arXiv:2212.11281","publisher":"arXiv","source":"arXiv.org","title":"Language models are better than humans at next-token prediction","type":"article","URL":"http://arxiv.org/abs/2212.11281"},
  {"id":"simon55","author":[{"family":"Simon","given":"Herbert A."}],"citation-key":"simon55","container-title":"Biometrika","issue":"3/4","issued":{"date-parts":[["1955"]]},"language":"en","page":"425-440","source":"Zotero","title":"On a class of skew distribution functions","type":"article-journal","volume":"42"},
  {"id":"sinclair_etal22","abstract":"Culture can be deﬁned as “group typical behaviour patterns shared by members of a community that rely on socially learned and transmitted information” (Laland and Hoppitt, 2003, p. 151). Once thought to be a distinguishing characteristic of humans relative to other animals (Dean et al., 2014) it is now generally accepted to exist more widely, with especially abundant evidence in non-human primates, cetaceans, and birds (Rendell and Whitehead, 2001; Aplin, 2019; Whiten, 2021). More recently, cumulative cultural evolution (CCE) has taken on this distinguishing role (Henrich, 2015; Laland, 2018). CCE, it is argued, allows humans, uniquely, to ratchet up the complexity or efﬁciency of cultural traits over time. This “ratchet effect” (Tomasello, 1994) gives the capacity to accumulate beneﬁcial modiﬁcations over time beyond the capacities of a single individual (Sasaki and Biro, 2017). Mesoudi and Thornton (2018) deﬁne a core set of criteria for identifying CCE in humans and non-human animals that places emphasis on some performance measure of traits increasing over time. They suggest this emphasis is also pertinent to cultural products in the aesthetic domain, but is this the case? Music, art and dance evolve over time (Savage, 2019), but can we say they gain beneﬁcial modiﬁcations that increase their aesthetic value? Here we bring together perspectives from philosophy, musicology and biology to build a conceptual analysis of this question. We summarise current thinking on cumulative culture and aesthetics across ﬁelds to determine how aesthetic culture ﬁts into the concept of CCE. We argue that this concept is problematic to reconcile with dominant views of aesthetics in philosophical analysis and struggles to characterise aesthetic cultures that evolve over time. We suggest that a tension arises from fundamental differences between cultural evolution in aesthetic and technological domains. Furthermore, this tension contributes to current debates between reconstructive and preservative theories of cultural evolution.","accessed":{"date-parts":[["2023",8,21]]},"author":[{"family":"Sinclair","given":"Natalie C."},{"family":"Ursell","given":"James"},{"family":"South","given":"Alex"},{"family":"Rendell","given":"Luke"}],"citation-key":"sinclair_etal22","container-title":"Frontiers in Psychology","container-title-short":"Front. Psychol.","DOI":"10.3389/fpsyg.2021.663397","ISSN":"1664-1078","issued":{"date-parts":[["2022",2,9]]},"language":"en","page":"663397","source":"DOI.org (Crossref)","title":"From Beethoven to Beyoncé: do changing aesthetic cultures amount to “cumulative cultural evolution?”","title-short":"From Beethoven to Beyoncé","type":"article-journal","URL":"https://www.frontiersin.org/articles/10.3389/fpsyg.2021.663397/full","volume":"12"},
  {"id":"sole_etal10","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Solé","given":"Ricard V."},{"family":"Corominas-Murtra","given":"Bernat"},{"family":"Valverde","given":"Sergi"},{"family":"Steels","given":"Luc"}],"citation-key":"sole_etal10","container-title":"Complexity","container-title-short":"Complexity","DOI":"10.1002/cplx.20305","ISSN":"10762787, 10990526","issued":{"date-parts":[["2010"]]},"language":"en","page":"NA-NA","source":"DOI.org (Crossref)","title":"Language networks: their structure, function, and evolution","title-short":"Language networks","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1002/cplx.20305"},
  {"id":"soma_garamszegi11","accessed":{"date-parts":[["2023",8,25]]},"author":[{"family":"Soma","given":"Masayo"},{"family":"Garamszegi","given":"László Zsolt"}],"citation-key":"soma_garamszegi11","container-title":"Behavioral Ecology","DOI":"10.1093/beheco/arq219","ISSN":"1465-7279, 1045-2249","issue":"2","issued":{"date-parts":[["2011"]]},"language":"en","page":"363-371","source":"DOI.org (Crossref)","title":"Rethinking birdsong evolution: meta-analysis of the relationship between song complexity and reproductive success","title-short":"Rethinking birdsong evolution","type":"article-journal","URL":"https://academic.oup.com/beheco/article-lookup/doi/10.1093/beheco/arq219","volume":"22"},
  {"id":"stanley_etal00","abstract":"This paper is a brief summary of a talk that was designed to address the question of whether two of the pillars of the ÿeld of phase transitions and critical phenomena – scale invariance and universality – can be useful in guiding research on a broad class of complex phenomena. We shall see that while scale invariance has been tested for many years, universality is relatively more rarely discussed. In particular, we shall develop a heuristic argument that serves to make more plausible the universality hypothesis in both thermal critical phenomena and percolation phenomena, and suggest that this argument could be developed into a possible coherent approach to understanding the ubiquity of scale invariance and universality in a wide range of complex systems. c 2000 Elsevier Science B.V. All rights reserved.","accessed":{"date-parts":[["2023",9,5]]},"author":[{"family":"Stanley","given":"H.E"},{"family":"Amaral","given":"L.A.N"},{"family":"Gopikrishnan","given":"P"},{"family":"Ivanov","given":"P.Ch"},{"family":"Keitt","given":"T.H"},{"family":"Plerou","given":"V"}],"citation-key":"stanley_etal00","container-title":"Physica A: Statistical Mechanics and its Applications","container-title-short":"Physica A: Statistical Mechanics and its Applications","DOI":"10.1016/S0378-4371(00)00195-3","ISSN":"03784371","issue":"1-4","issued":{"date-parts":[["2000",6]]},"language":"en","page":"60-68","source":"DOI.org (Crossref)","title":"Scale invariance and universality: organizing principles in complex systems","title-short":"Scale invariance and universality","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0378437100001953","volume":"281"},
  {"id":"stave_etal21","abstract":"Zipf’s Law of Abbreviation and Menzerath’s Law both make predictions about the length of linguistic units, based on corpus frequency and the length of the carrier unit. Each contributes to the efficiency of languages: for Zipf, units are more likely to be reduced when they are highly predictable, due to their frequency; for Menzerath, units are more likely to be reduced when there are more sub-units to contribute to the structural information of the carrier unit. However, it remains unclear how the two laws work together in determining unit length at a given level of linguistic structure. We examine this question regarding the length of morphemes in spoken corpora of nine typologically diverse languages drawn from the DoReCo corpus, showing that Zipf’s Law is a stronger predictor, but that the two laws interact with one another. We also explore how this is affected by specific typological characteristics, such as morphological complexity.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Stave","given":"Matthew"},{"family":"Paschen","given":"Ludger"},{"family":"Pellegrino","given":"François"},{"family":"Seifart","given":"Frank"}],"citation-key":"stave_etal21","container-title":"Linguistics Vanguard","DOI":"10.1515/lingvan-2019-0076","ISSN":"2199-174X","issue":"s3","issued":{"date-parts":[["2021",4,21]]},"language":"en","page":"20190076","source":"DOI.org (Crossref)","title":"Optimization of morpheme length: a cross-linguistic assessment of Zipf’s and Menzerath’s laws","title-short":"Optimization of morpheme length","type":"article-journal","URL":"https://www.degruyter.com/document/doi/10.1515/lingvan-2019-0076/html","volume":"7"},
  {"id":"stepanov_etal23","abstract":"Abstract\n          Bottlenose dolphins’ broadband click vocalizations are well studied in the literature with respect to their echolocation function. Their use for communication among conspecifics has long been speculated, but not conclusively established so far. In this study we categorize dolphins’ click productions into types on the basis of their amplitude contour and analyze the distribution of individual clicks and click sequences against their duration and length. We demonstrate that the repertoire and composition of clicks and click sequences follow three key linguistic laws of efficient communication, namely, Zipf’s rank-frequency law, the law of brevity and Menzerath-Altmann law. Conforming to the rank-frequency law suggests that clicks may form a linguistic code that is subject to selective pressures for unification, on the one hand, and diversification, on the other. Conforming to the other two laws also implies that dolphins use clicks in accord with the compression criterion, or minimization of code length without loss of information. Our results furnish novel evidence for conformity to the linguistic laws in this type of dolphins’ signal and in the realm of animal vocalizations more generally.","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Stepanov","given":"Arthur"},{"family":"Zhivomirov","given":"Hristo"},{"family":"Nedelchev","given":"Ivaylo"},{"family":"Stateva","given":"Penka"}],"citation-key":"stepanov_etal23","DOI":"10.1101/2023.01.11.523588","genre":"preprint","issued":{"date-parts":[["2023",1,11]]},"language":"en","publisher":"Animal Behavior and Cognition","source":"DOI.org (Crossref)","title":"Bottlenose dolphins’ broadband clicks are structured for communication","type":"report","URL":"http://biorxiv.org/lookup/doi/10.1101/2023.01.11.523588"},
  {"id":"steyvers_tenenbaum05","abstract":"We present statistical analyses of the large-scale structure of 3 types of semantic networks: word associations, WordNet, and Roget’s Thesaurus. We show that they have a small-world structure, characterized by sparse connectivity, short average path lengths between words, and strong local clustering. In addition, the distributions of the number of connections follow power laws that indicate a scale-free pattern of connectivity, with most nodes having relatively few connections joined together through a small number of hubs with many connections. These regularities have also been found in certain other complex natural networks, such as the World Wide Web, but they are not consistent with many conventional models of semantic organization, based on inheritance hierarchies, arbitrarily structured networks, or high-dimensional vector spaces. We propose that these structures reflect the mechanisms by which semantic networks grow. We describe a simple model for semantic growth, in which each new word or concept is connected to an existing network by differentiating the connectivity pattern of an existing node. This model generates appropriate small-world statistics and power-law connectivity distributions, and it also suggests one possible mechanistic basis for the effects of learning history variables (age of acquisition, usage frequency) on behavioral performance in semantic processing tasks.","accessed":{"date-parts":[["2023",9,19]]},"author":[{"family":"Steyvers","given":"Mark"},{"family":"Tenenbaum","given":"Joshua B."}],"citation-key":"steyvers_tenenbaum05","container-title":"Cognitive Science","DOI":"10.1207/s15516709cog2901_3","ISSN":"03640213","issue":"1","issued":{"date-parts":[["2005",1,2]]},"language":"en","page":"41-78","source":"DOI.org (Crossref)","title":"The large-scale structure of semantic networks: statistical analyses and a model of semantic growth","title-short":"The Large-Scale Structure of Semantic Networks","type":"article-journal","URL":"http://doi.wiley.com/10.1207/s15516709cog2901_3","volume":"29"},
  {"id":"tamariz_kirby16","accessed":{"date-parts":[["2023",8,30]]},"author":[{"family":"Tamariz","given":"Monica"},{"family":"Kirby","given":"Simon"}],"citation-key":"tamariz_kirby16","container-title":"Current Opinion in Psychology","container-title-short":"Current Opinion in Psychology","DOI":"10.1016/j.copsyc.2015.09.003","ISSN":"2352250X","issued":{"date-parts":[["2016",4]]},"language":"en","page":"37-43","source":"DOI.org (Crossref)","title":"The cultural evolution of language","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S2352250X15002225","volume":"8"},
  {"id":"tanaka-ishii21","abstract":"The Menzerath law is considered to show an aspect of the complexity underlying natural language. This law suggests that, for a linguistic unit, the size (y) of a linguistic construct decreases as the number (x) of constructs in the unit increases. This article investigates this property syntactically, with x as the number of constituents modifying the main predicate of a sentence and y as the size of those constituents in terms of the number of words. Following previous articles that demonstrated that the Menzerath property held for dependency corpora, such as in Czech and Ukrainian, this article ﬁrst examines how well the property applies across languages by using the entire Universal Dependency dataset ver. 2.3, including 76 languages over 129 corpora and the Penn Treebank (PTB). The results show that the law holds reasonably well for x > 2. Then, for comparison, the property is investigated with syntactically randomized sentences generated from the PTB. These results show that the property is almost reproducible even from simple random data. Further analysis of the property highlights more detailed characteristics of natural language.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Tanaka-Ishii","given":"Kumiko"}],"citation-key":"tanaka-ishii21","container-title":"Entropy","container-title-short":"Entropy","DOI":"10.3390/e23060661","ISSN":"1099-4300","issue":"6","issued":{"date-parts":[["2021",5,25]]},"language":"en","page":"661","source":"DOI.org (Crossref)","title":"Menzerath’s law in the syntax of languages compared with random sentences","type":"article-journal","URL":"https://www.mdpi.com/1099-4300/23/6/661","volume":"23"},
  {"id":"tchernichovskiBalancedImitationSustains2021","abstract":"Songbirds acquire songs by imitation, as humans do speech. Although imitation should drive convergence within a group and divergence through drift between groups, zebra finch songs sustain high diversity within a colony, but mild variation across colonies. We investigated this phenomenon by analyzing vocal learning statistics in 160 tutor-pupil pairs from a large breeding colony. Song imitation is persistently accurate in some families, but poor in others. This is not attributed to genetic differences, as fostered pupils copied their tutors’ songs as accurately or poorly as biological pupils. Rather, pupils of tutors with low song diversity make more improvisations compared to pupils of tutors with high song diversity. We suggest that a frequency dependent balanced imitation prevents extinction of rare song elements and overabundance of common ones, promoting repertoire diversity within groups, while constraining drift across groups, which together prevents the collapse of vocal culture into either complete uniformity or chaos.","author":[{"family":"Tchernichovski","given":"Ofer"},{"family":"Eisenberg-Edidin","given":"Sophie"},{"family":"Jarvis","given":"Erich D."}],"citation-key":"tchernichovskiBalancedImitationSustains2021","container-title":"Nature Communications","DOI":"10.1038/s41467-021-22852-3","ISSN":"20411723","issue":"1","issued":{"date-parts":[["2021"]]},"page":"1-14","PMID":"33963187","publisher":"Springer US","title":"Balanced imitation sustains song culture in zebra finches","type":"article-journal","URL":"http://dx.doi.org/10.1038/s41467-021-22852-3","volume":"12"},
  {"id":"tomasello99","author":[{"family":"Tomasello","given":"Michael"}],"citation-key":"tomasello99","issued":{"date-parts":[["1999"]]},"publisher":"Harvard University Press","title":"The Cultural Origins of Human Cognition","type":"book"},
  {"id":"treves_panzeri95","abstract":"Extracting information measures from limited experimental samples, such as those normally available when using data recorded in vivo from mammalian cortical neurons, is known to be plagued by a systematic error, which tends to bias the estimate upward. We calculate here the average of the bias, under certain conditions, as an asymptotic expansion in the inverse of the size of the data sample. The result agrees with numerical simulations, and is applicable, as an additive correction term, to measurements obtained under such conditions. Moreover, we discuss the implications for measurements obtained through other usual procedures.","accessed":{"date-parts":[["2023",8,15]]},"author":[{"family":"Treves","given":"Alessandro"},{"family":"Panzeri","given":"Stefano"}],"citation-key":"treves_panzeri95","container-title":"Neural Computation","container-title-short":"Neural Computation","DOI":"10.1162/neco.1995.7.2.399","ISSN":"0899-7667, 1530-888X","issue":"2","issued":{"date-parts":[["1995",3]]},"language":"en","page":"399-407","source":"DOI.org (Crossref)","title":"The upward bias in measures of information derived from limited data samples","type":"article-journal","URL":"https://direct.mit.edu/neco/article/7/2/399-407/5866","volume":"7"},
  {"id":"Verhoef2012","author":[{"family":"Verhoef","given":"Tessa"}],"citation-key":"Verhoef2012","container-title":"Language and Cognition","DOI":"10.1515/langcog-2012-0019","ISSN":"1866-9808","issue":"4","issued":{"date-parts":[["2012"]]},"page":"357-380","PMID":"23637710","title":"The origins of duality of patterning in artificial whistled languages","type":"article-journal","volume":"4"},
  {"id":"watanabe21","abstract":"In data science, an unknown information source is estimated by a predictive distribution defined from a statistical model and a prior. In an older Bayesian framework, it was explained that the Bayesian predictive distribution should be the best on the assumption that a statistical model is convinced to be correct and a prior is given by a subjective belief in a small world. However, such a restricted treatment of Bayesian inference cannot be applied to highly complicated statistical models and learning machines in a large world. In 1980, a new scientific paradigm of Bayesian inference was proposed by Akaike, in which both a model and a prior are candidate systems and they had better be designed by mathematical procedures so that the predictive distribution is the better approximation of unknown information source. Nowadays, Akaike’s proposal is widely accepted in statistics, data science, and machine learning. In this paper, in order to establish a mathematical foundation for developing a measure of a statistical model and a prior, we show the relation among the generalization loss, the information criteria, and the cross-validation loss, then compare them from three different points of view. First, their performances are compared in singular problems where the posterior distribution is far from any normal distribution. Second, they are studied in the case when a leverage sample point is contained in data. And last, their stochastic properties are clarified when they are used for the prior optimization problem. The mathematical and experimental comparison shows the equivalence and the difference among them, which we expect useful in practical applications.","accessed":{"date-parts":[["2023",8,15]]},"author":[{"family":"Watanabe","given":"Sumio"}],"citation-key":"watanabe21","container-title":"Japanese Journal of Statistics and Data Science","container-title-short":"Jpn J Stat Data Sci","DOI":"10.1007/s42081-021-00121-3","ISSN":"2520-8756, 2520-8764","issue":"1","issued":{"date-parts":[["2021",7]]},"language":"en","page":"1-19","source":"DOI.org (Crossref)","title":"Information criteria and cross validation for Bayesian inference in regular and singular cases","type":"article-journal","URL":"https://link.springer.com/10.1007/s42081-021-00121-3","volume":"4"},
  {"id":"watts_strogatz98","author":[{"family":"Watts","given":"Duncan J"},{"family":"Strogatz","given":"Steven H"}],"citation-key":"watts_strogatz98","container-title":"Nature","DOI":"10.1038/30918","issued":{"date-parts":[["1998"]]},"language":"en","page":"440-442","source":"Zotero","title":"Collective dynamics of ‘small-world’ networks","type":"article-journal","URL":"https://doi.org/10.1038/30918","volume":"393"},
  {"id":"weissUseNetworkAnalysis2014","abstract":"The singing of song birds can form complex signal systems comprised of numerous subunits sung with distinct combinatorial properties that have been described as syntax-like. This complexity has inspired inquiries into similarities of bird song to human language; but the quantitative analysis and description of song sequences is a challenging task. In this study, we analysed song sequences of common nightingales (\n              Luscinia megarhynchos\n              ) by means of a network analysis. We translated long nocturnal song sequences into networks of song types with song transitions as connectors. As network measures, we calculated shortest path length and transitivity and identified the ‘small-world’ character of nightingale song networks. Besides comparing network measures with conventional measures of song complexity, we also found a correlation between network measures and age of birds. Furthermore, we determined the numbers of in-coming and out-going edges of each song type, characterizing transition patterns. These transition patterns were shared across males for certain song types. Playbacks with different transition patterns provided first evidence that these patterns are responded to differently and thus play a role in singing interactions. We discuss potential functions of the network properties of song sequences in the framework of vocal leadership. Network approaches provide biologically meaningful parameters to describe the song structure of species with extremely large repertoires and complex rules of song retrieval.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Weiss","given":"Michael"},{"family":"Hultsch","given":"Henrike"},{"family":"Adam","given":"Iris"},{"family":"Scharff","given":"Constance"},{"family":"Kipper","given":"Silke"}],"citation-key":"weissUseNetworkAnalysis2014","container-title":"Proceedings of the Royal Society B: Biological Sciences","container-title-short":"Proc. R. Soc. B.","DOI":"10.1098/rspb.2014.0460","ISSN":"0962-8452, 1471-2954","issue":"1785","issued":{"date-parts":[["2014",6,22]]},"language":"en","page":"20140460","source":"DOI.org (Crossref)","title":"The use of network analysis to study complex animal communication systems: a study on nightingale song","title-short":"The use of network analysis to study complex animal communication systems","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rspb.2014.0460","volume":"281"},
  {"id":"wilks_blakey18","accessed":{"date-parts":[["2023",8,21]]},"author":[{"family":"Wilks","given":"Charlotte Elizabeth Holmes"},{"family":"Blakey","given":"Kirsten H."}],"citation-key":"wilks_blakey18","container-title":"Evolutionary Anthropology: Issues, News, and Reviews","container-title-short":"Evol Anthropol","DOI":"10.1002/evan.21724","ISSN":"10601538","issue":"5","issued":{"date-parts":[["2018",9]]},"language":"en","page":"180-183","source":"DOI.org (Crossref)","title":"In the jungle of cultural complexity","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1002/evan.21724","volume":"27"},
  {"id":"williamsCumulativeCulturalEvolution2022","abstract":"Abstract\n            Cumulative cultural evolution, the accumulation of sequential changes within a single socially learned behaviour that results in improved function, is prominent in humans and has been documented in experimental studies of captive animals and managed wild populations. Here, we provide evidence that cumulative cultural evolution has occurred in the learned songs of Savannah sparrows. In a first step, “click trains” replaced “high note clusters” over a period of three decades. We use mathematical modelling to show that this replacement is consistent with the action of selection, rather than drift or frequency-dependent bias. Generations later, young birds elaborated the “click train” song form by adding more clicks. We show that the new songs with more clicks elicit stronger behavioural responses from both males and females. Therefore, we suggest that a combination of social learning, innovation, and sexual selection favoring a specific discrete trait was followed by directional sexual selection that resulted in naturally occurring cumulative cultural evolution in the songs of this wild animal population.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Williams","given":"Heather"},{"family":"Scharf","given":"Andrew"},{"family":"Ryba","given":"Anna R."},{"family":"Ryan Norris","given":"D."},{"family":"Mennill","given":"Daniel J."},{"family":"Newman","given":"Amy E. M."},{"family":"Doucet","given":"Stéphanie M."},{"family":"Blackwood","given":"Julie C."}],"citation-key":"williamsCumulativeCulturalEvolution2022","container-title":"Nature Communications","container-title-short":"Nat Commun","DOI":"10.1038/s41467-022-31621-9","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[["2022",7,11]]},"language":"en","page":"4001","source":"DOI.org (Crossref)","title":"Cumulative cultural evolution and mechanisms for cultural selection in wild bird songs","type":"article-journal","URL":"https://www.nature.com/articles/s41467-022-31621-9","volume":"13"},
  {"id":"youngblood_etal23","abstract":"Cattle brands (ownership marks left on animals) are subject to forces influencing other graphic codes: the copying of constituent parts, pressure for distinctiveness and pressure for complexity. The historical record of cattle brands in some US states is complete owing to legal registration, providing a unique opportunity to assess how sampling processes leading to time- and space-averaging influence our ability to make inferences from limited datasets in fields like archaeology. In this preregistered study, we used a dataset of ∼81,000 Kansas cattle brands (1990–2016) to explore two aspects: (1) the relative influence of copying, pressure for distinctiveness and pressure for complexity on the creation and diffusion of brand components; and (2) the effects of time- and space-averaging on statistical signals. By conducting generative inference with an agent-based model, we found that the patterns in our data are consistent with copying and pressure for intermediate complexity. In addition, by comparing mixed and structured datasets, we found that these statistical signals of copying are robust to, and possibly boosted by, time- and spaceaveraging.","accessed":{"date-parts":[["2023",8,28]]},"author":[{"family":"Youngblood","given":"Mason"},{"family":"Miton","given":"Helena"},{"family":"Morin","given":"Olivier"}],"citation-key":"youngblood_etal23","container-title":"Evolutionary Human Sciences","container-title-short":"Evolut. Hum. Sci.","DOI":"10.1017/ehs.2023.5","ISSN":"2513-843X","issued":{"date-parts":[["2023"]]},"language":"en","page":"e10","source":"DOI.org (Crossref)","title":"Statistical signals of copying are robust to time- and space-averaging","type":"article-journal","URL":"https://www.cambridge.org/core/product/identifier/S2513843X23000051/type/journal_article","volume":"5"},
  {"id":"youngbloodContentBiasCultural2022","author":[{"family":"Youngblood","given":"Mason"},{"family":"Lahti","given":"David"}],"citation-key":"youngbloodContentBiasCultural2022","container-title":"Animal Behaviour","DOI":"10.1016/j.anbehav.2021.12.012","issued":{"date-parts":[["2022"]]},"page":"37-48","title":"Content bias in the cultural evolution of house finch song","type":"article-journal","volume":"185"},
  {"id":"zipf49","author":[{"family":"Zipf","given":"George"}],"citation-key":"zipf49","event-place":"Cambridge","issued":{"date-parts":[["1949"]]},"publisher":"Addison-Wesley","publisher-place":"Cambridge","title":"Human Behavior and the Principle of Least Effort: An Introducton to Human Ecology","type":"book"}
]
